{
  "data": [
    {
      "id": "8ed492c6-a849-4379-b597-55b8b3e7eaef",
      "userName": "tapatio salsa",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXl635XoFpbd3uIIWb8aZqDYmq9H9xLSxUTlIX4TCd3avI",
      "date": "2024-03-17T22:57:19.713Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=8ed492c6-a849-4379-b597-55b8b3e7eaef",
      "title": null,
      "text": "Slow. For an App that is sponsored on the big stage of UFC, I expected a way more fluid user experience. The UI is confusing and average at best. Some crypto needs you to buy in specific increments and the app doesn't automatically do that for you, you have to manually adjust. Unacceptable in my opinion. I expected more from this app. In app customer service was responsive so that's good. Deposits worked well. Selling is a little easier than buying. 3/5 ⭐.",
      "replyDate": "2024-03-17T23:31:15.867Z",
      "replyText": "Hello there. Please contact us over In-app or Web chat. We will gladly look into any performance difficulties you have encountered with the Crypto.com App and offer assistance as well as address any questions or concerns you may have.\n",
      "version": "3.182.0",
      "thumbsUp": 38,
      "criterias": []
    },
    {
      "id": "37562765-16c8-4992-9b61-2be58604b365",
      "userName": "Kyler",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWm6g2a2QlxjOK_QDuwG6mzpNeBpJzIDuua-2zTDABku6ot",
      "date": "2024-03-17T18:09:05.993Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=37562765-16c8-4992-9b61-2be58604b365",
      "title": null,
      "text": "Overall misleading marketing practices. I mostly have been trying to use the visa card, but it hardly works anywhere, and there's all these claims about getting cash back but it's at very specific locations and not entire chains. Any money on the card is basically locked up with no way to withdraw it. The quests are expensive. Overall not a beginner friendly app and misleading in many ways. There are much better options available",
      "replyDate": "2024-03-17T20:21:22.720Z",
      "replyText": "Hello Kyler! We welcome you to reach out to us via our web or in-app chat. We will gladly look into the difficulties you reported with the Crypto.com Visa card and advise you further. Thanks!",
      "version": "3.182.0",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "3ce7369c-0edf-44bf-9909-729579317354",
      "userName": "N M",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI7CTJAMu0I_IVclehcsqMgs62A1dOQ8tVCLaLR6D5Z=mo",
      "date": "2024-03-14T05:18:01.292Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=3ce7369c-0edf-44bf-9909-729579317354",
      "title": null,
      "text": "Log in experience is just downright horrible! What kind of developers decided to let a ads popup cover the bottom half of the number options for entering PIN? I had to verify via email, verify via SMS, then the app asked for PIN which I wasn't able to provide because the popup covered the numbers I needed to enter, and then it locked me out because I failed to log in 3 times! Unbelievable!",
      "replyDate": "2024-03-14T08:20:20.181Z",
      "replyText": "Hi there. We'd be happy to look into the login difficulties experienced and help you access your account. For further assistance feel free to contact us via web chat.",
      "version": "3.182.0",
      "thumbsUp": 71,
      "criterias": []
    },
    {
      "id": "e07ca2eb-1d80-4bb6-8a77-64a107b7f1d0",
      "userName": "Chris Warnquist",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLk1OPf5yraPFJzxmNDP7NRV5tfMW0cCn72MI0aFQjr=mo",
      "date": "2024-03-16T20:54:03.703Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=e07ca2eb-1d80-4bb6-8a77-64a107b7f1d0",
      "title": null,
      "text": "High spread, I truly hate the delay in the total asset amount. I do not know why my \"option\" trades decrease in value by a crazy amount while the price is way over my prediction and increasing. I think this app has a lot of potential, but it definitely needs work still. Would like to see better charts as well it's currently very limited. I'll give it 3 stars for now. Hopefully, changes are made.",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "38565054-70c5-41ee-a7ad-af1ab9ee2ff6",
      "userName": "Wolves Gaming",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUmHgre3_RH-ywQfZqkKBZ8pl1mnfKCna0xjIn17HuNSg",
      "date": "2024-03-16T04:36:18.148Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=38565054-70c5-41ee-a7ad-af1ab9ee2ff6",
      "title": null,
      "text": "Prices don't sync right among other problems. But it has the most crypto though. If issues would be fixed then I'd rate 5 stars.\"Update\"still same problems but worse I've lost $5k+ because of these issues I bought a coin at .011 it went up to .0139+ and It sold for almost the same price I bought it at. made $20 when I should have made $500. currently it's not worth buying/selling a coin unless it 2x's or more because you won't get anything out of it. Tried talking support, no help won't respond.",
      "replyDate": "2024-02-25T19:59:55.290Z",
      "replyText": "Hi there! We invite you to reach out to us via our Live chat or at contact@crypto.com. Our team will be happy to learn more about your review and assist with the difficulties you are experiencing with the Crypto.com App.",
      "version": "3.182.0",
      "thumbsUp": 31,
      "criterias": []
    },
    {
      "id": "95e7aeac-89ca-4acb-a4e0-ec8721a34916",
      "userName": "Jaret Montuoro",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXZWSB8YGwiGN1Nyh-dlo1XRKux-mguwXshUXiyQc5BzQQ",
      "date": "2024-03-15T06:56:19.893Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=95e7aeac-89ca-4acb-a4e0-ec8721a34916",
      "title": null,
      "text": "Wanted to test a few different apps before deciding on a good crypto wallet / investment. Unfortunately this app doesn't give you easy access to withdraw your funds. You have to setup a special wallet and even then you can't withdraw your money unless it's $100 USD. Definitely feels like a scam to keep your money. There are better apps out there for crypto that give you better access to your money. I would avoid an account with this one.",
      "replyDate": "2024-03-15T07:12:04.851Z",
      "replyText": "Hello Jaret, we will be glad to clear up any concerns that you have regarding our platform and assist you with your withdrawal. Please do not hesitate to reach out to us via our web or in-app chat so we can help you.",
      "version": "3.182.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "1bf289f5-2777-466a-84be-8ed9ca4e97c1",
      "userName": "Sean Burnette",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKYOeZ6azsOgWVBm5ibu2sUeitxQhUmiRshds1PO5pD=mo",
      "date": "2024-03-07T05:16:54.278Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=1bf289f5-2777-466a-84be-8ed9ca4e97c1",
      "title": null,
      "text": "This is the absolute worst experience I've had with a crypto app. First of all, they require transfers to external wallets to be at least $100. Now I have crypto stuck in this app that had I used literally any other crypto app I would have access to. It was also just a nightmare to use, not user friendly at all. I had to deposit enough in to make my balance at or above $100 to be able to transfer it somewhere else. The having to login anytime you exited the app was also a headache. Do not like",
      "replyDate": "2024-03-07T05:44:11.927Z",
      "replyText": "Hello Sean. We will gladly address your pending concerns regarding the Crypto.com App. Kindly send us a message via Live chat or email us at contact@crypto.com. Our team will assist with your balance and deposit queries you are having. Thank you!",
      "version": "3.181.0",
      "thumbsUp": 181,
      "criterias": []
    },
    {
      "id": "2d8350a6-a4b1-4ae4-a762-2d5cb80dc8c3",
      "userName": "Ducky Xiong",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXB1HecI2t5hnpU81tBz3aeBy0oN-2V2WISZv2PxRxEaA",
      "date": "2024-03-11T22:53:57.880Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=2d8350a6-a4b1-4ae4-a762-2d5cb80dc8c3",
      "title": null,
      "text": "Download if you wanna lose money, crypto prices does not reflect current prices. All BS! Very useful to buy and hold crypto currency but......price of currency not accurate at all! When selling the price is lower and when buying the price is higher than what \"current\" price is! Please fix asap! People losing money because of this and I am sure I am not the only one! Could used better chart and or more advances indicators too.",
      "replyDate": "2021-10-13T02:12:06.882Z",
      "replyText": "Hey there. We would be happy to assist with the case at hand - please share your referral ID or contact us via in-app chat or email (contact@crypto.com).\n",
      "version": "3.181.01",
      "thumbsUp": 234,
      "criterias": []
    },
    {
      "id": "543edc61-cf95-4dcc-8b94-64edc63ca595",
      "userName": "Hunter Rhodes",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLO2cix-dKsAVasm5Yw1kJE6Yl_SC4UlQpYMvqZJ_j1=mo",
      "date": "2024-03-11T11:13:06.298Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=543edc61-cf95-4dcc-8b94-64edc63ca595",
      "title": null,
      "text": "Terrible interface, and customer service, with at best shady business practices. They are either selling expired up/down options or advertising different prices than exist. I got notifications multiple times about prices rising while my up options were being automatically closed (expiring), and vice versa. I was locked out of my account while I had options open. It took 4 days after getting back into my account saying it had been a while since my email and if I still needed help to let them know",
      "replyDate": "2024-03-11T12:45:16.867Z",
      "replyText": "Hi Hunter. We'd gladly assist you further with the difficulties you have encountered with the Crypto.com App. In case you have already reached out to our team via Live chat or email at contact@crypto.com, we will make sure that you will be contacted back and assisted as soon as possible. Thank you!",
      "version": "3.181.01",
      "thumbsUp": 451,
      "criterias": []
    },
    {
      "id": "512ff3e3-14ba-4396-b6b0-62f665fa5978",
      "userName": "chris vasovski",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLJutQlH__jZkkdS4-wlAvL7HuOcGFDQkVD6jVmW1Z0=mo",
      "date": "2024-03-05T22:27:46.954Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=512ff3e3-14ba-4396-b6b0-62f665fa5978",
      "title": null,
      "text": "Very good app, but what's the point if you have ZERO customer support. It is literally impossible to speak to a human about an issue or concern. Deposit money into crypto very easily, and withdrawal is usually easy as well. But if something happens... you are ENTIRELY out of luck. There is absolutely no one who can help, and no one who cares. I wish you were as quick to respond to my support emails as you are to respond to bad ratings on here! I requested assistance MULTIPLE TIMES! NOTHING!!!",
      "replyDate": "2024-03-02T17:07:00.848Z",
      "replyText": "Hi Chris! Our team will gladly assist you further if you have encountered any issues with the platform. If you have contacted us via live chat or via email at contact@crypto.com, rest assured that you will be assisted as soon as possible.",
      "version": "3.180.2",
      "thumbsUp": 580,
      "criterias": []
    },
    {
      "id": "beb77675-3ac3-4820-80d5-0b0e70686f67",
      "userName": "Andrew Pods",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVyqm4sXwinFx91fgtQ7z6WtqmPCbD60QExbn4rfKvQn0Y",
      "date": "2024-01-07T00:34:02.987Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=beb77675-3ac3-4820-80d5-0b0e70686f67",
      "title": null,
      "text": "The app in general works fine (there are glitches sometimes but after app restart it seems back to normal). The main concern that I really don't like is the support option! It says they are answering within 2 hours but I always wait a couple of days for their reply, even I send messages right after they replied, in a few seconds. This is really annoying.",
      "replyDate": null,
      "replyText": null,
      "version": "3.177.0",
      "thumbsUp": 219,
      "criterias": []
    },
    {
      "id": "f5a1e75b-aa97-4d2e-a7ac-49cb0dac0e9f",
      "userName": "Jaime Rayon",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUBqXE6EVCn7hjBswHjdZeVsLvoqGLMi33pXXGT5gQD1rY",
      "date": "2024-03-05T11:26:19.698Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=f5a1e75b-aa97-4d2e-a7ac-49cb0dac0e9f",
      "title": null,
      "text": "This application is deceptive. Unexpected fees appear at every turn. While I understand the need for security, the constant requirement to log in and perform excessive authentication is very frustrating. However, what truly disappointed me was when I made a transfer from this app to an external wallet, and it charged a fee equivalent to half of my investment, without prior notice. Fortunately, I was not dealing with a large sum of money, but this experience felt highly deceptive.",
      "replyDate": null,
      "replyText": null,
      "version": "3.180.2",
      "thumbsUp": 512,
      "criterias": []
    },
    {
      "id": "66e35c97-239a-459b-a214-aa29f3653e35",
      "userName": "Kadi Olson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJunTGeC6TDP3czXz6r9bxIB3cAO77Escyh809oPxOC=mo",
      "date": "2024-02-06T00:10:52.572Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=66e35c97-239a-459b-a214-aa29f3653e35",
      "title": null,
      "text": "Frustrating issue keeps happening. For no apparent reason I am unable to purchase crypto. I keep getting an ERROR: REJECTED popup notice. Called my bank. Not an issue on that end. Contacted customer support. No response and it's been 2 days. This is the 2nd time that this has happened. The 1st time took almost 2 weeks to get resolved. Very unhappy with this app!",
      "replyDate": "2024-02-06T00:34:37.502Z",
      "replyText": "Hello Kadi! We would be happy to look into the difficulties you have encountered when initiating crypto purchases and assist you accordingly. To do so, please send us a message via Live chat or email us at contact@crypto.com. Thank you!",
      "version": "3.179.1",
      "thumbsUp": 331,
      "criterias": []
    },
    {
      "id": "c0bbeab5-6641-48f8-8d1d-3ff3de094df6",
      "userName": "Hardworking Man",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXbMefaXaJGYB2PdWjSKzD5Z8trcF-ZDw6PGNMVcizIng",
      "date": "2024-02-28T15:34:46.721Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=c0bbeab5-6641-48f8-8d1d-3ff3de094df6",
      "title": null,
      "text": "This app gets slower every time it updates. It's soo slow now that I can barely get on... (edit: Since I said what I said above, now the app is really giving me problems. Even if I have full cell signal, when I start this app, my signal strength drops to 1 bar or none. No other apps I have do this...) (edit 2: They fixed it. Cool. Running smoother now.)",
      "replyDate": "2024-02-09T00:02:39.560Z",
      "replyText": "Hello there! We release updates to address and improve different aspects of our platform, including new additions based on the requests of our users. You are welcome to get in touch with us via Live chat or via email at contact@crypto.com, so we can offer assistance with any difficulties you may have encountered.",
      "version": "3.180.2",
      "thumbsUp": 397,
      "criterias": []
    },
    {
      "id": "41c3bfec-acd9-4031-91b5-e4fed3ac36ad",
      "userName": "Jordon Crump",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVdJB2gJOYjrf5RyAZbiZF4RFag3L6FeNBWj30dYItxdAc",
      "date": "2023-12-29T07:50:10.613Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=41c3bfec-acd9-4031-91b5-e4fed3ac36ad",
      "title": null,
      "text": "Just will not open the app. When I tap on the app, a very short flash goes by, like the app was about to open, but that's it. My phone just stays on the home screen. I do that a couple times before a popup says \"app keeps closing.\" I tried the website, but it just points me back to the mobile app. EDIT: They fixed it pretty fast! Wow.. You guys are quick. Thanks. I'll try the app out now. 3 stars for a speedy and helpful response.",
      "replyDate": "2023-12-23T19:28:05.774Z",
      "replyText": "Hi, Jordon. We would gladly look into the login difficulties you have encountered and offer assistance. To do so, please get in touch with us via our Live chat or at contact@crypto.com.",
      "version": "3.176.4",
      "thumbsUp": 67,
      "criterias": []
    },
    {
      "id": "a0c9993e-cf14-49c7-9ab6-02d252984a59",
      "userName": "GregoryAM",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUG6Ov2oDvyJzw7bkwRKSfZO8npDKmeD0IWVzKTtUcU_qg",
      "date": "2023-12-22T22:35:12.256Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a0c9993e-cf14-49c7-9ab6-02d252984a59",
      "title": null,
      "text": "Having issues using the app on Google Pixel 7 Pro. App does not start, it stays on the Blue screen just after opening and force closes. Would like to get back into the app to check balances, but unable to do so with this issue persistening. Edit: App now works after update which I'm relieved to see. Still a wonderful app, regardless of the issue I was having.",
      "replyDate": "2023-12-21T02:47:41.622Z",
      "replyText": "Hello, Gregory! We would be glad to take a further look into the difficulty you have experienced with accessing the Crypto.com App and assist you accordingly. Please contact us via Live chat or via email at contact@crypto.com.",
      "version": "3.176.3",
      "thumbsUp": 269,
      "criterias": []
    },
    {
      "id": "69cd4ead-0871-458c-8e69-a71556452c94",
      "userName": "Jacelinswow",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKkg5-n7tawBcePpXAbEi5xgx2ADdhX4eLFUMPYjW0W=mo",
      "date": "2024-01-20T09:59:49.900Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=69cd4ead-0871-458c-8e69-a71556452c94",
      "title": null,
      "text": "Biggest scam app you can deal with, sure adding money is easy, withdrawing it? A variable nightmare dealing with fiat wallet hooking up to your bank account. Took hours and I eventually just gave up. The money is lost because the creators didn't think enough to add a number to call. Or if they did you can't find it in this damned app.",
      "replyDate": "2024-01-20T11:10:35.237Z",
      "replyText": "Hello there! Our team will be happy to look into the withdrawal difficulties you have encountered and address any concerns you might have. Please send us a message via our Live chat or at contact@crypto.com with more details on the matter.",
      "version": "3.178.0",
      "thumbsUp": 317,
      "criterias": []
    },
    {
      "id": "415a5ad3-04ba-4b56-82ea-03a25c2f8497",
      "userName": "Arthur Rosian",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLnFl8urpwXTZbvlozBFgg3QABm65JtOllM0HPz9CPf=mo",
      "date": "2023-12-22T22:51:02.505Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=415a5ad3-04ba-4b56-82ea-03a25c2f8497",
      "title": null,
      "text": "The app has been good up until now. I can't access the app or my account. I emailed customer support. No response. This to say the least is concerning. They fixed it but now 2 days later the app isn't working again. This app continues to crash. It's down more than it's up. This is a big problem. I'm thinking it time to close out my account once I can get back on the app. This is disappointing. Please tell me when I can access the app and my account.",
      "replyDate": "2023-12-15T17:39:58.927Z",
      "replyText": "Hello, Arthur! If you have already reached out to us via Live chat or at contact@crypto.com, rest assured you will be assisted with the access difficulties that you face as soon as possible. Thank you!",
      "version": "3.176.3",
      "thumbsUp": 130,
      "criterias": []
    },
    {
      "id": "c7ff2348-f433-4c19-bfbd-278f60681819",
      "userName": "Smo Borgus",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI3Xuj78oYWx59poD8H-98HU3FAiY40I3488ocxIeZ3=mo",
      "date": "2024-02-20T22:37:37.570Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=c7ff2348-f433-4c19-bfbd-278f60681819",
      "title": null,
      "text": "Almost impossible to fund the account. Almost all cards and banks are blocked. Support is slow and useless. From hours of research chase is the only one that allows ACH transfer, and that takes days. Also to get set up they need your driver's license, social security and selfie. But once setup, the card and earn system works. Would probably not use for actual trading.",
      "replyDate": "2024-02-20T23:23:55.272Z",
      "replyText": "Hello there! Please send us a message via Live chat or email us at contact@crypto.com. We will gladly provide you with additional information on our products and services, and address any concerns you may have. Thank you!",
      "version": "3.180.2",
      "thumbsUp": 101,
      "criterias": []
    },
    {
      "id": "c6617932-900b-4b19-a781-b3f6844bb8fd",
      "userName": "Tara Owen",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI9PXP2S7cO_EKWX63PAtP-FVeXm9Cvrn9y7uep4rzW=mo",
      "date": "2024-01-10T18:24:36.230Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=c6617932-900b-4b19-a781-b3f6844bb8fd",
      "title": null,
      "text": "My app will not open. Just keeps getting an error message that the app keeps closing. 😔 UPDATE: They had me email them my issue and..... they fixed it! Thank you soooo much! ❤️ changed from a 1 star to 5! And.... now I've emailed a quesion twice and get no response. There's really no FAQ or anything on deposits, withdrawls, fiat? Wallets? When can I withdraw funds to an external wallet? And when will i know when i can? Do i have to wait for every transaction? Please respond to my email.",
      "replyDate": "2023-12-22T14:07:32.577Z",
      "replyText": "Hello, Tara! We'd like to look into the issues you are having when trying to open the Crypto.com App. Please reach out to us via live chat or email at contact@crypto.com, so we can offer assistance.",
      "version": "3.177.0",
      "thumbsUp": 57,
      "criterias": []
    },
    {
      "id": "9e066281-6681-467c-b969-95a7f9c587fb",
      "userName": "Armando Bojorges",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUQvl1jjMb3q8VvdNXRRP3F5-3mctGV31BwTQcLbOTrIH0",
      "date": "2023-12-20T23:56:55.377Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=9e066281-6681-467c-b969-95a7f9c587fb",
      "title": null,
      "text": "The app keeps crashing version 3.176.2. It was working fine but last week they did something that starting crashing. Today the app doesn't even open. How can I open a case when the App does not even open? I have cleared the cache, reset the App, uninstalled, reinstalled and still just getting a Blue screen! I tried to chat support but after 30 minutes and no one is available besides this message \"Thank you! A member of our team will contact you shortly\"",
      "replyDate": "2023-12-20T16:18:31.375Z",
      "replyText": "Hi, Armando. We invite you to contact us via our Live chat or at contact@crypto.com, so we can help with the difficulties you have encountered accessing our platform. Thank you!",
      "version": "3.176.2",
      "thumbsUp": 470,
      "criterias": []
    },
    {
      "id": "b88eda7b-98d1-4123-8008-9e4260910350",
      "userName": "Mike Shrimpton",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVZ0yz9Pe23z_EqsLPwUWkrHFHc9ZKCQIz7HwbBn7Yvag",
      "date": "2023-12-14T02:02:11.171Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=b88eda7b-98d1-4123-8008-9e4260910350",
      "title": null,
      "text": "Most strike up/down options are sold at instant loss because they sell them well above current market value. Deriv contract interface often lags out and requires a complete phone restart to fix as well. Really horrible if that happens when you're trying to sell, only to come back to a loss because of the app simply not loading. Support is getting slower and slower at replies as well, been waiting over week now. Other than deriv contacts, go for it. Avoid their derivs because of the crashing.",
      "replyDate": null,
      "replyText": null,
      "version": "3.176.0",
      "thumbsUp": 814,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "311872fb-1e25-4be9-b7b6-f7e9a67ee72d",
      "userName": "Ben Moorman",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocINxuSFfXKGjGTRrwKk18lnXX0MlAS-XYyd0Hep_bO2=mo",
      "date": "2023-10-15T11:53:21.452Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=311872fb-1e25-4be9-b7b6-f7e9a67ee72d",
      "title": null,
      "text": "it has upsides and downsides, I used to be able to put money on here strait from my debit card but now I have to wire it which is wierd and inconvienent. easy to transfer crypto on and off the exchange to other crypto wallets, staking is easy here and a pull out at any time option is available, no chart to monitor my overall progress which would be nice, been waiting on the card for over 3 years now, customer service is no help. app can be confusing at first but once you figure it out it isn't b",
      "replyDate": "2023-10-15T12:16:34.658Z",
      "replyText": "Hi Ben. We welcome you to reach us via Live chat or at contact@crypto.com. We'd be glad to look into your Crypto.com Visa card enquiry and provide you with more information on the available deposit options.",
      "version": "3.171.2",
      "thumbsUp": 120,
      "criterias": []
    },
    {
      "id": "b944b9a2-9249-40b8-b7bf-2432a14b28d3",
      "userName": "Amusing Perusing",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWnwErDFkCbIMaHgaWgK0P0Ont85hp0Sz7s8Q65MkoC98c",
      "date": "2023-12-17T05:33:31.558Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=b944b9a2-9249-40b8-b7bf-2432a14b28d3",
      "title": null,
      "text": "Worst app ever. I have concert tickets. Apparently I'm required to install the app to access my tickets except its impossible to sign up. Keeps saying my cell number is wrong. I've literally had the same number since cell phones became a thing so no, I don't have another number associated with my email. I've checked my email setting and as I already knew, my cell phone is connected with my email address. Whats the point of an app no one can sign up with? No one at supports gets back to me.",
      "replyDate": "2023-12-16T09:42:27.625Z",
      "replyText": "Hi Shawn! We will be more than happy to look into the matter and help you out with the difficulties you are facing when signing up. Please reach out to us via Live chat or email at contact@crypto.com, so we can assist you. Thank you!",
      "version": "3.176.1",
      "thumbsUp": 222,
      "criterias": []
    },
    {
      "id": "3de8e6a3-038b-4ebe-9e36-b207a1642b52",
      "userName": "dave I",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWBDoRTmLEwDsaDuT_8qqMuSr0OXf4wI26dAr0eYCh_wvE",
      "date": "2023-12-17T16:23:20.498Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=3de8e6a3-038b-4ebe-9e36-b207a1642b52",
      "title": null,
      "text": "Stalling again, not working well. Too much emphasis on a \"game like\" app. Poor choice. Fix this: while in 'your account' if you click on \"crypto wallet\" it opens up a list of coins you own. If you click on the dollar amount just to the right of the word 'wallet' you see every coin. Why is this still happening? I'm in my account, I should only ever see what I own. There are two other areas to look for coins one doesn't own. And yes, I've told customer support some time ago.",
      "replyDate": "2022-08-17T17:13:33.701Z",
      "replyText": "Hello, Dave. We truly appreciate your feedback as hearing the opinion of our users helps us to better understand your needs and improve our services. You’re welcome to contact us via our in-app chat or email at contact@crypto.com, if you have any other suggestions!",
      "version": "3.176.1",
      "thumbsUp": 640,
      "criterias": [
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "406043f6-ddf4-4640-bb48-392bd516517b",
      "userName": "Michael Huffstutler",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIZNWkxqNko42jDlUpV_rG2Acpwyhl2-R62o9ihxDCb=mo",
      "date": "2023-11-13T07:40:06.367Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=406043f6-ddf4-4640-bb48-392bd516517b",
      "title": null,
      "text": "I have tried following previous advice, such as restarting my phone, clearing data from this app, and even uninstalling and reinstalling. So that means there are some bugs within the app itself that need to be fixed.The value of a coin displayed in the UpDown option purchase section does not reflect what is shown in the Position Details section. If I try to close early to take advantage of a temporary gain, or minimize my losses, a lot of times I have run into problems. Still needs to be fixed.",
      "replyDate": "2023-10-22T22:38:38.713Z",
      "replyText": "Hello, Michael! You are welcome to get back in touch with us via Live chat or email at contact@crypto.com. We would like to take a closer look into the difficulty that you have experienced with the UpDown Options feature and assist you further. Thank you!",
      "version": "3.173.1",
      "thumbsUp": 82,
      "criterias": []
    },
    {
      "id": "db4d7687-586d-4c16-ab38-cf5fe7c66e8d",
      "userName": "D & THE WET CHIPS",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJoWTPVaqRKkzpjDPeZkcVIoH_OpBelMOW3X19j72froCI=mo",
      "date": "2023-12-15T18:54:15.477Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=db4d7687-586d-4c16-ab38-cf5fe7c66e8d",
      "title": null,
      "text": "I've been trying to open this app for two days. Uninstalling redownloading, calling support and being rejected because it was not the number for that issue not forwarded, no reply from the emails, and adjusted permissions, trouble shooting, etc. I've sent or the messages left through the official website support. I would NEVER recommend an app with only one way to get your money out and a complete lack of support from the company.",
      "replyDate": "2023-12-15T19:19:36.556Z",
      "replyText": "Hello there, if you have contacted us via our live chat or at contact@crypto.com, we can assure you that our team will provide you with a response as soon as possible and help you with accessing our platform.",
      "version": "3.176.1",
      "thumbsUp": 111,
      "criterias": []
    },
    {
      "id": "f8988e79-c355-402c-bbcb-5462f46c7412",
      "userName": "Guilherme Santos",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWG2fsnvbQRrsERXyXSbBDN7Cw18g3f5ohf3NfMmt6dEJA",
      "date": "2024-03-13T23:14:15.679Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=f8988e79-c355-402c-bbcb-5462f46c7412",
      "title": null,
      "text": "App is quite good, especially with the new skin. My main complaint is the card part of the app. It looks basic and slow. Why not build around that when so many people use it for the cards? Really, any design would be better than what we have.. could even be a separate app that would allow for other people (partners) to view the account and transactions.",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "a0ba2b2c-6184-4f8d-ae60-3a508a8ea9a3",
      "userName": "brandon glyde",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWo6qAhgZrngga3Ll6Nyh8wCMSddERPd75rQB_Z037rJmk",
      "date": "2024-03-13T19:34:01.860Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a0ba2b2c-6184-4f8d-ae60-3a508a8ea9a3",
      "title": null,
      "text": "Overall a great beginner friendly exchange. Fees are a little high but not obsurd. Only reason it did not receive 5 stars is pretty consistenly *before* it asks you for a password/fingerprint, it will flash your full account balance just for a second. This I feel is pretty important for obvious reasons. Other than this small issure there is plenty of rewards and rebates you can get and very user friendly. Definitely recommend if you're looking for somewhere to get started in spot trading",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "162f9e36-16f0-4a1f-a991-54e95c1b6624",
      "userName": "Rafa 031",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVop6OX7nhG5OYKQerrHPt4dLfJ9lTf6Hy85izbphRQxio",
      "date": "2024-03-15T22:55:58.165Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=162f9e36-16f0-4a1f-a991-54e95c1b6624",
      "title": null,
      "text": "App not working after most recent March update and it requires updates too often. Update: I've noticed a few people are having trouble with the App since the latest update and keep being told to contact customer support. I have tried several times now but the chat service link is almost impossible to find and does not even work. I can't use the in-App messaging service because the app won't even start. I've read from several comments that calling yields no results but I'll try that next.",
      "replyDate": "2024-03-14T21:38:07.777Z",
      "replyText": "Hi there! Please send us a message via web chat or in-app chat. Our team will gladly assist with any application difficulties you are having. Thank you.",
      "version": "3.182.0",
      "thumbsUp": 20,
      "criterias": []
    },
    {
      "id": "70419246-622a-4a11-9d96-2ba18bce6ce1",
      "userName": "JohnMcLane",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWZQLPmNkkuvYvIeU6kdOBdMvaM8SlHMjuqeMB0zjvWEng",
      "date": "2024-03-15T08:42:01.953Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=70419246-622a-4a11-9d96-2ba18bce6ce1",
      "title": null,
      "text": "App won't launch after last patch (11/3/24), just keeps crashing over and over. Been using for 3 years before I realised how vulnerable my money is if the app dies and I can't access my wallets. Edit* had a few pending Android updates I needed to do, once I upgraded and reinstalled crypto app it works again. I've amended the review, but it's not the first time the app has 'died'...",
      "replyDate": "2024-03-15T08:05:18.872Z",
      "replyText": "Hi John! We would gladly take a closer look at the difficulties faced with the Crypto.com App after the last update. To do so, please reach out to us via our web chat, so we can help you access your account. Thank you.",
      "version": "3.182.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "ea0054d0-ba5a-48b1-8583-b465a2c198c5",
      "userName": "Kevin Deegan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUFjrdVA10-nB_BrKk5Cyxdo2ECCRfslkxZiJZsxJInpk3O",
      "date": "2024-03-08T21:25:07.700Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=ea0054d0-ba5a-48b1-8583-b465a2c198c5",
      "title": null,
      "text": "Extremely slow UI. All card rewards are basically gone so they're practically useless. Huge fees when transferring crypto to another wallet, I tried to send €70btc to a friend and literally lost half of it. You can't even use the app if it's not up to the latest update which is extremely frustrating if you need to access your card/funds quickly. On top of this & the slow UI, you get hit with about 3 pop ups for random features every time you open the app too. Not worth it anymore.",
      "replyDate": null,
      "replyText": null,
      "version": "3.180.2",
      "thumbsUp": 218,
      "criterias": []
    },
    {
      "id": "f5de7993-1d8e-4e6e-b096-0fe4ecd8b36f",
      "userName": "dark matter (aka donkey balls)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXzO6AbbJj9OXDRUO03t73wDDsmLgcJi0RV9pWOR8ghb60",
      "date": "2024-03-18T07:46:50.332Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=f5de7993-1d8e-4e6e-b096-0fe4ecd8b36f",
      "title": null,
      "text": "Very slow, latest update crashes the app .. cannot use for second day... cannot top up the card, getting really annoyed with this. trying to change my address for a more than a month now, no answer,or a stupid generic email\" if your query stil valid, let us know...\" Response to your response: do you think I haven't contacted the support? I HAVE!",
      "replyDate": "2024-03-14T21:19:44.558Z",
      "replyText": "Hi there. Please send us a message via our web chat or in-app chat. Our team will gladly assist with updating your address. Any additional pending queries will also be addressed.",
      "version": "3.182.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "9e8f98ca-f329-48e2-945f-e188dc42af58",
      "userName": "Henry Liang",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWFzPQPXD8TflXhBcg9A31Z9SB2xwBBeUMVZ7RGq0hnnEU",
      "date": "2024-03-14T02:17:07.670Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=9e8f98ca-f329-48e2-945f-e188dc42af58",
      "title": null,
      "text": "Very disappointed with the service. If you claim to need to \"verify my address\", you don't need 3 days to do it. Especially after I asked about it multiple times and your agents were of absolutely zero help, telling me to use the \"in-app chat\" when I WAS ALREADY THERE IN THE FIRST PLACE. Use another platform for crypto. This one is worthless.",
      "replyDate": "2024-03-14T08:14:51.849Z",
      "replyText": "Hello Henry, we assure you that if you have reached out to us via our web or in-app chat, our team will provide you with a response as soon as possible and assist you with your address verification.",
      "version": "3.182.0",
      "thumbsUp": 12,
      "criterias": []
    },
    {
      "id": "94a99fe1-28b3-443d-857f-878701057257",
      "userName": "Damir Ramljak",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUyaX84-vD66uP3RofkO6mPTP0c1as-xq_M4IBUgMm9740",
      "date": "2024-03-06T13:40:41.602Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=94a99fe1-28b3-443d-857f-878701057257",
      "title": null,
      "text": "Notifications can not be turned off unless one does the full disable on the phone. Then you don't receive any information (for example, if someone got into your account, you wouldn't know) Fees - If you have a physical card, they charge you for not using it. When buying tokens, it is one of the most expensive. The app is okay for complete beginners, but not for advanced users. Ex, to reach your assets, one needs to do too many steps to reach the information needed.",
      "replyDate": null,
      "replyText": null,
      "version": "3.180.2",
      "thumbsUp": 198,
      "criterias": []
    },
    {
      "id": "1065f3a2-7691-4d39-bf0b-d76ba19c6227",
      "userName": "Sawan Sawan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVBvb6zc0Lbov61aJFFij0HW6cIWYFVJRd1fMYom8tljA",
      "date": "2024-01-19T21:25:27.961Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=1065f3a2-7691-4d39-bf0b-d76ba19c6227",
      "title": null,
      "text": "App got consistently worse over time. Everything is so cluttered, everytime I open the app there's an announcement that doesn't go away until I tap it, navigating the app is so slow, and no it's not my device/internet, app was much faster compared to a year ago on the same device. The final nail in the coffin is the horrible support experience these past months. They used to reply literally within a few minutes last year, now they reply after 2 weeks (if they reply). I'm looking at other options",
      "replyDate": null,
      "replyText": null,
      "version": "3.178.0",
      "thumbsUp": 272,
      "criterias": []
    },
    {
      "id": "97359ad4-5c9e-4c54-9504-c717021977f5",
      "userName": "Paul Harsley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK7-J57fxIcoXQQ5Ist-09lrs_a5vfFb8DrZ5Ad4jTT=mo",
      "date": "2024-03-17T21:48:47.650Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=97359ad4-5c9e-4c54-9504-c717021977f5",
      "title": null,
      "text": "After the latest update I can't even open the app. I accidently deleted my review where they replied saying get in touch using their chat on the app! I can't open the app at all. It \"stops\" before it opens! I have no access to my crypto wallet. Do not use this platform. This happens far too often. I now do not have access to thousands of pounds worth of crypto. Reply to Developer: I cannot contact you via chat as I cannot get the app to open and your website just links back to the app.",
      "replyDate": "2024-03-17T21:31:08.980Z",
      "replyText": "Hello Paul! We will gladly look into any performance difficulties you have encountered with the Crypto.com App and offer assistance. Please contact us over In-app or Web chat. Thank you!",
      "version": "3.182.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "171919b6-bfb8-4c0c-83c0-2c8b0a5bbcff",
      "userName": "Onur Bassist",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUd2W8oghO6HImgMQWPgAOfUXKvvNVjUw4EMzir--O4eZ0",
      "date": "2024-01-04T12:22:26.883Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=171919b6-bfb8-4c0c-83c0-2c8b0a5bbcff",
      "title": null,
      "text": "I have Android 14 on Samsung A54 and the app doesn't start. It crashes every time. I reinstalled it several times, give all the permissions needed. Nothing helped. On the info page of the application is written Android 8 and up. I don't understand the behavior. Developers, please fix the issue. Thank you edit : The recommendation with email didn't work, because I didn't get any answer. But the app got an update and since then it works. I will edit my review.",
      "replyDate": "2023-12-22T09:59:27.957Z",
      "replyText": "Hi Onur! We will be happy to take a closer look at the difficulty you faced on the app. Please get in touch with us via Live chat or email at contact@crypto.com, so we can help you. Thank you!",
      "version": "3.177.0",
      "thumbsUp": 116,
      "criterias": []
    },
    {
      "id": "ffbe48f2-505a-4643-a9c1-faea93d551bb",
      "userName": "Tawny Wilkins",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKjY_YWRqwr8KnuUTVS7ooFZFlaraSFrVt04eAr6aFu=mo",
      "date": "2024-03-15T06:55:59.795Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=ffbe48f2-505a-4643-a9c1-faea93d551bb",
      "title": null,
      "text": "I have not been able to login for a couple weeks now. They dont give you an option to login besides emailing a link but you never get the email. I have quite a bit of money in the app. Extremely frustrating.(10/12/2021) Update I still have not got into my account. I get an error code that no one seems to be able to resolve. Horrible customer service. If I get in I will update.",
      "replyDate": "2024-03-15T07:14:46.913Z",
      "replyText": "Hi Tawny. Our team will gladly take a closer look into the login difficulties you have experienced and help you access your account. To do so, we welcome you to contact us via our webchat.",
      "version": "3.182.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "8631fa90-0cbf-4a8e-92c7-8bf9356a3e35",
      "userName": "Almir Dizdarevic",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKmkkVdGcY3vDgt0TqtzinfO_o7G07hezBbGe32wkOa=mo",
      "date": "2024-03-13T17:29:51.972Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=8631fa90-0cbf-4a8e-92c7-8bf9356a3e35",
      "title": null,
      "text": "App is basically useless after I close it. Every time I try to log in, it asks me for email, then it sends me a link to log in, then a code... iys like I just installed the app every time I try to log in. Update: Log in has been fixed, but now I'm having hard time depositing money into the account. Almost 15 rejections just today. Not a good thing when you are trying to buy certain crypto at certain times. Went thru all the steps, got the funds, got everything proper it Kris rejecting",
      "replyDate": "2023-03-18T02:40:34.791Z",
      "replyText": "Hello Almir! We would be happy to help you log in to your account. You are welcome to contact us via Live chat or at contact@crypto.com, for further assistance. Thank you!",
      "version": "3.182.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "b88c86a6-f2eb-4536-8627-0d545eb579c6",
      "userName": "Mignon Lyons",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX03P32t115n6pbzFQw2xaHgstsKD1XKbjakBxM8vAju7UB",
      "date": "2024-03-17T17:09:42.738Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=b88c86a6-f2eb-4536-8627-0d545eb579c6",
      "title": null,
      "text": "No support. I have been waiting for 4 days to contact me and they sent an email and a link that as soon as it opens freezes and so no possible way to contact support for help. The email is a bot and you never get contacted back. The link that you see in the review responses doesn't work. I am wondering if a class action lawsuit for false advertising and false support, after putting money into this app, might wake up the admin? I tried and tried to get into contact with tech support with no avail",
      "replyDate": "2024-03-10T04:20:26.173Z",
      "replyText": "Hi Mignon! If you have already reached us via Live chat or via email at contact@crypto.com, then we can assure you that our team will get back to you as soon as possible and assist with your enquiry.",
      "version": "3.182.0",
      "thumbsUp": 16,
      "criterias": []
    },
    {
      "id": "a1f0f57f-f033-46fd-91db-0203673a2793",
      "userName": "Rūdolfs Rava",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIwCx7VpngKEAjoCCBRMxLm8_UnvAo8TsuxTvxBdaT1=mo",
      "date": "2024-03-18T12:46:23.752Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a1f0f57f-f033-46fd-91db-0203673a2793",
      "title": null,
      "text": "Little update: its a week more and nothing is done, any response, any support. In app messages nobody responds. Support level is zero. when you want to buy crypto- no problem! when you want to sell some you have to be lucky- my account is not verified for about a month. wrote 2x in app, 1x in emails sending all requested info - received few days after every request just an auto reply with zero information, nothing else.",
      "replyDate": "2024-03-11T21:43:24.588Z",
      "replyText": "Hello Rudolfs! We will gladly look into your account verification and offer further assistance. If you have already contacted us via Live chat or email at contact@crypto.com, rest assured that you will receive a response as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "e2fdda67-7402-4add-ab32-00c4dea74b42",
      "userName": "ron alston",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIyXroaOT6RqPTCu8zvPcyByKbUsNDyUjzjhkoq_E0_=mo",
      "date": "2024-03-13T04:13:01.190Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=e2fdda67-7402-4add-ab32-00c4dea74b42",
      "title": null,
      "text": "App won't let me login. It won't let me reset my password it won't verify my account it's a never ending cycle of clicking different links that lead to nowhere. I can't check my account balance can't get anyone from customer service to respond except for I can only believe to be as a bot named Chris that can't help me. When referred to a specialist nobody ever enters the chat. No one responds via email. Still haven't gotten an actual person to reach out just another generic email",
      "replyDate": "2024-03-13T03:16:24.898Z",
      "replyText": "Hello Ron! Please send us a message via Live chat or email us at contact@crypto.com. We will gladly look into the matter and help you access your Crypto.com account.",
      "version": "3.182.0",
      "thumbsUp": 28,
      "criterias": []
    },
    {
      "id": "556920cd-d6c2-48e1-ba82-fe2b2d0f8f99",
      "userName": "Si Bi",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIIW2XVNcOzO6Oc0Ods9xigW7pxnaaeP9fbl-3W9p5W=mo",
      "date": "2024-03-13T14:47:48.823Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=556920cd-d6c2-48e1-ba82-fe2b2d0f8f99",
      "title": null,
      "text": "App needs work. It's very important that I see my own total investment and how much I'm down. I find myself having to calculate it everytime which is very inconvenient. There should be a detailed section that displays total booking cost (total invested$) and then the market price. So I could see the difference % and how much I'm down/up. AFAIK, those red/green indicators don't really help with that. Averaging price of crypto purchased would be nice too. (I buy it many times at different prices)",
      "replyDate": "2022-01-15T12:06:16.438Z",
      "replyText": "Hi there! We are constantly working on improving our products and your feedback is greatly appreciated. If you have any questions or concerns on the matter, please do not hesitate to contact is via the in app chat or via email at contact@crypto.com.",
      "version": "3.181.01",
      "thumbsUp": 82,
      "criterias": []
    },
    {
      "id": "7b0ed1d5-682d-496f-bc83-12ac301f11da",
      "userName": "f i",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLwxx5J6BjYTEPWSDb4wbZ3QoBqdAf_PYJ6puk0_PFM=mo",
      "date": "2024-03-08T03:11:19.793Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=7b0ed1d5-682d-496f-bc83-12ac301f11da",
      "title": null,
      "text": "There is absolutely no customer support! I have sent emails to their address several times , again no response! The app also got stuck and frozen at a pending state for my card application for a week....even though the app looked fine....I am frustrated strongly by not getting ANY help and support! (I have email them after below response- I will let know here how supportive they really were after emailing to given email!) ---No response yet!! Plus there is no Live support at the app!!!",
      "replyDate": "2024-03-07T14:05:35.441Z",
      "replyText": "Hello there! Rest assured that our team will assist you as soon as possible with the technical difficulties you have experienced as soon as possible, if you have contacted us via live chat or via email at contact@crypto.com.",
      "version": "3.181.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "d3eefe79-8595-4313-95c0-77d7da45f435",
      "userName": "Maurinee Beharie",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWIgiJzOeXEr9i7Tmbsv-Tm9_pnVhf2i1Hat4crgAz0R3fr",
      "date": "2024-03-13T00:42:46.750Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=d3eefe79-8595-4313-95c0-77d7da45f435",
      "title": null,
      "text": "I've been waiting on assistant for over a week. No help in the chat nor no reply to emails. I made a transfer and all things are checked on my end and I've still have not gotten my funds. I try to stop immediately and start over but they just have bots in place in the chat. Now I'm still here waiting and nothing. I can see the transfer and checked everything and for some reason I didn't receive my funds. They chance up so much but never around to help. This has becoming the worst investment app.",
      "replyDate": "2024-03-13T03:54:29.106Z",
      "replyText": "Hello Maurinee! We will be happy to look into the transaction in question and advise you accordingly. If you have already contacted us via Live chat or email at contact@crypto.com, rest assured that the matter will be reviewed and you will receive a response as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "dca893be-f5a0-48bf-970f-311d56a9cc96",
      "userName": "Lacey Bloch",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU5JxIiL7Bd8qTOXknHEFwj_XSDKqGeUyQ5KnzlY4aLSPY",
      "date": "2024-03-13T06:39:49.141Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=dca893be-f5a0-48bf-970f-311d56a9cc96",
      "title": null,
      "text": "EXTREMELY disappointed. I used to LOVE this app. It has a very beginner friendly platform and has almost zero transaction fees! HOWEVER, I have now been waiting THREE DAYS for a response on the chat (no more than 2 hours they boast!), the ONLY way to reach anyone. Update: was glad to have finally reached a \"human\" only to find out that \"sarah\" was, in fact, a bot too. Way to be even more deceitful than I thought! Bravo. You've lost this customer.",
      "replyDate": "2024-02-24T10:14:36.160Z",
      "replyText": "Hello Lacey. We would gladly look into the purchase difficulties you have encountered on our platform and help you. Since you've already reached out to us through the Live chat, rest assured that our team will do their best to respond and assist as quickly as they can.",
      "version": "3.182.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "9aed154f-123c-4d96-926f-a57975c78220",
      "userName": "Rakesh Chander",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIuUcE-DCcZ-TQGZJjKS2uC-L_M30JmcounwIWlBsap=mo",
      "date": "2024-02-16T07:09:09.416Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=9aed154f-123c-4d96-926f-a57975c78220",
      "title": null,
      "text": "Very disappointing with the fee. Always shows bit higher price than actual and have to pay higher price and also pay price on selling whether you make any money or not. Always customers loss.. Doesn’t show overall picture of loss or profit... I will look for different platform to buy crypto soon.... One Example..I got £4000 worth of coins to sell and able to get only £3000 .Such a very high fee.Completely scamm. I would never get into this mess if I know earlier........",
      "replyDate": "2024-02-09T18:24:04.919Z",
      "replyText": "Hello, Rakesh! We will happily address any concerns you might have regarding the prices on the Crypto.com App. Feel free to contact us via our Live chat or email us at contact@crypto.com.",
      "version": "3.180.11",
      "thumbsUp": 113,
      "criterias": []
    },
    {
      "id": "a41db073-4372-47ab-af74-4bcc77208def",
      "userName": "Shannon Handley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKrKGyWG6V_Aur6HvXSgwtMTaKiWr-c8J3vkYxMWk4x=mo",
      "date": "2024-03-15T20:09:57.481Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a41db073-4372-47ab-af74-4bcc77208def",
      "title": null,
      "text": "Poor app in my opinion. Works well to most points but no way to add a card for withdrawals. I have 3 cards it'll select and allow to deposit! But will not let me use or select those cards or add more. Customer service is absolutely shocking and even when sent to a specialist they don't reply. Will withdraw my crypto some way and then close my account as this is way too much stress than it's worth! Surely has to be better apps.",
      "replyDate": "2024-03-15T23:26:27.707Z",
      "replyText": "Hello Shannon! Please contact us via web chat or our in-app chat. Our team will gladly look into the transaction you are looking to initiate and assist you accordingly, as well as address any other concerns you may have.",
      "version": "3.182.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "1dfd22f8-8622-48d4-a5b1-92a13d34b998",
      "userName": "L.E",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJnB8GlpdmJD8LJYy21ff_eRDS0ypC7LwgBFG6GBg4OaA=mo",
      "date": "2024-03-14T10:50:07.180Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=1dfd22f8-8622-48d4-a5b1-92a13d34b998",
      "title": null,
      "text": "This app is good in some features, but they are definitely showing false chart readings. Was trying to sell some coins at a specific price which was lower that the showing price it didn't sell my order at all! Very apparent that they are manipulating data",
      "replyDate": "2024-03-14T08:34:18.140Z",
      "replyText": "Hello there, we welcome you to message us via our web or in-app chat so we can help out. Our team will be happy to look into what you have experienced with your sale request and assist you accordingly.",
      "version": "3.182.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "1e0381d9-89c4-4747-b426-cf5b1a291ea8",
      "userName": "Claire M",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVEfhSuet4EKDvdUYSOyIADT7DCJRd6fyYMpH3-nFig9gs",
      "date": "2024-03-14T04:32:39.337Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=1e0381d9-89c4-4747-b426-cf5b1a291ea8",
      "title": null,
      "text": "When I changed my phone back from another phone the app only worked on my data and kept buffering on WiFi. please be aware of this if it happens, but I asked support and they fixed it, so thanks. They have a lot of tokens, but their charts have no candles or moving averages and they say they charge you nothing for trading, but they make up for it by making the coin cheaper when you sell and more expensive when you buy, so ends up much more expensive than Coinbase... If they fix it great app",
      "replyDate": "2021-12-16T22:31:49.964Z",
      "replyText": "Hello Claire. Thank you for taking the time to share your thoughts and provide this valuable feedback! We truly appreciate it as hearing the opinion of our users helps us to better understand your needs and improve our services. You’re welcome to contact us via our in-app chat or email contact@crypto.com if you have any questions or suggestions!\n",
      "version": "3.182.0",
      "thumbsUp": 29,
      "criterias": []
    },
    {
      "id": "ac921990-d8d7-4c8a-943b-0f8372fafbcc",
      "userName": "Nemesis Divina",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV1NNBxlJWRvIbZoa6-MzqnMYrb-sY5dw-CNWwAapFrvW-r",
      "date": "2024-02-29T19:16:34.720Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=ac921990-d8d7-4c8a-943b-0f8372fafbcc",
      "title": null,
      "text": "Terrible app of a scam company. I've had transfers go missing only for customer service to try to charge me a $100 fee to correct a mistake that shouldn't have happened in the first place. I use many crypto apps, wallets, etc. and this is the only one I've had any problems with. Avoid at all costs if you care about your investments.",
      "replyDate": "2024-02-29T19:52:48.117Z",
      "replyText": "Hi there. Feel free to reach out to us over live chat or at contact@crypto.com, so we can review the transfers you refer to and help further.",
      "version": "3.177.0",
      "thumbsUp": 216,
      "criterias": []
    },
    {
      "id": "fc09f110-6519-4f7b-8293-19900e184e9a",
      "userName": "Phil Chill",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWEw4rEdE3FMZeyaG0qibLwcmqSXRh0NPMdr7zoJGvtfd0",
      "date": "2024-03-17T04:58:53.240Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=fc09f110-6519-4f7b-8293-19900e184e9a",
      "title": null,
      "text": "LOVED this app, every inquiries they'd usually help me in minutes. NOW that I accidentally got locked, I'm days in and they still haven't helped me clear up this glitch, it's so frustrating, I should be on their priority list, I'm a good and classy client. I'm SO disappointed. Be careful, everything goes well until it doesn't. I'll keep YOU posted and let you Know when I'm HELPED!? ~> I've sent many requests by email and the in-chat on the app, doesn't keep my recent posted up live 4some reason?",
      "replyDate": "2024-03-17T01:44:28.760Z",
      "replyText": "Hello Phil! Please reach out to us via In-app or web chat. We will gladly take a look at the status of your Crypto.com account and offer further assistance.",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "5de286a9-b2ca-4bfd-aabd-1bcb4fc92a43",
      "userName": "Michael Politakis",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIPXkcxLFVvZw36x3DOHGp0IUX82J4fkUfOYT49_sop=mo",
      "date": "2024-03-18T07:27:33.730Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=5de286a9-b2ca-4bfd-aabd-1bcb4fc92a43",
      "title": null,
      "text": "I have been using this app for the past 2 years. I have never had an issue before, until 2 weeks ago when tried to buy $150 worth of coins. When I made the purchase a message popped up saying the payment didn't go through, but $150 was still taken from my bank account. I've messaged the help team twice now and both times I've been told I need to speak to a specialist. I've then waited four days for a response and received nothing but the chat being ended.",
      "replyDate": "2024-03-18T14:09:08.393Z",
      "replyText": "Hello, Michael! We will be glad to look into the transaction in question and assist accordingly. In case you have already contacted us via our in-app or web chat, our team will make sure to reach you back as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "0d4a26e9-8437-4398-ab0f-62c3cab8dc7a",
      "userName": "Matthew Gosper",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK25doxOTsJTZgYYtwtB996L93Mk7XMYajeIP0MKGRH=mo",
      "date": "2024-03-14T10:47:45.790Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=0d4a26e9-8437-4398-ab0f-62c3cab8dc7a",
      "title": null,
      "text": "Dodgy app that worked fine until it updated and then doesn't work on my phone at all therefore not giving access to your account or help functions, not recommend. Revised text.... What a joke, I sent you emails and I sent you help requests on your app and you couldn't be bothered responding, but once I post a publicy available negative review you quickly respond to try and look good and totally ignore the fact that I've already tried to contact you multiple times.",
      "replyDate": "2024-03-14T05:17:17.212Z",
      "replyText": "Hello Matthew. Please reach out to us via web and in-app chat, so our team can look into the performance difficulties faced with the Crypto.com App after the latest update. Thank you!",
      "version": "3.182.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "f2c20602-9a8c-4a7c-b2a5-c1c11e94da18",
      "userName": "Hasaan Al Sheikh",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWcZFDiFFUkfvq7RzgfG6UwkzEEe-t5D2KhJA33bmkg9T6m",
      "date": "2024-03-12T02:06:38.109Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=f2c20602-9a8c-4a7c-b2a5-c1c11e94da18",
      "title": null,
      "text": "Customer support is literally not available. My money is stuck in the app. There is no way to reach out for help. Not in chat, not by email. I have a verification issue, and I submitted the supporting document. All went to the air. I have my crypto stuck there. This is a real spam.",
      "replyDate": "2024-03-12T02:50:17.554Z",
      "replyText": "Hello there! We will gladly look into any verification difficulties you have experienced and offer further assistance. If you have already contacted us via Live chat or email at contact@crypto.com, rest assured that you will receive a response as soon as possible.",
      "version": "3.181.01",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "e7d47c5c-4c99-4422-98c5-ff6b0598382e",
      "userName": "Dane Satchwell",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIZq_QWDhQCOuxfFW83s85Adv957ZdmpVyL4F79NMYQ=mo",
      "date": "2024-03-17T13:48:05.478Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=e7d47c5c-4c99-4422-98c5-ff6b0598382e",
      "title": null,
      "text": "I have a terrible experience with this crypro service. I am trying to add money through the app using e-mail money transfer and I also went through all the additional steps and they have not add the money to the site. I tried to contact them on numerous occasions with no response. I urge everyone not to go with this site. I have never been so disappointed with such a service.",
      "replyDate": "2024-03-17T16:25:01.747Z",
      "replyText": "Hello Dane! If you have already contacted us via our live chat or at contact@crypto.com, we can assure you that our team will be in touch with you as soon as possible and assist you with the deposit difficulties you reported.",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "55216733-4ef2-47ec-9031-5a192788d3e6",
      "userName": "Jonathan Rupert",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXaDVa1erYtFd6POkxXDniJDKCgWwjk0y4heL325yLxvVc",
      "date": "2024-03-14T12:47:10.782Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=55216733-4ef2-47ec-9031-5a192788d3e6",
      "title": null,
      "text": "I have been unable to withdraw my crypto from wallet for going on 5 days now. Customer service once I finally (long wait) got a hold of a human (and not a bot) they walked me through ID verification bc they thought originally that that was the problem. The had me navigate to tabs on the app that didn't exist to which their response was 'oh you must be on a different version of the app.' Follwed by 'is there anything else I can help you with today'? They acted like they solved problem. Nope.",
      "replyDate": "2024-03-14T20:15:18.671Z",
      "replyText": "Hello Jonathan. We will get back to you as soon as possible since you have reached out to us via live chat. Our team will be more than happy to assist with the pending withdrawal difficulties you are currently experiencing with the application and address any other matters that you may have.",
      "version": "3.182.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "6622bcaa-c074-45d2-a055-5e24203e06d6",
      "userName": "Bryan",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLs9IFK6wH_ntu1ujTyHFij9zPXR0KWRtpsFWd-jKQt=mo",
      "date": "2024-03-11T13:06:31.532Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=6622bcaa-c074-45d2-a055-5e24203e06d6",
      "title": null,
      "text": "For whatever reason, I'm unable to log into my account. Keeps sending me an email to login, nothing happens when I touch the login tab. Anyone else experiencing this? I sent customer service an email, no response. I've reached out to customer service several times now ...same automated reply...wish I could post screenshots",
      "replyDate": "2024-03-08T01:44:24.706Z",
      "replyText": "Hello Bryan. We will be happy to take a look into the login difficulty you have experienced and provide assistance. Please reach out to us via Live chat or email us at contact@crypto.com. Thank you!",
      "version": "3.181.01",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "d99b492f-1e4f-4d3f-83d2-28f6e777a39e",
      "userName": "Asia M. (Asia LionHeart)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWv3U17ABZ-Fm_OxRje7duYqqtr2z5I0FUGo3cwEmb9vjUb",
      "date": "2024-03-06T18:07:14.136Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=d99b492f-1e4f-4d3f-83d2-28f6e777a39e",
      "title": null,
      "text": "Thought this was a good app... But total lack of support . Its a scam to keep you from your account if you ever lock yourself out ! Don't download this thing unless you work here coz they WILL NOT HELP YOU ON ANY FORM OF COMMUNICATION. Been locked out of my account ( I'm the one who locked it due to password issue) and its been over 2 months. Support refuses to unlock it..just generic mass emails \" hoping they are glad they helped your issues\" ( never did) sent by 5000 different names. useless!",
      "replyDate": "2024-03-06T20:44:06.166Z",
      "replyText": "Hello Asia! Rest assured that if you have previously emailed contact@crypto.com or used our Live chat feature, we will get back to you as soon as possible to assist you with accessing your account. Thank you!\n",
      "version": "3.181.0",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "f8aa9e3a-c784-4033-9440-d45ecc6f13ab",
      "userName": "Sola Scriptura",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX1vEeKvcFFcJPVm01aOrmr1OSVJn1hqfJhY5tqAmu_fg",
      "date": "2024-03-09T00:57:58.903Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=f8aa9e3a-c784-4033-9440-d45ecc6f13ab",
      "title": null,
      "text": "Absolutely horrendous app. Horrible. I have an edit history that anyone can view to read the nightmare that I am going through. The response under this comment is that their team will be happy to assist. Lies! It takes days for a response and only by email or chat. Each time it is someone different. Each time they tell you the same thing that you have already tried over and over and ad nauseam. This has been going on for months. Ridiculous app. Horrible customer support. I regret signing up.👎😞",
      "replyDate": "2024-03-03T13:22:51.537Z",
      "replyText": "Hello, Sola! We will happily look into the difficulty you are experiencing with the Crypto.com App and assist further. If you have already reached out to us via our Live chat or at contact@crypto.com, rest assured that our team will get back to you as soon as possible.",
      "version": "3.181.01",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "cfe9b5e9-718d-41ff-bdc7-37418050dd37",
      "userName": "Lori Ramirez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJFn849oP_3E5fSM6bolnbVDHAo6v1eub9jHQHwBtUe=mo",
      "date": "2024-03-11T21:44:58.602Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=cfe9b5e9-718d-41ff-bdc7-37418050dd37",
      "title": null,
      "text": "I'm very frustrated with your app! I have had it for a few years and have money invested, then you updated the app about a year or so ago ever since the I can not get back in! It tells me to verify and I try but it says to create an account! I just want back into my existing account! SO FRUSTRATED 😠",
      "replyDate": "2024-03-12T01:02:24.244Z",
      "replyText": "Hello Lori! Please send us a message via Live chat or email us at contact@crypto.com. We will gladly look into the difficulty you have encountered when accessing your account and offer further assistance. Thank you!",
      "version": "3.181.01",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "6bc68500-07ba-488e-b43d-19f1778fbb9e",
      "userName": "Boris Golon",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW9WYGUFjXl2uBsag6neRvQIWD0VMYXQimyVEV8T9Grwrc",
      "date": "2024-03-13T19:59:43.256Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=6bc68500-07ba-488e-b43d-19f1778fbb9e",
      "title": null,
      "text": "Totally disappointed! I vas verified, but yet transfer & withdraw features are not allowed for several days due to account \"verification pending\" message??? I can't use my deposits! Already 3 days waitind for an answer from CS at app chat. Mail returnes automatic answer with a link to \"immidiate\" support that stucks & takes you nowhere! If there were not tens of millions of users there - I would think it's a scum.",
      "replyDate": "2024-03-14T06:15:10.770Z",
      "replyText": "Hi Boris. If you have already reached out to us via in-app or web chat, please rest assured that our team will get back to you as soon as possible and advise you further on the verification of your account. Thank you in advance.",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "8aa14593-0890-46f9-ac74-8fffafd78bcf",
      "userName": "Sam Bradshaw",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUVxs4VLBXB7NuRTSv4SFBitqzwUphkZ0gQMPcRM3OeBZE",
      "date": "2024-03-11T05:36:29.482Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=8aa14593-0890-46f9-ac74-8fffafd78bcf",
      "title": null,
      "text": "Hi This is the second time this has happened. When I install the app from Play Store and open it, the app crashes and says \"install from Play Store\",which I have already done. When I install it on my tablet I can't login as it won't send me confirmation on changing my phone number.",
      "replyDate": "2024-03-11T06:02:49.192Z",
      "replyText": "Hello Sam, please message us via our live chat or at contact@crypto.com. Our team will be glad to look into the difficulties that you are facing with installing our app and assist you accordingly.",
      "version": "3.181.01",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "a19b669c-63de-4f52-8ab4-77c66d2647a2",
      "userName": "Dameon Victorian",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWfJcYBwZj71TeP_25YXRX0WtkFKPkbdvU5CMcMxt1EAyA",
      "date": "2024-03-06T17:47:11.820Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a19b669c-63de-4f52-8ab4-77c66d2647a2",
      "title": null,
      "text": "Been having issues where the app takes 5 minutes to boot up. And taking 3 to 5 minutes to load my assets. As of recent everything is slow on my end. Doesn't make much sense. Inconveniences like this make me want to move to another platform. A faster interface would be nice.",
      "replyDate": "2024-03-06T20:05:19.774Z",
      "replyText": "Hello Dameon! We will be happy to look into the performance difficulties you are experiencing and assist you further. Please, reach out to us via Live chat or by emailing us at contact@crypto.com with more details on the matter. Thank you!",
      "version": "3.181.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "b81a2168-6d2e-4144-befe-5510905469d9",
      "userName": "mihai aurelian dumitrescu",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL74d29uPfrxe_Fs8eNKPolcd_BtqfoCwipuAZxZ6Nf=mo",
      "date": "2024-03-13T15:18:06.521Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=b81a2168-6d2e-4144-befe-5510905469d9",
      "title": null,
      "text": "I see a lot of bad reviews lately . I have been using the app for more than 2 years and never encountred any problems. I used Samsung Galaxy S10e ,S22 and S23 Ultra. I think the best feature included în an update is the profit / loss instant calculator for every coin.",
      "replyDate": "2024-03-14T07:27:58.941Z",
      "replyText": "Hello, Mihai! Thank you for taking the time to share your feedback with us. We are happy to know that you enjoy our products and services. Feel free to spread the word!",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "93371493-741d-4981-b221-920934c0dc91",
      "userName": "Tim Der Nachn",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXd1C2v0zZ6maMdgO_pginmRg8l59b6gYYl0dNKMp55dM8",
      "date": "2024-03-15T11:13:17.453Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=93371493-741d-4981-b221-920934c0dc91",
      "title": null,
      "text": "Worst app I've ever used. Cost me Thursdays unable to trade🤬🤬It's actually garbage. Attempted to add a bank account and the address validation was not approved and now the bank validation is stuck on 'pending' meaning the platform is now useless. BTC & ETH is falling and I'll unable to sell. Crypto has lost thousands of pounds today as it's unable to trade. Buttons didn't work. Full of popups. Crashes. DO NOT USE!",
      "replyDate": "2024-03-15T04:18:04.722Z",
      "replyText": "Hi Tim. Please reach out to us via our in-app or web chat, so we can take a closer look at the performance difficulties that you have encountered. We'd be happy to help you!",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "8cc2e825-bf56-4ce3-b7cc-a29d812b83ab",
      "userName": "Kenneth Liang",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK6nrV_8ZtFBu2pehhBsET61UUJiSCMweIZMnDDCjGW=mo",
      "date": "2024-03-16T05:11:48.117Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=8cc2e825-bf56-4ce3-b7cc-a29d812b83ab",
      "title": null,
      "text": "Can trade a lot of different coins. But every transaction they will take a little off the top without telling you. It adds up. Customer support is also not very good. And the app can be buggy as well.",
      "replyDate": "2024-03-16T05:32:23.643Z",
      "replyText": "Hello Kenneth. We welcome you to reach us via Web or In-app chat, so we can look into any performance-related difficulties you're encountering with the Crypto.com app. We'd also be happy to advise you on any other pending queries you may have. Thank you.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "53a92858-c97a-4162-9db1-f3f4839bc963",
      "userName": "Ben Ferns",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUUMKr3KXCeSROAq6ac2CyFK8EPM4ynLOx4qpSiWpXidKgD",
      "date": "2024-03-18T07:17:12.350Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=53a92858-c97a-4162-9db1-f3f4839bc963",
      "title": null,
      "text": "Customer service is very very slow.. They do not even read messages all the time and if they do they never help with anything, just give generic answers and then close the ticket. I would never trade here again, I've been told other platforms are much better such as Kraken.",
      "replyDate": "2024-03-18T14:06:34.168Z",
      "replyText": "Hi, Ben! We will be happy to look into your enquiry and help. If you have already reached out to us via our in-app or web chat, rest assured that our team will be in touch with you as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "43a0a695-5f6e-408b-ae78-48280abc46af",
      "userName": "Brett Thompson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWP8nlDGUcvXX1vgfGpR1znpSyd2ntsbcIwvvBW8UtlfSw",
      "date": "2024-03-15T04:31:16.900Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=43a0a695-5f6e-408b-ae78-48280abc46af",
      "title": null,
      "text": "The one and only problem I have with this app is that I have to update it every week almost- it's in the best interest of users-and they've built up an exciting, in depth, yet fun and engaging app for trading crypto currency. I'll admit it's much easier now than it was once. Before, with the two step id! Oh god! Please don't make me.",
      "replyDate": "2024-03-15T07:04:24.342Z",
      "replyText": "Hello Brett, we are constantly working on addressing and improving certain aspects of our platform. In order to do so, we do require frequent updates. We will be glad to address any queries or concerns that you may have regarding this matter, so please feel free to reach out to us via our web or in-app chat.",
      "version": "3.182.0",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "bc3761e4-3f45-4493-bab7-5c69f21a1755",
      "userName": "sean kuhl",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLU0posdmCKI74PLi6SnLF46wFjfq3yDtaM92aihPr4=mo",
      "date": "2024-03-15T19:52:07.209Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=bc3761e4-3f45-4493-bab7-5c69f21a1755",
      "title": null,
      "text": "Absolutely terrible experience/company. Customer service is completely non existent. I use several different crypto wallets. Trust me on this one, don't touch it. Tried to find further help by joining their discord.. that was full of scammers and by me simply requesting assistance for money being sent to crypto and not giving me access or showing it's existence, I was removed from the discord. This is my only review of an app ever.",
      "replyDate": "2024-03-15T23:10:30.750Z",
      "replyText": "Hello Sean! Please send us a message via web or in-app chat. We will gladly look into the transaction you have initiated and assist you accordingly. Thank you in advance!",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "3855cd4a-d26b-48a1-b354-91f1dbc93f23",
      "userName": "MrSimmoman",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKirTccTrT_3Ob20KYkUahAlYkKEa41HnZsURQ7bIhd=mo",
      "date": "2024-03-18T09:09:05.870Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=3855cd4a-d26b-48a1-b354-91f1dbc93f23",
      "title": null,
      "text": "In short terrible customer service. It says they will get back to you in a couple of hours and it's more like 4 or 5 days. They apologise for the terrible service but offer no service, just that do you still have the problem. Then you wait another 4 or 5 days. The last update has caused my app not to work, so I'm locked out with dreadfull customer service. I believe the problem is that my phone is a Samsung 7 as I installed the app on my wife's phone and it opened no problem. Waiting atm",
      "replyDate": "2024-03-18T14:39:28.326Z",
      "replyText": "Hi there! We will gladly look into the login difficulty you are experiencing and assist further. In case you have already contacted us via our in-app or web chat, our team will get back to you as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "a71a56f3-4bcc-4409-9088-e57c9f1b37aa",
      "userName": "Rhett B.",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJdFMOEvuZ5en22FMaXWQxKWgExewIZ_1x8F9ic0JkU=mo",
      "date": "2024-03-17T02:42:53.839Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a71a56f3-4bcc-4409-9088-e57c9f1b37aa",
      "title": null,
      "text": "UPDATE: The last time I heard from someone was 14 days ago... and the problem has still not been resolved. My biggest issue is the difference market price of the major coins. When you look at a price of crypto and then go to buy/sell a crypto the pricing actually changes significantly in favor of the platform so you will get less purchasing or selling power. The Strike options are down-right theft. I have emailed them about this issue and they don't respond.",
      "replyDate": "2024-03-17T00:20:49.790Z",
      "replyText": "Hello Rhett! Rest assured, that if you have reached out to us via Live chat or by emailing us, our team will get back to you as soon as possible. They will gladly look into the case at hand and advise you accordingly. Thank you!",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "7cd4c33a-dcff-4ef7-867f-568c7f9b9ce4",
      "userName": "yunus emre yılmaz",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLo6lYPNOPK1Amse3jlJvfMB-As-fSModz1scBjDlhL=mo",
      "date": "2024-03-07T11:30:12.105Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=7cd4c33a-dcff-4ef7-867f-568c7f9b9ce4",
      "title": null,
      "text": "In my first attempt for transaction my transaction was rejected, but funds have been deduced from my bank account. I am very worried because I haven't received any explanation or update regarding the declined transaction and missing funds. It has been more than 24 hours since I contacted support center, and still no response! Edit-1: thanks for messaging but still noone took action to solve my problem.",
      "replyDate": "2024-03-06T16:04:38.167Z",
      "replyText": "Hello Yunus! If you have contacted us via our Live chat or at contact@crypto.com, we can assure you that our team will be in touch with you as soon as possible and assist you with the transaction difficulties you have experienced.",
      "version": "3.181.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "c6365562-1fc8-48a9-bd91-079f84b202c3",
      "userName": "Pedro G.E",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocII18yc3SsiTLQ53YC50shrCODouibRbfaCwWLrpUSRjA=mo",
      "date": "2024-03-16T21:02:09.915Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=c6365562-1fc8-48a9-bd91-079f84b202c3",
      "title": null,
      "text": "Horrible app. Customer service is horrible they don't assist you with anything. They say the issue is being excalated and it's been over a week and not yet resolved. They freeze your crypto debit card and you can't move the funds or use the physical or virtual card, your money is stuck until they un freeze the card. They take alot of fees with every crypto purchases selling and trading. This app is going down hill. I would recommend everyone to use a different app like coinbase with better serv",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "06a62286-8fe5-40c2-ac74-f2f0d138a560",
      "userName": "Alex Allen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWwls9RF_Y0nB8ZimLZMaYOdKHJAnZdRGjHWn01DlIvmtQ",
      "date": "2024-03-13T08:20:17.679Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=06a62286-8fe5-40c2-ac74-f2f0d138a560",
      "title": null,
      "text": "The app and customer service is shocking. I was locked out my account for 2 weeks, after getting back access ive not been able to trade for the last 3 weeks. Tried contacting via email and chat, you get no response for days then get a automated email saying apologies for the delay if you still have an issue go back to chat, then the cycle starts again. Instead of sending an automated response days later, try addressing the person issue.. Would advise anyone to stay clear from this platform",
      "replyDate": "2024-03-13T09:07:11.467Z",
      "replyText": "Hello, Alex! We will happily take a closer look at the trade difficulty you are experiencing and assist further. If you have already reached out to us via our Live chat or at contact@crypto.com, rest assured that our team will get back to you as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "1d62aa81-4759-4648-b9b6-106a3e721ed7",
      "userName": "jack delaney",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXDvwG1zq3CKwHsUQqMvKKK_h4bOPtiyYDZVd9xDHRoRQ",
      "date": "2024-03-12T04:12:35.204Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=1d62aa81-4759-4648-b9b6-106a3e721ed7",
      "title": null,
      "text": "Great if you want to make some fast cash. TERRIBLE for when you want to withdraw your money. I've been waiting 3-weeks to withdraw my money (and waiting) customer support continue to tell me they have passed it to their \"specialists.\" It shouldn't be this hard to withdraw money from the fiat wallet that has been set up following their instruction.",
      "replyDate": "2024-03-12T05:19:54.160Z",
      "replyText": "Hello, Jack! We will gladly take a closer look at the withdrawal difficulties you are experiencing and assist accordingly. If you have already reached out to us via our Live chat or email us at contact@crypto.com, rest assured that we will get back to you as soon as possible.",
      "version": "3.181.01",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "2d128d8b-7d9e-4b16-997b-fad830dbaca2",
      "userName": "Denim Church",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIB6Z9WpmXmg83okQSTCMwagcn9ufzkReicAEHWmEpB=mo",
      "date": "2024-03-15T23:33:19.226Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=2d128d8b-7d9e-4b16-997b-fad830dbaca2",
      "title": null,
      "text": "They allowed me to buy the whole first week with no fee which was nice. Then they asked for KYC verification never mentioned it before that. Now my account is locked with 7000 dollars and I can't do anything at all just sit an helplessly watch. It's been well over a week I've been waiting on my verification. They shouldn't allow you to spend that kindve money then take away any control over it. Its Rediculous..",
      "replyDate": "2024-03-16T00:57:31.942Z",
      "replyText": "Hello there! Please contact us via web chat or send us a message to our in-app chat. We will gladly look into the status of your KYC verification and advise you accordingly.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "513d0769-568a-4724-8c5a-1c673d6205ff",
      "userName": "Andrew D",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK-59x8rPKtcxq3_ta4YFOdXtufUBz7E5VlGr2-6pwt=mo",
      "date": "2024-03-13T12:24:19.239Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=513d0769-568a-4724-8c5a-1c673d6205ff",
      "title": null,
      "text": "Still has extortionate exchange values for topping up your crypto card, and they do not disclose why or what this is based on. For example topping up £180 is about $245 of cypto and £1800 is about $2470. The more you exchange the more you pay on percentage. There are better options.",
      "replyDate": "2024-03-13T20:45:09.370Z",
      "replyText": "Hello Andrew! Please send us a message via web or in-app chat. We will gladly provide you with additional information on our products and services, and address any concerns you may have. Thank you!",
      "version": "3.182.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "d80d1a93-c51e-46de-a278-1003d0ca575d",
      "userName": "David Dimeglio",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXFCivOESsYpwWjnx_IcW9fRnGSBDXe2gCyUTnIKOv8Ww",
      "date": "2024-03-16T03:23:04.700Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=d80d1a93-c51e-46de-a278-1003d0ca575d",
      "title": null,
      "text": "I'm having an issue changing my phone number on the app. I can't access the app at all. When I followed the directions to change my phone number by putting in my email address, then hitting 'didn't get code'. I put in my new phone number, but I keep getting an error message that says try again later. I've been trying for 3 days now, multiple times per day. The automated system does nothing but tell me to do what I'm already doing, and the customer service line is only for card services.",
      "replyDate": "2024-03-16T04:20:18.631Z",
      "replyText": "Hello David. We will be happy to take a look at what you have experienced while attempting to change your number on our platform and offer assistance. We welcome you to message us via our in-app or web chat, so we can help you.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "b597986e-e3da-4b1e-b2d8-a97d832d2242",
      "userName": "Del's Life",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJH_VtwKTgKddaybCI5zYGGhPjcnLMbLOo5k3QRct0F=mo",
      "date": "2024-03-14T12:15:47.739Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=b597986e-e3da-4b1e-b2d8-a97d832d2242",
      "title": null,
      "text": "Latest update on android 8.0.0 now just crashes and unable to open. Not tested properly before releasing a forced update and now can't access my money as don't even have web access alternative !!! Cannot access in-app chat as app will not open. Trying web chat just pushes to specialist and goes no where.",
      "replyDate": "2024-03-14T12:10:42.791Z",
      "replyText": "Hi there! We would be glad to look into the difficulties encountered with the last app update. To do so, please reach out to us via our web and in-app chat, so we can help you access your account.",
      "version": "3.182.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "978348d2-dc90-4595-be4a-22434e372325",
      "userName": "Becky Light",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUtxfSM5ng_0Ur3Bvxx7-MPIYVVl0Zn78KuPpFHD-udalk",
      "date": "2024-03-09T12:09:45.906Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=978348d2-dc90-4595-be4a-22434e372325",
      "title": null,
      "text": "So, the app says you can get the card shipped to a different address if you contact customer service. They refuse to ship the card to a different address without updating your address. They also hung up on me. Update, still unable to get the card shipped to a different address. If you travel, this is not the card for you. A QUICK UPDATE, never got resolved. Still unable to update my address. Original from 2022, and currently in 2024.",
      "replyDate": "2024-03-09T12:19:58.996Z",
      "replyText": "Hi Becky. We'd be happy to help with your address change, If you've reached our team via Live chat or email at contact@crypto.com, we will make sure that you will be assisted as soon as possible. Thank you!",
      "version": "3.181.01",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "c4e08660-9103-48cb-ad38-a6011601f545",
      "userName": "Puneet Rastogi",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWBCpHodHQjb41SKp8KMTBJlz1wJcnlH9IF1gcTJN7dq1k",
      "date": "2024-03-13T13:07:57.578Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=c4e08660-9103-48cb-ad38-a6011601f545",
      "title": null,
      "text": "I had sent $20 to fund my account, I got the email saying they are deposited, but it never showed in my account. Customer service is a bot that keeps beating around the bush with no help. Extremely frustrating experience with complete fraudulent activities! To respond to your generic reply : I have started 2 chats for this indicating my unique identification # and confirmation #. Both ended by saying this has been escalated and some one will contact me on my official email id.",
      "replyDate": "2024-03-13T03:54:46.124Z",
      "replyText": "Hello, Puneet! We will be more than happy to assist you with your deposit. Please contact us via the Live chat or send an email to contact@crypto.com with a brief description of your case. Thank you!\n",
      "version": "3.181.01",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "7cddbbaf-d2dd-404e-95e8-5fbe9a0c7443",
      "userName": "Adrian Stephens",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVhRX4DwnFlVeve_rwpu0qk5v9svZW2Q8IicE4YPpNuzhM",
      "date": "2024-03-14T15:51:29.478Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=7cddbbaf-d2dd-404e-95e8-5fbe9a0c7443",
      "title": null,
      "text": "It's been a great way to buy crypto, alot more choices then some well known exchanges. Updown options was good when first introduced, now they front run your bids in there favor! You automatically start off almost $100 negative.",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "d90c6704-aaf7-4759-be80-6aaed0b7c5fb",
      "userName": "paul davis",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX-Is3NNYUTR8IUdxneou5k29OEigD2OFLvJENm8wkyfS8",
      "date": "2024-03-15T15:19:55.906Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=d90c6704-aaf7-4759-be80-6aaed0b7c5fb",
      "title": null,
      "text": "This may be a big company but their support is terrible their bot answers your complaint then tells you its beyond what they can answer and refers you to a specialist, but they never answer .i have money stuck here for 12 days now and its still not credited to my account from an e transfer .the app freezes and will not allow you to leave any more messages. Leaving e mails has no response . Do not trust your money in this app or even on the desktop",
      "replyDate": "2024-03-15T20:50:46.483Z",
      "replyText": "Hi Paul! If you have already reached us via web or in-app chat, then we can assure you that our team will get back to you as soon as possible and assist with your e-transfer enquiry as well as address any other queries you may have.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "79244e4f-e81a-427a-8958-7e68344513c2",
      "userName": "Michael Delgado",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIa5_uWQ-5kc7YPJcU2_M65wUj-e5lPlX-zsSpOSNP1=mo",
      "date": "2024-03-09T23:17:16.343Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=79244e4f-e81a-427a-8958-7e68344513c2",
      "title": null,
      "text": "Worst experience ever, I COMPLETELY AGREE WITH ALL THE SENTMENTS STATED BY OTHERS WHO LEFT THEIR REVIEW OR EXPERIENCE IN THEIR COMMENTS. What's the point of your app when you have to pay fees for everything you do at a minimum cash amount, and then you have to pay an outside 3rd party to cash out or transfer crypto to cash and vice versa. PEOPLE SHOULD STAY AWAY",
      "replyDate": null,
      "replyText": null,
      "version": "3.181.01",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "ed8bbdfa-f462-41af-ad25-83f059154338",
      "userName": "John William",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU5Kc3FLLv04oZ_mpcDzhTw3ZsApnk3GQKaYLBjFa3HLyo",
      "date": "2024-03-06T17:24:32.686Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=ed8bbdfa-f462-41af-ad25-83f059154338",
      "title": null,
      "text": "Ever since I downloaded this App yesterday until now, I find it difficult to sign up especially the part where you need to verify your email.. The link 🔗 sent, is not redirecting or loading in other to get me Verified, have done the process severally upto 8times. Same issue. I'm uninstalling soon.",
      "replyDate": "2024-03-06T19:56:55.249Z",
      "replyText": "Hello John! We would be glad to check out the sign-up difficulties you experienced. You are welcome to reach out to us via our Live chat or email us at contact@crypto.com, we will look into it and advise you further.",
      "version": "3.181.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "951b9880-c3b1-4340-8d5d-67527aa840c9",
      "userName": "Ryan “Phillip McCrevvis” Defield",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWyeifNQb6LyTgW6wRpFVt-poxPGR4o86WBM2A85tnrSA",
      "date": "2024-03-14T22:15:17.950Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=951b9880-c3b1-4340-8d5d-67527aa840c9",
      "title": null,
      "text": "Wish I could give negative stars. Took my money. Cars never shipped. Digital card has a pin I didn't set and can't change. No customer service of any kind whatsoever. In-app help is a joke. No way to recover money. No way to even ask somebody to help with it. Used to be a decent app and company. Anymore you can't trust them with a dime if you ever want to see it again. Pathetic. Hurry and go bankrupt. Oh their support line is direct to voicemail. Everything about it is garbage. DO NOT USE",
      "replyDate": "2024-03-14T23:53:55.390Z",
      "replyText": "Hello, Ryan! We will be more than happy to assist you with your Crypto.com Visa card query and address any other concerns you may have. Please contact us via web or in-app chat with a summary of your case.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "01f97428-684b-40a3-a0da-5ea472a6175e",
      "userName": "Hank Hancock",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWTG-PpPl0Sby-LukCx6-eqHYfOf9MpJvpAS3ahZhTCazY",
      "date": "2024-03-11T17:51:59.937Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=01f97428-684b-40a3-a0da-5ea472a6175e",
      "title": null,
      "text": "Rating 2 stars only because I know there has to be another out there somewhere! Why have a form requesting date of birth with no obvious way to edit? A full half an hour later, I managed to experiment with enough attempts to figure out how to adjust the year. But why should I have to reinvent the wheel to do so??? DAMN IT, MAN!",
      "replyDate": "2024-03-11T22:59:50.511Z",
      "replyText": "Hello Hank! We would be happy to look into the difficulties you have encountered on our platform and assist you further. To do so, please send us a message via Live chat or email us at contact@crypto.com. Thank you!\n",
      "version": "3.181.01",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "a30be3b2-cf47-4f38-9341-6b9d494ee5f2",
      "userName": "Ron Ferguson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV0RBIH9FDsQ4u0SSX4wY7tR7e467ktkfq8t3nQZtyowdU",
      "date": "2024-03-16T08:34:59.619Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=a30be3b2-cf47-4f38-9341-6b9d494ee5f2",
      "title": null,
      "text": "So I bought the app just to hold some bitcoin that I could sometimes transfer to a game I play. Turns out to send $20usd worth of bitcoin it cost me $27 in fees plus tax. So I was a little bit like wth. I use another app where it's under 1 dollar to send 50 so that us why I wont be using this anymore and just staying with the app the takes from the rich and gives tk the poor",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "802e340d-da9d-4b9e-86d1-fcdd40abb6a8",
      "userName": "Rowdy Dragons",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKFqM4syIzoIHGWo6tLpvBHWLvbCx0xWV1lV0axDjXH=mo",
      "date": "2024-03-12T19:24:57.851Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=802e340d-da9d-4b9e-86d1-fcdd40abb6a8",
      "title": null,
      "text": "Very difficult to transfer stocks, or to sell off stocks and send them to a bank account. App doesn't always work. Sometimes it only loads the logo then does nothing. Trading, selling, transferring are all very difficult to do. The only easy thing on the app is buying stocks.",
      "replyDate": "2024-03-13T01:27:28.439Z",
      "replyText": "Hello there! Please send us a message via Live chat or email us at contact@crypto.com. We will gladly assist with the difficulties you have encountered on our platform and provide you with additional information on our products and services.\n",
      "version": "3.182.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "6bc0d2f1-ce86-4ce8-9746-b116254a3baf",
      "userName": "Mr. Nibs",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI58U8Npm8c6uO5vC27pLzBJi3jq5htZ6NJe9fxXM_2=mo",
      "date": "2024-03-17T22:06:59.670Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=6bc0d2f1-ce86-4ce8-9746-b116254a3baf",
      "title": null,
      "text": "Horrible they're trying to take $200 as a transaction fee and I reached out to customer support and they haven't responded in months I tried to contact support a tons of times and they never responded all I get is an email that says sorry and to reach out again if I still have a concern but then they just don't respond and then send the same email it's a big loop of me requesting support them sending me an email and to submit again! (If they tell me to reach out to support again they don't care!",
      "replyDate": "2024-03-17T22:41:39.919Z",
      "replyText": "Hello Nibs! We will be happy to look into the transaction in question and advise you further. Please reach out to us via In-app or Web chat and rest assured that you will receive a response as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "03176883-4895-4fa4-9bbb-46a7abd26221",
      "userName": "Lee Evermore",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXaznQ3rPlaZf8YQCeykysJMFacfrS58xYjisyhmFkVN-M",
      "date": "2024-03-13T17:23:09.663Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=03176883-4895-4fa4-9bbb-46a7abd26221",
      "title": null,
      "text": "This was one of the best crypto wallets... but now they are worse than a bank. The customer service is SLOW & they flat out refuse to allow you to talk to anyone higher up. It took SIX WEEKS to get a replacement card and for FOUR WEEKS I was having to talk to them EVERY DAY! They also LIE and say \"no fees\" on some advertising... but they definitely upcharge you on EVERY crypto purchase and sell because they list crypto at market value but will ALWAYS mark up the price. Horrible people!!!!!!",
      "replyDate": "2022-09-05T14:25:46.970Z",
      "replyText": "Hello Lee! Please contact us via the in-app chat or email at contact@crypto.com, we would like to address any concerns you have regarding the Crypto.com Visa card and crypto transactions. Thank you in advance.",
      "version": "3.181.01",
      "thumbsUp": 3,
      "criterias": [
        {
          "criteria": "vaf_never_display_difficult_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_tax_preparation",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_useful_notifications",
          "rating": 2
        }
      ]
    },
    {
      "id": "469ba35b-2273-4bd2-be11-7add35803045",
      "userName": "Öskan Şavlı",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWFFAEfzifxGuUEtcUAdZqk1TIsGVZE3y7JZFGo6zq_oa8",
      "date": "2024-03-09T08:26:35.884Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=469ba35b-2273-4bd2-be11-7add35803045",
      "title": null,
      "text": "KYC verification not working. Camera works fine when taking pictures of the id card but it shows nothing when taking selfie with jumio. What's worse is the camera becomes stuck with this app and cannot be used anymore even if you force kill the app. You have to restart your phone to make it work.",
      "replyDate": "2024-03-09T08:52:58.924Z",
      "replyText": "Hello there, our team will be glad to look into this matter and assist you with your verification. Please message us via our live chat or at contact@crypto.com so we can help out.",
      "version": "3.181.01",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "76fd90ed-b937-46e5-8793-2befefebd4b9",
      "userName": "Sean Sullivan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWH6DsdQscIl5ju3KsqEC2EjUiQKN5UUD4uuPQVMdKcDps",
      "date": "2024-03-13T07:54:35.298Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=76fd90ed-b937-46e5-8793-2befefebd4b9",
      "title": null,
      "text": "It's great but my constructive criticism is that they need to have a constant total of profits shown compared to total investment without having to look at individual crypto and also make the tax forums be available for download from the app. It's honestly really shocking they don't have these two features for how big this app is. Definitely lacking behind other competitors. Also market data value is lagged behind live prices of crypto.",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 113,
      "criterias": []
    },
    {
      "id": "cdad8bcc-6b26-4761-9216-9b066eb960e3",
      "userName": "Proxy User",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJP_x0zHDjd0tdEmOfewv02Sl9EJ2qhsUzvukAJBHkS=mo",
      "date": "2024-03-13T22:17:36.162Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=cdad8bcc-6b26-4761-9216-9b066eb960e3",
      "title": null,
      "text": "Nonexisitng customer support, which is just what you want when it comes to handling money. Support doesnt reply for days, then deletes your ticket if you dont reply immediately. There is no ticket history (intentional), so youll be in a perpetual loop of opening tickets about the same question. Plus side: this keeps your participation at minimum; an effective speed bump.",
      "replyDate": "2024-03-14T06:49:28.429Z",
      "replyText": "Hello there! We will be glad to take a closer look at your enquiry and assist accordingly. If you have already reached out to us via our in-app or web chat, rest assured that our team will get back to you as soon as possible.",
      "version": "3.182.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "489db0cb-e6c1-4dea-bf81-dd08384af2fd",
      "userName": "Greg Barlow",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKI6dMnX-O7Dk6ln7zJSvOIWCtfSws1vp-0k9Ff0zaM=mo",
      "date": "2024-03-19T17:20:31.960Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=489db0cb-e6c1-4dea-bf81-dd08384af2fd",
      "title": null,
      "text": "Support is terrible and they have taken more money out of my bank account than I've spent. I've asked several times way and I do not got a response. Avoid this company and the app. Terrible In response to this I have messaged both options and you hardly get a reply. The 2 hour wait time isn't accurate. Still no reply to my messages!!! Why respond to reviews and say you will help when your customer care is so poor. Still no reply from your specialists from the 15th March.",
      "replyDate": "2024-03-13T01:25:37.218Z",
      "replyText": "Hello Greg! We will gladly look into the purchases you have initiated and assist you accordingly. You are welcome to get in touch with us via Live chat or email at contact@crypto.com. Thank you in advance!\n",
      "version": "3.182.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "9635d4d2-7aa0-49ee-aff6-6303b5cfdf22",
      "userName": "dkoder",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXkLJonHAYAXpbDRgiJks-8L6H6-IwnyZeO-1NFaYFfxdQ",
      "date": "2024-03-11T13:08:27.823Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=9635d4d2-7aa0-49ee-aff6-6303b5cfdf22",
      "title": null,
      "text": "The app fails a lot of times when I want to buy tokens. Always gives me 3ds error but I get no notification anywhere about this. Very frustrating to not be able to buy tokens with it...",
      "replyDate": "2024-03-11T14:34:53.463Z",
      "replyText": "Hello there. We welcome you to contact us via Live chat or via email at contact@crypto.com, so we can take a closer look at the purchase difficulty that you face and advise you further.",
      "version": "3.181.01",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "6011bb88-adda-4dc3-b10c-1d4f1694b1d3",
      "userName": "Bejan Ionut",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV3EZMQVP4yRadYUXOxAqjbJBYrEC6du7GYobWFq6eT5k4",
      "date": "2024-03-13T12:32:54.624Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=6011bb88-adda-4dc3-b10c-1d4f1694b1d3",
      "title": null,
      "text": "1. The value display in your app, is wrong (calculated on current price) - missinformation 2. Fees on everything (top up, buy, sell, withdraw, etc) 3. Especially the fees for a sell (insane) I'm sorry, I used to like this app a lot back in the days, but it's just draining money out of you for literally nothing",
      "replyDate": null,
      "replyText": null,
      "version": "3.182.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "7ba069e0-f485-4b88-b891-a2a9f622aa0f",
      "userName": "Austin Y",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXKYmjAv4gIRZka_Q0i0rdiiIVRXcVez3XapDFu7ofKRQUj",
      "date": "2024-03-17T13:23:15.849Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=co.mona.android&reviewId=7ba069e0-f485-4b88-b891-a2a9f622aa0f",
      "title": null,
      "text": "Can't transfer funds in to this bank.. everytime it errors or is rejected. Tried numerous cards and methods but doesn't work. Was trying to stake $4k CRO for the apple promotion and to get a jade card but can't. Managed to get $2k moved so far and it's taken 4hrs of work. Not a good experience at all so far. Reached out to support, they said to wait and/or keep trying. Ugggg...",
      "replyDate": "2024-03-17T16:57:45.405Z",
      "replyText": "Hello Austin! If you have already reached out to us via our in-app or web chat, rest assured that our team will look into your transfer request and get back to you as soon as possible. Thanks!",
      "version": "3.182.0",
      "thumbsUp": 1,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CmkKZwplMCwxMDAwMDAwLjY5NDY1OTM1MjMsNjQwNzYzODAyMDA4LCJodHRwOi8vbWFya2V0LmFuZHJvaWQuY29tL2RldGFpbHM_aWQ9djI6Y28ubW9uYS5hbmRyb2lkOjEiLDEsZmFsc2U"
}