{
  "data": [
    {
      "id": "67a8e1fb-f900-444b-8259-16a6eb99343f",
      "userName": "M Martinez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocItg1stQpsTQM-raJ3KhC4ZaAsg_ynluM169GMCoQBB=mo",
      "date": "2024-03-17T00:39:19.161Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=67a8e1fb-f900-444b-8259-16a6eb99343f",
      "title": null,
      "text": "This app has lots of bugs. I was almost finished and tried to file multi states and it populated earned interest into the wrong state and you can't edit it. Lots of \"oops, can't find...\" when you click for more info. So I requested a call back. It took only a few minutes to get a call. But the support person couldn't help and he just ghosted me. I kept asking \"are you there?\" No answer. I've used turbo tax for over 10 years but now I won't use them again.",
      "replyDate": "2024-03-17T00:48:41.271Z",
      "replyText": "Hello there, thank you for reaching out to TurboTax. We are disheartened to hear you had a negative experience this year, as this is never how we want our customers to feel. Please feel free to reach out to us directly on X, Instagram, or Facebook and we will be happy to help troubleshoot this further! - Madison",
      "version": "10.6.0",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "d402d9cf-60b3-4e13-bdfa-693a37a407d7",
      "userName": "Kayla B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVNOInOqRn3WKYQLrLjtP2TPCC9_UCDnCW4Nm4h42q2F5r6",
      "date": "2024-02-27T22:29:34.880Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d402d9cf-60b3-4e13-bdfa-693a37a407d7",
      "title": null,
      "text": "Originally chose the package that was reduced to free. Then it forced me to upgrade to the expensive package because of some stupid credit that I dont think I even had. Ended up costing way more than I could afford for nothing. It's become hard to navigate when I need to add something; but when I finally found it I wasn't allowed to add or edit anything!!! The way they charge $$$ for nonsense makes it feel more like a scam than help. GO TO A LOCAL PERSON THAT DOES TAXES IT WILL BE CHEAPER!",
      "replyDate": "2024-02-27T22:38:57.446Z",
      "replyText": "Hi there! You can file with TurboTax Free Edition if you have a simple tax return; Form 1040 only. Here are a few reasons you may be asked to upgrade: http://intuit.me/3QtyGJp\n\nTo have me look further into your account, or for more information please send us a direct message on X, Facebook, or Instagram! - Madison",
      "version": "10.3.2",
      "thumbsUp": 69,
      "criterias": []
    },
    {
      "id": "3d7a4a42-4001-4c26-97ec-699011953927",
      "userName": "Jennifer Nail",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLO87oRqBDmAtz1cziJwbPHkSjribnlBd3cXc0uIvIk=mo",
      "date": "2024-02-23T05:51:43.395Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=3d7a4a42-4001-4c26-97ec-699011953927",
      "title": null,
      "text": "I apologize, I'm just frustrated. I don't want to influence anyone either way, I was speaking for my experience only and I have used and will continue to use TurboTax I just don't care for the app. I despise this app. I have to go through the whole verification process every time I try to open the app and have to change password each time. I even uninstalled and tried again with same results. This is so stupid...🤯",
      "replyDate": "2024-02-23T04:29:37.579Z",
      "replyText": "Hi Jennifer, thank you so much for the review. We are very sad to hear about this experience. Please visit this link to view our self-help steps for gaining access to your account: https://intuit.me/3gANpow . Please reach out to us on our social platforms on Facebook, Instagram, or X. We would be delighted to assist you.\n\n-Mari",
      "version": "10.5.1",
      "thumbsUp": 60,
      "criterias": []
    },
    {
      "id": "29fb4775-9ac4-46ed-a7b7-7a918125fe1c",
      "userName": "William Rodriguez",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUuD-WQ821_1oegcDe8aR9_toyyaC57jXwaTQWyTEDz9CE",
      "date": "2024-03-03T15:51:19.800Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=29fb4775-9ac4-46ed-a7b7-7a918125fe1c",
      "title": null,
      "text": "It was dumb to think an app could do this complex job. I paid and had my files rejected 3 times through TurboTax. I got the exact same forms, paid someone else to file them for me and they went through immediately. Now TurboTax doesn't want to give me a refund for an unused service. Their customer service people are so bad, the hate for their job oozes through the call. I had to let the person know other non customer service jobs exist. Just an awful experience. Unprofessional, and fraudulent.",
      "replyDate": null,
      "replyText": null,
      "version": "10.5.1",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "0e157406-bbfb-45b3-9edc-44034b90691d",
      "userName": "Scrub Tug",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLw75fAbgdEqLehRXa1osBmQG-tPxUZbVFDs33wbr_n=mo",
      "date": "2024-02-12T20:47:55.324Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=0e157406-bbfb-45b3-9edc-44034b90691d",
      "title": null,
      "text": "Was forced to upgrade from free in order to claim a tax \"credit\". The \"upgrade\" costs $39... But that only covers federal... You have to upgrade your state taxes, too, even though it's a federal credit and doesn't effect state taxes. On top of that, they charge a $4 fee anytime you use a credit card, so now I'm down about $90... And the tax \"credit\" that I received for this ridiculous upsell? Exactly $0.... Intuit gets worse every year. I will never recommend any of their software.",
      "replyDate": "2024-02-12T23:13:15.790Z",
      "replyText": "We are saddened to hear about your experience. You will be required to upgrade if we detect that your tax situation requires expanded coverage. I will include a link here that provides more information about upgrading : http://bit.ly/49wYVa3 Please reach out to us on our social platforms if you have any questions on Facebook, Instagram, or X.\n-MM",
      "version": "10.4.0",
      "thumbsUp": 265,
      "criterias": []
    },
    {
      "id": "8f4c8403-f233-41c7-9ff7-83a8942aec62",
      "userName": "Jace Newton",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW1f5V7Pnnrq7XF-3C_fHSi8q-M5Iwy7AedmoJLAJ7ZbkU",
      "date": "2024-03-02T13:09:09.749Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=8f4c8403-f233-41c7-9ff7-83a8942aec62",
      "title": null,
      "text": "TurboTax prices have shot up. Plus, you really have to pay attention cause they'll sneak TurboTax premium in on you. Plus, charge you for state and a 40 processing fee. You're better off finding someone local that's not with a big company. Or learning to do it yourself. The first takes more than they need, and then companies like Intuit TurboTax charge you more than necessary so they can steal your hard earned money.",
      "replyDate": "2024-03-02T13:37:03.313Z",
      "replyText": "Hey Jace! Thank you for reaching out to TurboTax with this feedback! We're saddened to hear that you've had this experience with us. We'd like to look into this. Could you please send us a private message on Facebook, Instagram or X (formally Twitter)? Here is the link to our social page: https://bit.ly/3F567uC\nWe hope to hear from you soon!\n-Zoe",
      "version": "10.5.1",
      "thumbsUp": 79,
      "criterias": [
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_tracking_finances",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        }
      ]
    },
    {
      "id": "f07a0376-4c42-4c2c-852d-43b95d492a8f",
      "userName": "Annabella Bugajski",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI0mpqAev_MuNiHhBHc-dT3yBuIJSPm2xX2ZTsY0HxF=mo",
      "date": "2024-02-14T01:18:03.435Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f07a0376-4c42-4c2c-852d-43b95d492a8f",
      "title": null,
      "text": "if you have the option, DON'T use this app. it's horribly set up, awful to navigate, has so many of its own little cutscenes that its almost impossible to use if you dont want to lose your mind. I've just fully put my information in twice and lost all the information, again. I'm done, I'll do it on a computer rather than deal with this mess.",
      "replyDate": "2024-02-14T01:36:40.946Z",
      "replyText": "Hi there, we appreciate you taking the time to leave us a review, as we truly value your feedback. We are saddened to hear about your experience with TurboTax, as this is never our intention for any of our valued customers. We would like to collect additional details about this, and you can submit that feedback here: https://bit.ly/3l3liAg\n\n-CC",
      "version": "10.4.0",
      "thumbsUp": 243,
      "criterias": []
    },
    {
      "id": "def2dc07-ebac-4378-b64d-5688534d5b5c",
      "userName": "Vanessa",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIKZQV14p5Bha3S_XDkC8ngeHYyYQ-o8IX4m1nchux0=mo",
      "date": "2024-02-20T19:52:51.390Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=def2dc07-ebac-4378-b64d-5688534d5b5c",
      "title": null,
      "text": "Worst TurboTax app experience ever! I've used with very few issues for more than 10 years but the interface this year is absolutely horrific! They've made it literally impossible to edit or delete anything other than personal info or W-2. If you need to include other forms, like a 1099, do not use the TurboTax app. Seriously, they should be embarrassed.",
      "replyDate": "2024-02-20T20:20:27.859Z",
      "replyText": "Hi Vanessa. Thank you for your honest feedback. We appreciate you being a valued customer here with our TurboTax family. If you need any assistance with 1099's please reach out to us on Facebook, Instagram or X and we will help you. -Darling",
      "version": "10.5.0",
      "thumbsUp": 302,
      "criterias": []
    },
    {
      "id": "2a49f9b7-783d-4e03-87dc-49eb7f7e6cc6",
      "userName": "Jeff",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJYYuX92evi7dABPab1lLfYFXBjgiEUduvq8Ij8Ip7U=mo",
      "date": "2024-01-04T10:47:00.313Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=2a49f9b7-783d-4e03-87dc-49eb7f7e6cc6",
      "title": null,
      "text": "Very time consuming. Constant ridiculous messages. What you change on the web site, does not update on the app. Extremely annoying ads to upgrade to better services. Upgrade...are you kidding me, into for 10 minutes and still not setup. And I have used them for several years. No thanks. Much better and LESS EXPENSIVE apps out there. If it's part of Intuit, Quickbooks, ect...stay clear.",
      "replyDate": "2024-01-04T13:22:55.829Z",
      "replyText": "Hello! We appreciate you bringing these concerns to our attention. We want to learn more. You are entitled to free support for all product-related questions and concerns! Please send us a private message on your favorite social platforms like Facebook, X, or Instagram to further discuss your app concerns. We look forward to assisting you!- Anthony",
      "version": "10.2.0",
      "thumbsUp": 254,
      "criterias": []
    },
    {
      "id": "29d9d711-41dd-466c-b468-9501c7ef7a72",
      "userName": "charles keener",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK3eYVGFS9zKgEFAv9TM1PVBRtJD8Let9bvRBlNc-0a=mo",
      "date": "2024-02-29T21:42:09.885Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=29d9d711-41dd-466c-b468-9501c7ef7a72",
      "title": null,
      "text": "The app seems to function fine but I HATE being pushed to complete my taxes before the end of February or rates go up. If I had known about this pricing policy, I might have felt different about it. But I started my taxes and then just haven't gotten back to them yet and now I'm being badgered to finish. I will find another service, even if it costs more money. Been using taxact for a while but decided to give you guys a try, well, Good by TurboTax! I WON'T BE BACK!!!!!",
      "replyDate": "2024-02-29T21:53:51.350Z",
      "replyText": "Hi Charles, we appreciate you taking the time to leave us a review. We are saddened to hear about your experience with TurboTax. Your feedback is important to us as this allows us to improve our customers' experience. TurboTax will be here if you need to reach out to us on FB, X, or IG for any assistance you may need!\n\n- CC",
      "version": "10.5.1",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "d8e7412c-4837-4ca8-9bfe-64095a83b1ad",
      "userName": "Diego L.",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKJ4m92Q9Rae62ncH0RsC83UjFOzM36VFznvo21sePjuSc=mo",
      "date": "2024-03-04T14:37:18.380Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d8e7412c-4837-4ca8-9bfe-64095a83b1ad",
      "title": null,
      "text": "I have been trying to e-file for over a month now. Everything is set to go but I encounter the \"Hmm we hit a snag\" error. I've spoken with multiple TurboTax operators and have tried all kinds of things. I read online that this is a software issue and that TurboTax has to fix it themselves, but I see no fix in sight.",
      "replyDate": "2024-03-04T14:51:59.320Z",
      "replyText": "Hey Diego! Thank you for reaching out to TurboTax for support! We are saddened to hear that you've had a subpar experience with us. We would be more than happy to assist you on our Facebook, Instagram, or X page. Here is the link to our social page: https://bit.ly/3F567uC\nWe hope to hear from you soon!\n-Zoe",
      "version": "10.5.1",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "2ab9f927-bb8d-4dd7-b34b-b3e7a8144965",
      "userName": "jumpdogbark bark",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVTAhIJS-Zg8k2b8CvGqMY9AeS8U8ocDCqixHk6z1B59oU",
      "date": "2024-01-19T21:10:01.519Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=2ab9f927-bb8d-4dd7-b34b-b3e7a8144965",
      "title": null,
      "text": "A document uploaded option would be far more useful than a take a snap option. Every document is electronic now. At least the option for both. Also Race Mode? What is the point if it? To waste storage and app space? I don't need it or want it. What a pointless addition to the app. Fire the person that came up with it and the person that approved it. It's lame.",
      "replyDate": "2024-01-19T21:37:12.648Z",
      "replyText": "Thank you for reaching out to TurboTax! That is helpful for us to know and we value your feedback. I will forward the feedback to our product development team. Customer feedback is essential for continual improvement of our product.\n\n-Daija",
      "version": "10.2.1",
      "thumbsUp": 339,
      "criterias": []
    },
    {
      "id": "e11348c3-7052-47f6-8eac-f8aa34c57695",
      "userName": "Rebecca Langford",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUhopDcTo9RFQiw3h3mMzTVQnRofo1TS7XuABZTpestb231",
      "date": "2024-01-26T05:21:07.579Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e11348c3-7052-47f6-8eac-f8aa34c57695",
      "title": null,
      "text": "I have been using Turbo Tax for many years to do my taxes. This is the first year that I have been extremely disappointed. I was unable to efile my taxes as I kept getting a transmission error. Tried every few hours as recommended, I even upgraded to Max to see if that was the reason. Nope! Still got the same error. Unfortunately, I went to another tax place and efiled them there with no issues.",
      "replyDate": "2024-01-26T13:28:17.817Z",
      "replyText": "Hi Rebecca, thank you for using TurboTax over the years. We're concerned to hear about your e-filing issues and transmission error. Your feedback is valuable in helping us improve our service. If you need further assistance or wish to discuss this matter, please don't hesitate to contact us via FB, IG, or X.\n\n-Lissette",
      "version": "10.3.1",
      "thumbsUp": 151,
      "criterias": []
    },
    {
      "id": "5bdec13c-38b4-4e6a-a8b0-96c95b6a5a37",
      "userName": "Steven Douglas",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX4tHhD3l1613_pN5fZNyDtPaNT5G4nu8YDN2DnDToHx_s",
      "date": "2024-02-16T03:39:45.465Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5bdec13c-38b4-4e6a-a8b0-96c95b6a5a37",
      "title": null,
      "text": "Will NOT be using TurboTax again. After all was said and done and my federal and state returns were deposited into my bank account, I was still short over $100 AFTER the fees were taken out. Seeing as i would have to upgrade to one of their \"Super Ultra Mega Important Person\" plans just to be able to talk to someone about this, I'm just going to cut my losses and never use TurboTax again. If you value money at all, DON'T use TurboTax.",
      "replyDate": "2024-02-16T04:09:00.903Z",
      "replyText": "Hey Steve, we appreciate you taking the time to leave us a review. We are saddened to hear about your experience with TurboTax, as this is never our intention for any of our valued customers. We truly value feedback such as yours as this allows us to improve our customer's experience. Please reach out to us on FB, X, or IG for assistance.\n\n- CC",
      "version": "10.5.0",
      "thumbsUp": 213,
      "criterias": []
    },
    {
      "id": "f2d1719a-e1b8-49fe-963c-d59cfd18341a",
      "userName": "Bekki Hrabacka",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKXkbmxlwP3V1NjRx8Qh4qvwLdk8zt2Rsrxqz0htLq3=mo",
      "date": "2024-01-23T01:39:43.241Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f2d1719a-e1b8-49fe-963c-d59cfd18341a",
      "title": null,
      "text": "I can't even sign in. It constantly reroutes me to the start after signing in. I have used TurboTax for years and have been happy with the outcome. This year, it made me upgrade to the newest version and nothing will load. Lots of freezing, it doesn't read when I touch the screen. I even Uninstalled and reinstalled the app with no luck. Very frustrating and disappointing.",
      "replyDate": "2024-01-23T01:51:24.800Z",
      "replyText": "Hi Bekkia, thank you for sharing your feedback and for being a loyal TurboTax user. To address your concerns about the app's performance, we invite you to connect with us via FB, IG, or X. Our team is ready to assist you with any issues you're experiencing and provide the support you need for a smoother experience.\n\n-Lissette",
      "version": "10.3.0",
      "thumbsUp": 350,
      "criterias": []
    },
    {
      "id": "a292ad6c-ec8d-4837-87ee-6128a32429f8",
      "userName": "Michael Lyons",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJdjrkl-4Sq7D8EZxFn4G7-a6IDnXdWfAYuauEFNBeQ=mo",
      "date": "2024-01-29T02:21:39.371Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=a292ad6c-ec8d-4837-87ee-6128a32429f8",
      "title": null,
      "text": "This will be the last time I ever use TurboTax. This has become far less convenient, buggy, slow, repetitive, and it's not the most user-friendly app either. The fact that you guys charge so much when you didn't use to takes away from the experience and makes it far less convenient. Might as well go file them in person if I'm going to pay fees no matter where I go. The fact that this review will only get a generic reply and not be taken seriously justifies everything I said. Good riddance.",
      "replyDate": "2024-01-29T03:45:39.250Z",
      "replyText": "Hey, Michael! We are saddened to hear that your fees were more than expected and appreciate you for taking the time to leave a review. You can find info on our pricing here: https://bit.ly/3OmaOHXAs for any technical issues you're experiencing, please feel free to reach out to us via Facebook, Insta, or X. Thank you for choosing TurboTax! - Doreen",
      "version": "10.3.2",
      "thumbsUp": 259,
      "criterias": []
    },
    {
      "id": "67c89df2-0d82-49ed-a131-47ca167e3d10",
      "userName": "Nicholas Stromme",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW7lvQppW1A3bdfIS55WSkwwgw3tCONPCOcXo8MvW48K0A",
      "date": "2024-02-16T20:32:13.503Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=67c89df2-0d82-49ed-a131-47ca167e3d10",
      "title": null,
      "text": "USER BEWARE! GO ELSEWHERE! This USE to be an easy application to use. It would walk you through everything clearly and be pretty straight forward. Not anymore. I have never experienced a more horrendous tax filing application than what I just attempted through the New TurboTax application. What's that old saying folks.? Don't fix what ain't broke... Intuit TurboTax just doesn't seem to get it. I Will be going elsewhere after 6 years consecutively filing with TurboTax. Thanks for my experience.",
      "replyDate": "2024-02-16T21:40:15.485Z",
      "replyText": "Hey Nicholas, thank you for taking the time to review TurboTax. We understand your concern and apologize for any inconvenience this matter has caused you. To look into this further, please send us a direct message on either of our social media platforms. We would be more than glad to assist as your concern is a high priority to us.\n\n-Joell",
      "version": "10.5.0",
      "thumbsUp": 273,
      "criterias": []
    },
    {
      "id": "9a96a666-aa98-46a8-9af0-1079c04b41f4",
      "userName": "Ryan Whaley",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWMwPXd9tggu_BbkAogZV4LghnEfj_67kldzzu14W-o3hs",
      "date": "2024-02-20T18:12:33.966Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=9a96a666-aa98-46a8-9af0-1079c04b41f4",
      "title": null,
      "text": "Definitely will never be using turbotax again, customer service is absolute garbage.. Waited on hold for 30 min which isn't a big deal but to wait that long just for the representative to be rude and not even try to help resolve any issues.. You could hear it in her voice she definitely didn't want to be at work much less be at work and actually having to do her job.. The worst customer service I've ever experienced by far!!",
      "replyDate": "2024-02-20T18:29:01.616Z",
      "replyText": "Hi Ryan! We are deeply saddened to hear that. We do not want to see you go. We understand how overwhelming this can be, and we genuinely empathize with your frustration. But please know that we are here to support you! Please send us a message on our Facebook, Instagram, or X with any questions or concerns! We are happy to help.\n\n-Brooklyn",
      "version": "10.5.0",
      "thumbsUp": 40,
      "criterias": []
    },
    {
      "id": "5830ad8f-3480-47c4-9e45-9a5f76d32fbb",
      "userName": "Toby Byous",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW87Svo49_SLfiX2GhG-CIBVF2uMmnNgKlLuKIYWSQTvcn0",
      "date": "2024-01-25T20:30:12.715Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5830ad8f-3480-47c4-9e45-9a5f76d32fbb",
      "title": null,
      "text": "Awful!!This used to be such an amazing app I've used it for Years,but this year it's so bad. I have used a 1099-misc the last few Years and there seems to be an issue where it's redirecting me to a 1099-nec which is a form that I shouldn't have to do. Did my research online and seems I'm not the only one having this issue. Tried the recommended fixes so now I have to wait until they fix the actual app itself. Btw I did try it on both mobile and PC.I signed in and out,cleared out the cache.Fix it",
      "replyDate": "2024-01-26T01:38:03.806Z",
      "replyText": "Hi Toby, Thank you for taking the time to tell us about this frustrating experience. Our development team is looking into this and would like more details. Please fill out or form for the devs to see here: https://bit.ly/3l3liAg\n\nShould you need it, you can reach out to our social channels which are Facebook, Instagram, and X to assist.\n\n-Daija",
      "version": "10.3.1",
      "thumbsUp": 102,
      "criterias": []
    },
    {
      "id": "d8575448-34dd-48ed-b613-976fb77f0282",
      "userName": "RayJeania Brooks",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVYqlJWkwDJVt_6Wf_9nt9b34LnUhOmAtpi7PbFkN7uWRJX",
      "date": "2024-01-14T21:18:04.186Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d8575448-34dd-48ed-b613-976fb77f0282",
      "title": null,
      "text": "It's bad this year, last year it was easy I could chat and the expert could see my screen; now it's unable to load, it's taking longer to file and freezing. I don't feel like i filed my taxes confidently and trying to get the issues resolved. I don't know, i had high hopes and was excited to file through here again, but now I'm really disappointed and really confused..",
      "replyDate": "2024-01-14T22:18:27.425Z",
      "replyText": "Hi RayJeania, Thanks for reaching out to TurboTax! I am sorry to hear you feel this way and we will do our very best to make sure we can resolve any confusion and disappointment. To make sure you are confident in your return, please contact us via Facebook, X (formally known as Twitter) or phone https://intuit.me/3WakZB8\n-Anthony P.",
      "version": "10.2.1",
      "thumbsUp": 143,
      "criterias": []
    },
    {
      "id": "23a8370a-f722-47e6-97ab-4436cc07aa6e",
      "userName": "Daryle Baes",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUA2AmhoMB_lQ9tY4NsgKx60xhBE8ZrbfsdZVnzxgSQWQ",
      "date": "2024-01-27T23:07:01.502Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=23a8370a-f722-47e6-97ab-4436cc07aa6e",
      "title": null,
      "text": "PURE GARBAGE!!! I will NEVER again use their service. For years I used TurboTax with no problems until last year when I got audited for the first time ever. Now, this year I'm required to submit form 8862 but TurboTax will not attach the form and I'm being sent in circles. No matter what I do it won't let me submit the return with the form. Speaking with them by phone or chat is USELESS. The people at TurboTax who are supposed to be experts don't now sht-- none of them can help.",
      "replyDate": "2024-01-28T02:51:02.590Z",
      "replyText": "Hi Daryle, thanks for leaving us a review! We are saddened to hear of the difficulties you've faced so far, as we want nothing more than for our customers to have an excellent experience with us. Here are the steps to include form 8862 in TurboTax: bit.ly/3HBz0lK For additional help, please contact us on Facebook, X, or Instagram.\n\n- Amy",
      "version": "10.3.2",
      "thumbsUp": 82,
      "criterias": []
    },
    {
      "id": "81471947-35a0-4656-aa52-53cbb5ff1f81",
      "userName": "Ana Ramirez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIoY2VmfmguHpEWYrsKo0KUEc241xWTEPTu_0heuHoQ=mo",
      "date": "2024-02-09T12:56:51.515Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=81471947-35a0-4656-aa52-53cbb5ff1f81",
      "title": null,
      "text": "I have used this App for years found it so easy to navigate. This year I can't even find my w2. It keeps taking me in circles. Glitches all the time. SLOW TO DO ANYTHING. I thought it was my device but have tried signing in different devices same problem. Will have to go back to other resources next year.",
      "replyDate": "2024-02-09T13:38:00.315Z",
      "replyText": "Hi there, Ana! We understand how frustrating this can be. We do appreciate your feedback and would love to assist you further. Please, do not hesitate to reach out to us on Facebook, X, or Instagram so we can resolve any questions or concerns you have. We hope to hear from you. Thank you for being the best part of TurboTax!\n-Elyssa",
      "version": "10.4.0",
      "thumbsUp": 54,
      "criterias": []
    },
    {
      "id": "5c3a0aeb-7685-4650-91d8-44efa289b7cd",
      "userName": "Kenneth Howerton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIXkfLYbFyzcrafZ4ksfpirmG_c9CR9jGysBJSzJrwL=mo",
      "date": "2024-01-20T23:32:51.424Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5c3a0aeb-7685-4650-91d8-44efa289b7cd",
      "title": null,
      "text": "Every year the app gets worse. More spammy up-sell messages. More data collection. Unnecessary bells and whistles like the stupid \"Race mode\" nonsense. You make it more complicated, longer, and unnecessarily frustrating each year. At this point I'm sick of dealing with it. Used to take me 20 minutes to file, now you've shown me 3 up-sells and are pre-quoting me 41 minutes file time before you even let me start.",
      "replyDate": "2024-01-21T00:01:12.872Z",
      "replyText": "Hi Kennith, thank you very much for the feedback! We strive to improve constantly and this feedback will be helpful in that goal.\nAnthony P.",
      "version": "10.2.1",
      "thumbsUp": 87,
      "criterias": []
    },
    {
      "id": "a04445fc-5d08-4fed-8074-2db68f78cd79",
      "userName": "Victor Borte",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLFRyTrCsr_OtPqbLrz7t4NbGiBwwDEMjpllJ5Skzek=mo",
      "date": "2024-01-31T13:58:08.145Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=a04445fc-5d08-4fed-8074-2db68f78cd79",
      "title": null,
      "text": "Dissatisfied! I've been using TurboTax Free Edition for years, now the Deluxe version has been forced upon me. $39 for federal, $39 for state, and a $40 processing fee to get it direct deposited. My information is simple and upgrades aren't needed. Searched for a solution. Couldn't locate the \"Tax Tools\" tab on TurboTax online in order to clear/start-over in attempt to get the FREE edition. Before you file please review what you will have to pay! Feeling bamboozled. Going elsewhere this year.",
      "replyDate": "2024-01-31T14:20:03.112Z",
      "replyText": "Hi Victor, thanks for sharing your experience with us. It's important that you have access to the version of TurboTax that best suits your tax situation. To address your concerns and help guide you back to the Free Edition, or to clarify any questions about the charges, we invite you to connect with us directly on FB, IG, or X.\n\n-Lissette",
      "version": null,
      "thumbsUp": 45,
      "criterias": []
    },
    {
      "id": "66b18ae3-7cae-4751-8e72-4b02d75cfa71",
      "userName": "Permanent Record Studios",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXe6-gh54VCo7xlofbYlLAlLPSbRmJ8RJZphKi8ES9kcg",
      "date": "2024-01-26T00:31:38.211Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=66b18ae3-7cae-4751-8e72-4b02d75cfa71",
      "title": null,
      "text": "Installed app, won't let me create account (same prob online). I've no interest in reaching out via soc media as I've read too many reviews that your support stinks, as does the app. There are other tax filing options. In re: to response from dev. No kidding? I know how to set up an account, the problem is tlerrors I continue to receive from your end. The errors occur on both desktop browser & in app. In researching, this issue is common with Intuit/TT. This has already been a waste of time.",
      "replyDate": "2024-01-25T23:04:28.885Z",
      "replyText": "Hello, I understand how frustrating this has been. Here's how to create an account: https://intuit.me/47NPpy3 if those steps are not working, we recommend trying in an incognito window.\n\nIf you need assistance, please don't hesitate to reach out to our Social Channels which are Facebook, Instagram, and X (formerly known as Twitter)\n- Kyra",
      "version": null,
      "thumbsUp": 45,
      "criterias": []
    },
    {
      "id": "0ec90219-bfdf-4891-a612-225657c39374",
      "userName": "Willow Armstrong",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVjolLZsq--vMCjWnX7lNEID5TiBlmDaDbuuzze8fBSqpI",
      "date": "2024-03-06T19:45:07.162Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=0ec90219-bfdf-4891-a612-225657c39374",
      "title": null,
      "text": "Final edit on this issue started when the app just wouldn't load, tried several fixes for solving it and despite my best efforts, only found more robots to talk to. Trying to start over and just do it myself now and I can't even leave the full service option with the only help a recommendation is giving me is to try pressing the button again to just get the same screen. This is textbook exploitation in my state and am already taking the steps towards legal action. You should too.",
      "replyDate": "2024-03-07T20:03:43.404Z",
      "replyText": "Hello Williow! We appreciate you providing us with a review. It's disheartening to hear that your experience wasn't as smooth as we'd hoped. Please be assured that our dedicated team is here and ready to assist you. Please feel free to connect with us via Instagram, X, or Facebook so that we can look into this for you. We are here to help!\n\n-Silvia",
      "version": null,
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "5388659b-cffd-40b9-b370-ba14f9224f6d",
      "userName": "Will Freund",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIkT2IVJTfnebrPuqbZ8rFrW2n7JIvabPQHj9rHhs-Q=mo",
      "date": "2024-01-22T12:25:40.992Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5388659b-cffd-40b9-b370-ba14f9224f6d",
      "title": null,
      "text": "Absolutely the most useless program for taxes. Sends you back and forth between this app and credit karma, without ever actually finishing up the filing process. Verification emails don't come thru, even though I've used the same email since 2016 with them. Spent 58 minutes on the phone with a service rep, who while was friendly, that ultimately told me they have no idea how to fix the problem. Save yourself time and download literally any other app to do your taxes.",
      "replyDate": "2024-01-22T15:31:28.762Z",
      "replyText": "Hi Will, thank you for sharing your experience. Your time is valuable, and these obstacles are certainly not what we aim for in our user experience. We're constantly working to improve our services, and feedback like yours is crucial for that process. Please reach out to us via one of our social media platforms: FB, IG, or X.\n\n-Lissette",
      "version": null,
      "thumbsUp": 49,
      "criterias": []
    },
    {
      "id": "1f445238-360e-45d6-8961-cfee2638f364",
      "userName": "PhillyCheese",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJxAFaltBcirAmkAC2JiUe5_YM0adQXM4tnT53_WsH1=mo",
      "date": "2024-01-24T23:02:04.877Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=1f445238-360e-45d6-8961-cfee2638f364",
      "title": null,
      "text": "Absolute garbage. Don't use TurboTax. They are scamers and thieves. 0 stars. Their trash policies make it where it's impossible to qualify for their free version, so you end up having to pay for the deluxe version no matter what, even if it is just a simple standard file, and God forbid you have the fee taken out of your return, otherwise they'll charge you a fee on top of that fee, just so they can double down on screwing you. They need to be shut down completely and permanently.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 55,
      "criterias": []
    },
    {
      "id": "9fd075de-5e5e-471e-b427-8d75cdae1a63",
      "userName": "Becky Lea",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLzPVYZnw6vsJOHN1syEbYwOFqdI3wVKG-l6-6vL-Z2=mo",
      "date": "2024-03-05T23:58:43.585Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=9fd075de-5e5e-471e-b427-8d75cdae1a63",
      "title": null,
      "text": "The newest update has made it impossible to check the status of my taxes!! I have not been able to sign into my account on the app AT ALL since the update. Either I hit the sign in button and nothing happens or as soon as I enter my code to validate my account it goes back to the sign in page. I've had to get on the website to check the status.. the app is POINTLESS!!!!",
      "replyDate": "2024-03-06T00:10:04.686Z",
      "replyText": "Hello Becky, thank you for choosing TurboTax. We are disheartened to hear that you have experienced these issues and would like to provide some assistance. Could you please reach out to us via one of our social platforms- Instagram, Facebook, or X(formerly known as Twitter), so that we may better assist you?\n-Dylan",
      "version": null,
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "9233d702-a267-44e6-9832-23bd30e45828",
      "userName": "Kyle Woznick",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWVhfFd1P9d_XIO-5QPmcaiPwDJatyrgg09vE_y1hGYTqc",
      "date": "2024-01-09T23:53:35.810Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=9233d702-a267-44e6-9832-23bd30e45828",
      "title": null,
      "text": "I can not accurately express my disdain for this program. There is no one, central user hub where you can select your intention and navigate accordingly. Instead, you begin as if filing taxes for the prior year even if you're just there to get previous tax data. The site is not intuitive, and does a poor job of translating the complex tax process into an easy to navigate, understandable process. Self employed, 1040 user.",
      "replyDate": "2024-01-10T00:48:11.430Z",
      "replyText": "Hello, Kyle. We're saddened to hear you haven't had the best experience using our product. We appreciate your feedback, as it's valuable in helping us improve. We want to learn more about your concerns to ensure you have a smoother experience going forward. Please feel free to reach out to us via Instagram, X, or Facebook! — Doreen",
      "version": "9.7.0",
      "thumbsUp": 80,
      "criterias": []
    },
    {
      "id": "ed3f06da-851c-40b7-9c1e-0e4161aaae12",
      "userName": "Chris Carroll",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLtch6QkT2JZgKBpk-f4W3LrsFkuODPZPyjvXDnDCiVFA=mo",
      "date": "2024-02-11T13:01:11.206Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=ed3f06da-851c-40b7-9c1e-0e4161aaae12",
      "title": null,
      "text": "If you're unable to update you're not alone I've seen several different people posting complaints about the TurboTax app doesn't work or it's stuck in update mode. It's been doing it for me since Friday morning the 9th. I'm speechless, It's a time to switch to another software company...day 3 and it will not allow me to update, I'm guessing that TurboTax has been hacked and everyone's information has been compromised or so the rumors are showing. If this is true then people are in big trouble",
      "replyDate": "2024-02-11T04:51:11.500Z",
      "replyText": "Hello Chris, thank you for reaching out to TurboTax. We are disheartened to hear you had a negative experience this year, as this is never how we want our customers to feel. Please feel free to reach out to us directly on X, Instagram, or Facebook and we will be happy to help troubleshoot this! - Madison",
      "version": null,
      "thumbsUp": 24,
      "criterias": []
    },
    {
      "id": "e352f5e3-e32f-489a-a681-6b3c3770fe0a",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-29T15:09:22.848Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e352f5e3-e32f-489a-a681-6b3c3770fe0a",
      "title": null,
      "text": "I was very happy with TurboTax last year. This year I'm not. Filing was very simple at the start - all my previous info was loaded and I was feeling really good about filing...until I got to the point of finalizing my return. They said I needed to go Deluxe. I was confused on why, but decided paying $39.99 wasnt a big deal, so I went ahead. Got to the very end and turns out they want to charge $40 for Federal, for State, and for electing to have the fees taken from my refund. $120 in fees!",
      "replyDate": "2019-01-30T01:46:06.460Z",
      "replyText": "Hello, \n\nIt’s clear that this might be a very frustrating situation for you. Depending on what your tax situation was last year, you might need to use new tax forms or schedules to claim the same deductions, credits, or types of income.  If you are filing one of these new forms or schedules, you may need to use TurboTax Deluxe. -TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 105,
      "criterias": []
    },
    {
      "id": "3845e7a8-0b36-4545-9919-f28d1e884cec",
      "userName": "Cory",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIneap6UJNFX4n2TjJK3OFCBvaZtsMu-r03ZLdnxnxzZJs=mo",
      "date": "2022-02-14T21:30:39.523Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=3845e7a8-0b36-4545-9919-f28d1e884cec",
      "title": null,
      "text": "TurboTax gets worse and worse each year. It's UI is slow, it's not user friendly at times, and there's way too many bogus fees. Doing state taxes is a nightmare if you just want to file by mail instead of paying another fee to efile. You have to get the CD/download for that. You can't start online/app and move to the software version. To pay TurboTax with your tax return? There's a fee for that ad well. Absolutely ridiculous. I only wish I could give TT half a star and stick to the paper forms.",
      "replyDate": "2022-02-15T16:51:37.817Z",
      "replyText": "Hi Cory, thank you for your feedback. it is unfortunate that you are unhappy with your experience on TurboTax. We understand your frustration and we want to provide you with our undivided attention. For help with navigation, please use this link: https://intuit.me/3stz7I3 . Please contact us on Facebook for assistance with your return.\n\n-Eboni",
      "version": "8.2.0",
      "thumbsUp": 153,
      "criterias": []
    },
    {
      "id": "546ea6a1-bc50-49e0-b293-81dc27d471ef",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-04T23:50:06.312Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=546ea6a1-bc50-49e0-b293-81dc27d471ef",
      "title": null,
      "text": "I don't really understand but it use to be so easy to file your taxes with TurboTax, I've been doing it for the past 4 years. this year has just been a headache. you have to log onto your account via computer to delete forms defeats the whole purpose of mobil app. after having that issue with my federal return, I run into problems with my state return. This year I've had to wait for a specialist 3 times. I don't believe I'll be returning next year.",
      "replyDate": "2019-02-05T21:49:52.970Z",
      "replyText": "Hello,\n\nWe are here to turn this experience around for you. Our team of experts are more than happy to diagnose the problem for you. You have the option of emailing TTAppFeedback@intuit.com or contacting TurboTax Support on Facebook or Twitter. Hope this helps! \n\n\n-TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 64,
      "criterias": [
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_home_insurance",
          "rating": 3
        }
      ]
    },
    {
      "id": "4af9f2d8-0361-4115-9e16-75fc9a6f8f9b",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-03-01T02:04:31.350Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=4af9f2d8-0361-4115-9e16-75fc9a6f8f9b",
      "title": null,
      "text": "Used to love using Turbo Tax as it was free and easy to file. Then, in the past 2 years, they've been adding hidden fees that are absolutely unnecessary. Free became $40 to upgrade, then another $40 to allow them to take the cost out of your return, and now I'm hearing that this year they're forcing people to upgrade to Premium. Apparently having just a W-2 to enter is way to complicated for them to remain true to their \"free filing\" advertising. This company should be renamed Ripoff Tax.",
      "replyDate": "2019-03-01T17:59:21.270Z",
      "replyText": "We understand how the price may be a concern. Tax preparation can sometimes be stressful and that's why every year our team ensures we're up-to-date with the latest laws so that you're confident when filing. We offer different products on different platforms, because these products have variations, the pricing does as well. - TurboTax Care Team",
      "version": null,
      "thumbsUp": 65,
      "criterias": [
        {
          "criteria": "vaf_never_display_make_you_happy",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_financial_news",
          "rating": 2
        }
      ]
    },
    {
      "id": "82ad45cf-8c00-42ca-8f52-a86472cc962e",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-03-11T22:13:37.202Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=82ad45cf-8c00-42ca-8f52-a86472cc962e",
      "title": null,
      "text": "Frustrating. The app works great but it's annoying seeing them constantly trying to get me to upgrade and making certain options or deductions available only if we upgrade. 3/11/2020(replying to turbo tax) I know what the higher tiers are for. I know that I have simple tax returns. There for, I know that I don't need the higher tiers. Meaning, I don't need the system consistently asking me to upgrade. It is a rip off. There is no reason someone with my kind of returns needs to pay to file.",
      "replyDate": "2020-02-21T17:53:10.408Z",
      "replyText": "Hi Gabriel!\nI understand the frustration in being prompted to upgrade.  Most customers start off in TurboTax Free Edition which is designed for simple returns with no added schedules. The higher tiers ensure you have the correct forms for accurate filing. More information about being upgraded is available here: https://intuit.me/37P8Qrv\n-Ashlie",
      "version": "6.3.0",
      "thumbsUp": 95,
      "criterias": []
    },
    {
      "id": "e5e55dce-3684-4e68-a491-a73bfb22ebb9",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-07T04:09:38.442Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e5e55dce-3684-4e68-a491-a73bfb22ebb9",
      "title": null,
      "text": "This app is amazing at doing your taxes. Unfortunately, its terrible at everything else. Navigating the app while doing your taxes is a chore. The majority of the time you will be restarting the app, trying to go back where you just were, or you're going to try to input your information in one of TurboTaxes many pages that don't want to act correctly.",
      "replyDate": "2019-02-07T23:01:12.243Z",
      "replyText": "Hi Brannon,\n\nWe really appreciate your feedback! If you're willing, our TurboTax Mobile Team would like to look into your experience. Please send an email to: TTAppFeedback@intuit.com with some details on what what happening. Thanks!\n\n-TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 54,
      "criterias": []
    },
    {
      "id": "edbc1773-c8f9-45fa-87ae-a31eb38e98b6",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-03-11T08:31:38.654Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=edbc1773-c8f9-45fa-87ae-a31eb38e98b6",
      "title": null,
      "text": "I've been using turbotax for years. I remember when you could get it done for 20$ and about 30 minutes of your time. Now it's closer to 150$ after forced upgrades and service fees and takes twice as long. Honestly might be better to explore newer and better options down the road. People reading this dont pay 40$ for turbo to take money from your return, it is literally them charging us to take our money. The fact that this has 4.4 stars is outrageous. 40$ is not a convenience fee, its robbery.",
      "replyDate": "2020-03-11T15:40:57.830Z",
      "replyText": "Hi Gary,\nWe never want our customers to feel robbed. Please know that you have the option to pay for our services with your refund for an additional fee or free of charge with your credit/debit card through Google Pay. In the future, it's helpful to know that you can reduce your fees by following these steps https://intuit.me/2V6FMcg.\n-Erika",
      "version": "6.2.0",
      "thumbsUp": 62,
      "criterias": [
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_easy_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_see_multiple_accounts",
          "rating": 2
        }
      ]
    },
    {
      "id": "0b78d4c9-b6e2-44d0-8dd7-4b6f8fc76c1d",
      "userName": "Adam Bjornson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLGB4e-oO8Li3xSYDuyvoX6lIoDZGgAny01eNabn2vT=mo",
      "date": "2020-05-08T09:41:49.758Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=0b78d4c9-b6e2-44d0-8dd7-4b6f8fc76c1d",
      "title": null,
      "text": "Can't take screenshots, so saving any info, no matter how small, requires jumping through PDF hoops. Also pretty slow, with a bunch of pointless animation and re-filling of forms and signatures. Finally, it's expensive with all the extra fees and upselling. On the plus side, it's pretty simple as long as you have all your forms with you. And you can scan in your W-2 with the camera, but no other forms support that. Expect to spend about 2 hours and up to two hundred bucks.",
      "replyDate": null,
      "replyText": null,
      "version": "6.6.0",
      "thumbsUp": 83,
      "criterias": [
        {
          "criteria": "vaf_phase1_backing_up_your_data",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "b8b204a7-558e-402b-8877-426d27417397",
      "userName": "Melanie Winland",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJuPOa4FKWZxq4TDMvEQ0iMnNsVd2WcGA4P_xytsVl9=mo",
      "date": "2021-05-10T03:03:23.700Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=b8b204a7-558e-402b-8877-426d27417397",
      "title": null,
      "text": "We have used TurboTax for years with no issues. This year, the app is awful!! If we click on a link to get more information, the link doesn't load. We tried four times to get live help after we upgraded to get the live help. Sessions connect but there's no one there. We are considering canceling out of this and having someone do our taxes this year so we don't have to fight the app anymore. I would give zero Stars if that was an option.",
      "replyDate": "2021-05-10T15:37:35.471Z",
      "replyText": "Hi Melanie,\nWe'd like to help! You can try uninstalling/reinstalling the app and see if that solves the issues. You can also access your account through our website here: http://TurboTax.com. You can leave feedback about the issue for our developers here: https://bit.ly/37k3NBL. If needed, reach out to our free support on Facebook/Twitter. ~JK",
      "version": "7.6.0",
      "thumbsUp": 185,
      "criterias": []
    },
    {
      "id": "6099ed4c-29dc-47c3-a262-8ecbacb4faeb",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-02-11T04:12:51.750Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=6099ed4c-29dc-47c3-a262-8ecbacb4faeb",
      "title": null,
      "text": "I've always used the pc version and it was always smooth and straightforward. This app version for Chromebook is definitely not that. There IS an additional $40 charge to deduct the payment for turbotax from your return that they don't show you until the very end, making it look like there's no fees until you've jumped through a lot of hoops. They repeatedly ask to upgrade. It's not easy to navigate and there's no way to print the receipt even though it asks. Never using it again.",
      "replyDate": "2020-02-13T23:38:35.172Z",
      "replyText": "Hi Cassie,\n\nI hope to clear up your concerns. The $40 for our Refund Processing Fee is completely optional. You can pay with a credit/debit card under the pay with Google Play choice which is at payment at the end as you mentioned. If you can't print from the app signing into TurboTax.com on a computer is the way to go. \n\n-Andrew",
      "version": "6.2.0",
      "thumbsUp": 139,
      "criterias": []
    },
    {
      "id": "9babfe5d-a762-4056-abf6-c8aca2f70443",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-08T07:25:36.980Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=9babfe5d-a762-4056-abf6-c8aca2f70443",
      "title": null,
      "text": "Hidden fees. Misswording. There is a misswording with the $39.99 charge for \"new forms\" and that we can paid in the spot or later and get deducted of our tax refund. In the next window stated again if you are OK with the $39.99 fee but it never explained that is a second charge and is not the same has the prior charge. So, turbotax finished charging me $73 when it supposed to be $31.97. I'm very upset.",
      "replyDate": "2019-02-09T18:38:39.886Z",
      "replyText": "We understand how the price may be a concern. Tax preparation can sometimes be stressful and that's why every year our team ensures we're up-to-date with the tax laws so that you're confident when filing. We offer different products on different platforms, and because these products have variations, the pricing does as well. - TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 35,
      "criterias": [
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_managing_credit_cards",
          "rating": 1
        }
      ]
    },
    {
      "id": "eee076d5-2d30-4361-99c7-81e291018787",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-03-28T02:24:21.330Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=eee076d5-2d30-4361-99c7-81e291018787",
      "title": null,
      "text": "not explanatory enough. I have used TurboTax for at least 11 years. the app is very simple, TOO SIMPLE. this is not good because some of the explanations were inefficient or non-existent. a few times I had to actually go to the IRS website to look up a publication to see if I was doing it right on TurboTax. for instance deducting expenses for royalty property that you live on. when you clicked on learn more it only covered depletion. I wondered if I was putting the amounts in the correct place.",
      "replyDate": "2019-03-31T16:47:45.220Z",
      "replyText": "Hey there, thanks so much for the feedback. We've passed it along to our product teams, so we can continue to improve the app experience. - TurboTax Care Team",
      "version": "5.5.0",
      "thumbsUp": 79,
      "criterias": [
        {
          "criteria": "vaf_phase1_see_multiple_accounts",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_depositing_checks",
          "rating": 2
        }
      ]
    },
    {
      "id": "7d001173-bfae-4a21-9d6d-5229f89bc436",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-02-01T19:34:47.737Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=7d001173-bfae-4a21-9d6d-5229f89bc436",
      "title": null,
      "text": "I have used Turbotax for over 10 years now, and never really had a problem before. Now whenever I try to sign in, it says I need a faster browser and gives me 4 options. I downloaded Chrome and it STILL won't let me sign in and just reverts to the screen with the browser options. I'm not sure if H&R Block has good charitable deduction software, but I'm ready to switch. Taxes are aggravating enough already!",
      "replyDate": "2020-02-03T18:20:26.390Z",
      "replyText": "Hi Patti, Thanks for taking the time to reach out. We want to help you out! You can get log-in assistance here: https://intuit.me/2UlHNko. You can also reach out to us on Facebook or Twitter. I hope this helps; we would hate to see you go. -Ashley",
      "version": null,
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "5491c0d0-778a-470d-819e-eb7cfafc6f89",
      "userName": "John McCarthy",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWaayw7BVUpWFBIhh7rDVo9vWXyTeVZVMHikY6ofD_8c8M",
      "date": "2023-03-04T07:01:41.467Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5491c0d0-778a-470d-819e-eb7cfafc6f89",
      "title": null,
      "text": "I've been using turbo tax for 7+ years and have been happy with it. Filling for 2022 with turbo tax has been ridiculous. I will never use it again. It used to be super easy and inexpensive. Now, it's not any less expensive than visiting a tax professional in person. Not to mention, it seems like they're making their user interface more and more difficult to navigate, but they offer a more expensive package. TurboTax, you've lost a 7+ year return customer.",
      "replyDate": "2023-03-04T13:10:18.476Z",
      "replyText": "Hello John! With TurboTax Free Edition, you can file qualifying simple returns. Our packages continue up to Self-Employed for those who have specific tax situations. Please send us a private message on your favorite social platforms like Facebook, Twitter, or Instagram to further discuss your concerns. Thank you for using TurboTax!- Anthony",
      "version": "9.4.0",
      "thumbsUp": 757,
      "criterias": []
    },
    {
      "id": "4456f8e1-6b58-49b6-ae7c-85f7590eb792",
      "userName": "Jo K",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLssWeWpZ5nB8_Jz0N7Q9DUIAhbjIXMIgDMkm393wTC=mo",
      "date": "2020-07-06T00:05:10.924Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=4456f8e1-6b58-49b6-ae7c-85f7590eb792",
      "title": null,
      "text": "Last year there was no issue, loved the app and it was user friendly and straight forward. This year, there's something strange happening, gets stuck on certain parts of the process and goes around in a loop. Tried it both online and visa app. Same issue at different stages. Live help couldn't help, as it wasn't tax problem but more the issue with a buggy app. It's been stuck for hours, I've tried numerous times. Very frustrating experience and unable to finish lodging my tax return.",
      "replyDate": "2020-07-06T21:53:06.954Z",
      "replyText": "Hi there, We can certainly understand that you are frustrated and we want to do what we can to help you complete your process. Please take some time to share the details of this experience with our support team on Facebook or Twitter. We look forward to hearing from you! -Minh",
      "version": "6.8.0",
      "thumbsUp": 134,
      "criterias": []
    },
    {
      "id": "f99de768-af1e-4584-b144-d453568b1771",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-04-12T17:40:28.296Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f99de768-af1e-4584-b144-d453568b1771",
      "title": null,
      "text": "The Turbo Tax Virtual Assistant is a cool idea, but I could not get it to work. Tried several times to talk with someone and to TurboTax credit, a specialist actually gets with you very quickly. They show up ready to help, but can not hear me at all. I have the mic permissions on and I'm using a fairly new phone(Galaxy S8), but they can't hear. I mean, a keyboard popping up to text them would be awesome, then I could at least somewhat communicate, but there's nothing like that. Disappointed.",
      "replyDate": "2019-04-12T17:39:33.240Z",
      "replyText": "Hi Ryan,\nThank you for your constructive feedback. Thanks so much for the feedback. We've passed it along to our product teams, so we can continue to improve the app experience. -TurboTax Care Team",
      "version": "5.6.0",
      "thumbsUp": 158,
      "criterias": []
    },
    {
      "id": "baede3dc-4870-4cd9-b115-2d277bb41fee",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-08T11:30:54.375Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=baede3dc-4870-4cd9-b115-2d277bb41fee",
      "title": null,
      "text": "Was great for a couple years, but now they've got all your data stored and made it easy, they're leveraging that to reach into your wallet. Which, in and of itself isn't necessarily a bad thing. When I 1st used TurboTax, it was free, no sneakiness. Then, last year or the year before, they tried to get you to pay for convienience by auto-entering all your data from the prior year only to remove it all while you watched if you wouldnt pay. It's a misleading way to do business. Basically Extortion.",
      "replyDate": "2019-02-09T18:37:45.963Z",
      "replyText": "We understand how the price may be a concern. Tax preparation can sometimes be stressful and that's why every year our team ensures we're up-to-date with the tax laws so that you're confident when filing. We offer different products on different platforms, and because these products have variations, the pricing does as well. - TurboTax Care Team",
      "version": null,
      "thumbsUp": 149,
      "criterias": [
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_life_insurance",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        }
      ]
    },
    {
      "id": "4797df15-6b94-48df-b7f1-b130ad4be532",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-09T13:32:12.687Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=4797df15-6b94-48df-b7f1-b130ad4be532",
      "title": null,
      "text": "I've filed with Turbo Tax for the past 7+ years. In the past it's been simple and free, like they claim. This year I HAD to upgrade in order to file because of different \"forms\" this year that required extra work, if i understood correctly. It was very vague and didn't make any sense at all. I proceeded with it only to realize that it totaled more than $100 because i opted to have my returns deposited into my bank account. It was all a bit ridiculous. I filed for FREE with Credit Karma",
      "replyDate": "2019-02-09T18:41:50.637Z",
      "replyText": "We understand how the price may be a concern. Tax preparation can sometimes be stressful and that's why every year our team ensures we're up-to-date with the tax laws so that you're confident when filing. We offer different products on different platforms, and because these products have variations, the pricing does as well. - TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 94,
      "criterias": []
    },
    {
      "id": "f637fea8-18fb-415f-b94e-74de7054b0a8",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-04-15T06:09:16.393Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f637fea8-18fb-415f-b94e-74de7054b0a8",
      "title": null,
      "text": "The app itself is actually pretty good - the process is simple, easy to understand, and the ability to snap a photo of my W2 is a huge time-saver. However I could not remember my password and the process to reset it kept sending me in circles for several hours before it randomly worked. I also kept encountering \"oops, that didn't work\" errors when trying to read information. Additionally, TurboTax now charges for many things which are FREE from other services. Serious decline in quality =/",
      "replyDate": "2020-04-15T18:33:12.817Z",
      "replyText": "Hi there,\nIt's great to hear that you enjoyed using our app to help you file your taxes. Please know that you encountered layers of our security features that are designed to protect your account when you attempted to access your account. If you wish to review your charges, please follow the steps here https://intuit.me/2tMtaLL.\n-Erika",
      "version": "6.5.2",
      "thumbsUp": 82,
      "criterias": []
    },
    {
      "id": "a08b8252-d3c8-49d1-93bd-1193556addde",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-30T00:08:10.417Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=a08b8252-d3c8-49d1-93bd-1193556addde",
      "title": null,
      "text": "The app was frustrating and clunky. I kept swiping accidentally during the whole lengthy ordeal and having to reenter information over and over. There should have been an option to download my W2 pdf. It's the digital age, but the best we can do is print it out and take a picture? That is nonsense. Terrible experience start to finish.",
      "replyDate": "2019-01-30T22:21:33.579Z",
      "replyText": "Hey there, thanks so much for the feedback. Most customers actually take advantage of the w2 import using their EIN (employer identification number), which is easier than the picture import. We've passed it along to our product teams, so we can continue to improve the app experience. - TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "fc8d397b-3508-4693-a0a5-597a294cad1a",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-06T17:33:50.398Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=fc8d397b-3508-4693-a0a5-597a294cad1a",
      "title": null,
      "text": "TurboTax is super easy to use. I Loved it, since I used it for years. However they ARE NOT FREE they start by asking if you want free, which you select. Then at the end they tell you that you have to pay $39.99 for Federal, $39.99 for State, and $39.99 to e-file your tax. Then an additional $79.98 for the deluxe that you never selected. A TOTAL OF $199.95. This happened to me a few friends & family members. This is a complete rip-off. Never Will use again!!!!",
      "replyDate": "2019-02-06T17:56:17.410Z",
      "replyText": "Tax preparation can sometimes be a bit stressful and that's why every year our TurboTax team ensures we're up-to-date with the latest tax laws so that you're confident when filing. We offer different products on different platforms, and because these products have variations, the pricing does as well. – TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 58,
      "criterias": [
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_personal_loans",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        }
      ]
    },
    {
      "id": "37692c0e-ed17-424a-ab8e-4f355cf4912a",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-16T14:51:44.580Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=37692c0e-ed17-424a-ab8e-4f355cf4912a",
      "title": null,
      "text": "I've used it in previous years and it worked fine. I got to charitable donations and couldn't get to what I needed on the screen. I gave up and went online to see the same screen but you can actually manipulate the size or relative position to see the other items on the screen. The swiping sideways idea for navigation is terrible. I'm not satisfied with my experience at all. The website for this years taxes kept telling me that tax code had changed and it affected me but it couldn't tell me why",
      "replyDate": "2019-01-16T20:30:04.509Z",
      "replyText": "Hi Bradley,\n\nWe hear you. We'd like to look into this for you. I'd recommend contacting our mobile support team via email TTAppFeedback@intuit.com for technical assistance. You also have the option of contacting or TurboTax Support team via Facebook or Twitter. Thank you for your patience. \n\n\n-TurboTax Care Team",
      "version": "5.2.1",
      "thumbsUp": 79,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_see_multiple_accounts",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_home_insurance",
          "rating": 3
        }
      ]
    },
    {
      "id": "c0e48a44-2a46-4fce-98f1-67fdfd2162ea",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-02-22T19:46:28.200Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=c0e48a44-2a46-4fce-98f1-67fdfd2162ea",
      "title": null,
      "text": "What is advertised as \"free\" ended up costing me $90. And I have the most basic tax situation. They charge $40 to file state taxes and then somehow added the deluxe service for $50 which I couldnt opt out of. Throughout the process they ask if you want to add a couple different services and both times I said no. But somehow a $50 service was automatically added. Then it would be another $45 if you want the payment taken out of your refund. This is the last year I use Turbotax! What a scam.",
      "replyDate": "2020-02-23T13:37:07.353Z",
      "replyText": "Hi there, It is never our intent to scam our customers. An upgrade is usually prompted based on your individual tax scenario so we can maximize your deductions. You can learn more at https://intuit.me/2RmFytW. You always have the ability to review your fees before you file: https://intuit.me/2V6up3K. I hope this helps. -Ashley",
      "version": "6.2.0",
      "thumbsUp": 56,
      "criterias": []
    },
    {
      "id": "e87f7596-1cb6-4855-803e-b06c8c603977",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-03-06T17:27:08.250Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e87f7596-1cb6-4855-803e-b06c8c603977",
      "title": null,
      "text": "Utterly disappointed by TurboTax and I must say I'll never be back. I've filed with them for the past 4 years and always had a good experience but no where close to that this year. First they didn't remember my login info or even register my email as having an account. Secondly it's NOT FREE this is false advertising they'll let you go through the whole process then throw fees on there at the end.",
      "replyDate": "2019-03-06T18:35:01.201Z",
      "replyText": "Hi April, we'd hate to lose you as a customer. TurboTax Free Edition is for taxpayers with a simple tax return, that file only the new 1040 form. Check out this FAQ for more details: https://ttlc.intuit.com/questions/2575733-why-do-i-have-to-upgrade-from-free-edition -TurboTax Care Team",
      "version": "5.4.0",
      "thumbsUp": 119,
      "criterias": [
        {
          "criteria": "vaf_never_display_make_you_happy",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        }
      ]
    },
    {
      "id": "fa396b9c-0909-46ee-8862-3de368748128",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-14T23:55:46.140Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=fa396b9c-0909-46ee-8862-3de368748128",
      "title": null,
      "text": "I've filed with TurboTax for six years now, but this year they've added hidden fees that aren't communicated to you until the very end (including forcing you to upgrade to Plus for certain deductions, and an additional $39.99 fee for paying for the fees with your refund). The app itself is quite functional and easy to use, but seems like they're charging you for it now and continuing to advertise it as free.",
      "replyDate": "2019-02-17T20:18:22.414Z",
      "replyText": "Hi,\nThe Refund Processing Service gives you the option to pay for your TurboTax fees with your refund. There may be a charge for this service depending on your situation and which add-ons you choose. This feature is offered as a convenience for those who don't want to use a debit or credit card, learn more about it here: http://intuit.me/1ZmJI07.",
      "version": "5.3.0",
      "thumbsUp": 525,
      "criterias": []
    },
    {
      "id": "5ee9f449-6742-4f48-97c2-92414d8f2378",
      "userName": "Joseph Bennett",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWsMjwnRrLP_cN2a-eYBweAF5HJiAu0TaXHIZUp688q48E",
      "date": "2020-07-11T17:46:19.136Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5ee9f449-6742-4f48-97c2-92414d8f2378",
      "title": null,
      "text": "Taxes are miserable as is this app. What I don't appreciate is that it somehow upgraded me to $90 premier when I needed $60 deluxe. I wasn't going back to start over my return or even sure if changing was possible. I just wanted to file and be done at this point. Then they want to charge you a $40 fee to pay with your return. I also wished there was an option to skip some entries if you know your standard deduction will be used anyways. I'll have an accountant next year.",
      "replyDate": "2020-07-13T20:36:16.673Z",
      "replyText": "Hi Joseph, You may have been upgraded if the software recognized that your tax situation requires a form that is supported in a higher version. It sounds like you also chose our Refund Processing Service, which is a convenient way to pay for TurboTax if you don't have (or don't want to use) your credit or debit card. I hope this helps! -Minh",
      "version": "6.8.0",
      "thumbsUp": 67,
      "criterias": []
    },
    {
      "id": "7da771a9-4dc5-4fe7-a468-31f2b210c5a0",
      "userName": "Lauren Pio",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVwXzTuBWOCNk4KdteAoLe77swTdqv6pA5nVFdJoMG5t9Q",
      "date": "2020-07-15T23:05:27.523Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=7da771a9-4dc5-4fe7-a468-31f2b210c5a0",
      "title": null,
      "text": "I've been using an iteration of this app for many years and it gets shadier every year. It gets harder and harder to file for free. If you select incorrectly early on, you won't catch it until it's time to pay, then you'll have to literally start over from scratch. I actually set a reminder to call an accountant next year. I'm so done playing these sneaky games.",
      "replyDate": "2020-07-16T17:30:40.271Z",
      "replyText": "Hi Lauren, We never mean to play any sneaky games with you. If your tax situation requires additional forms that are only supported in a higher version of TurboTax, you will need to be upgraded in order for us to maximize deductions and handle any additional tax-filing responsibilities. To learn more, go here: https://intuit.me/38dKY1b -Minh",
      "version": "6.8.0",
      "thumbsUp": 64,
      "criterias": [
        {
          "criteria": "vaf_phase1_investing",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_trading_stocks",
          "rating": 2
        }
      ]
    },
    {
      "id": "206de1ca-f955-4a1d-810e-3e92a3a8dc84",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-04-14T17:07:31.165Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=206de1ca-f955-4a1d-810e-3e92a3a8dc84",
      "title": null,
      "text": "Tricked me into paying 70 dollars for a service I didnt need. They really push their deluxe and max packages, and do tricky things like switch button placement and colors to try to get you to agree to paying. There's no way to remove these charges from your shopping cart at the end of filing. I've always used their free federal filing in the past, and I think this is the last time.",
      "replyDate": null,
      "replyText": null,
      "version": "5.6.0",
      "thumbsUp": 63,
      "criterias": [
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 2
        }
      ]
    },
    {
      "id": "3baa366a-bfc5-4d33-b0a5-ef12d6733805",
      "userName": "Jason Mason",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVNy9nvIVeyaY5yrg7f-kVB55LCDn0zs8_KwG67P_YsqHE",
      "date": "2022-02-16T19:22:34.768Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=3baa366a-bfc5-4d33-b0a5-ef12d6733805",
      "title": null,
      "text": "It keeps telling me I'm taxes can't be transmitted. I had the latest version and still it's telling me there's a problem transmitting. Then they forced me to upgrade without any option to stay with the basic version. Luckily my taxes didn't transmit because I'm definitely going to a different service. I've used TurboTax for years with no problem yet this year there are a ton of problems and strong arming into paying for what you don't want.",
      "replyDate": "2022-02-16T19:40:28.479Z",
      "replyText": "Hi Jason! It's unfortunate to hear that you received a transmitting problem while trying to submit your return. We would be happy to assist you with any concerns that you may have in regards to filing your return. Please reach out to our support team on Facebook/Twitter so that we may further assist you. We look forward to hearing from you! -April",
      "version": "8.2.0",
      "thumbsUp": 101,
      "criterias": []
    },
    {
      "id": "f82b1c4e-4d1e-4952-9860-d7a35298be2b",
      "userName": "Nicole Dotlich",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVguRt5roK4hYPSxxw7noylbzyNkcfeLdCGqWCbgTEWAyY",
      "date": "2022-04-19T00:18:19.494Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f82b1c4e-4d1e-4952-9860-d7a35298be2b",
      "title": null,
      "text": "Literally the worst experience ever. Constant freezing and force closing towards the end. Then, as I'm trying to transmit my file it tells me it failed only for it to say it went through a minute later. Does not verify driver's licenses, so the 11 on my license ended up being filed as qq. That's going to fun to deal with in the future I'm sure. Also misleading about the total and does not include their fee in your total until the very end. Super amazing for people living paycheck to paycheck.",
      "replyDate": "2022-04-19T02:45:12.753Z",
      "replyText": "Hi Nicole,\nWe hate to hear that you had a negative experience. Please share the in-app issues you experienced with our app developers here: https://bit.ly/3rAjgI3. It is never our intention to mislead our customers. If you have any questions or concerns about your fees and wish to review them, visit here: https://intuit.me/3Mk8Y6Z.\n-Erika",
      "version": "8.6.1",
      "thumbsUp": 142,
      "criterias": [
        {
          "criteria": "vaf_never_display_easy_to_use",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_payday_loans",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 2
        }
      ]
    },
    {
      "id": "e8fbe40e-9552-4fe7-8ba1-14477b518c07",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-29T03:51:34.536Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e8fbe40e-9552-4fe7-8ba1-14477b518c07",
      "title": null,
      "text": "i cannot recommend turbo tax based on their fee schedules. i have used them in thr past and it cost $20. today, upon trying to file for 2018, I was forced to use the \"deluxe\" version, $39.99, state also costs $39.99 &&&& wait, thats not all! there is now a fee to pay for the filing fee with your refund, something I've always done in the past. the fee also happens to be $39.99! so all in all, to file single with no dependents the fee is $119.97 + tax! absolutely unbelievable.",
      "replyDate": "2019-01-30T21:09:37.363Z",
      "replyText": "Hi Jessica,\n\nWe'd love to change your mind! Depending on which forms/schedules you may need, you may need to use TurboTax Deluxe, so you can get the support and guidance you need to get all the deductions and credits you are entitled to. For more info, visit: http://intuit.me/2k8Rt1y\n\n-TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 60,
      "criterias": []
    },
    {
      "id": "fbf741c6-0198-4b6a-9867-70909c39c3dd",
      "userName": "lmgmwm",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV-VGS2Es_wOTT00o8jjRPy-8zlfAcDyY5UJLI9DgTJXO8",
      "date": "2023-02-03T14:03:54.350Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=fbf741c6-0198-4b6a-9867-70909c39c3dd",
      "title": null,
      "text": "Not as user friendly as it used to be. Filing taxes with TurboTax has become confusing, and I completely skipped a section, because it was something I did not want, but it was on my return, anyway. After deleting it, through the website (that is only an option in desktop view) and starting over, it still did that. Reconsidering using them next year.",
      "replyDate": "2023-02-03T21:18:02.311Z",
      "replyText": "Hi, we appreciate you for leaving us a review! We are saddened to hear that you have had some difficulties navigating through TurboTax, as this is never the experience that we intend for our customers. We would like to take a closer look into this and provide our assistance. Please contact us on Facebook or Twitter, and we'd be happy to help! - K.D",
      "version": "9.2.0",
      "thumbsUp": 408,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "5bccf9d6-6b6d-43cc-bfbe-7daa8363acc4",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-01-27T23:03:26.617Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5bccf9d6-6b6d-43cc-bfbe-7daa8363acc4",
      "title": null,
      "text": "In the app it said there was a special promotion \"pay $40 to get another tax credit\" okay, that credit was 100 so good. But after all the hidden fees, its -$120 so now I have to pay to get a credit I could have went without. Makes no sense. Can't go back and change it. Customer service said I would have to start completely over if I want to change that one thing.",
      "replyDate": "2020-01-29T02:04:31.576Z",
      "replyText": "Hi Daniel,\n\nI hear your concern. It seems an upgrade was selected for the tax credit and you can learn more here: https://intuit.me/2RmFytW. The fees aren't intended to be hidden and steps to review them are at https://intuit.me/2tMtaLL. Details on how to reduce fees are accessible here: https://intuit.me/38qZP8I. I appreciate the review.\n\n-Xuan",
      "version": "6.2.0",
      "thumbsUp": 212,
      "criterias": [
        {
          "criteria": "vaf_phase1_tracking_finances",
          "rating": 3
        }
      ]
    },
    {
      "id": "7d363460-76f1-40df-8b3e-b4868e5a64d0",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-03-03T18:18:56.646Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=7d363460-76f1-40df-8b3e-b4868e5a64d0",
      "title": null,
      "text": "you want customer service? wait a week or pay $20. you want to easily be able to find, print or view previous years returns? pay $20-$40 and then good luck getting it to work. you want to pay for the services you just selected? have fun trying to find the one tab that allows you to get there in their menus, which constantly change back and forth. this will definitely be the last time i use their services. id rather pay any extra amount of money to go through someone else and have it go smoothly.",
      "replyDate": "2019-03-04T20:56:24.535Z",
      "replyText": "Hi there,\n\nWe respect your feedback and we want to provide you with as much support as you need and to make sure you feel you're getting the most value for your investment. If you need any help, feel free to reach out to us at TurboTax support on Facebook or Twitter - TurboTax Care Team",
      "version": "5.4.0",
      "thumbsUp": 45,
      "criterias": [
        {
          "criteria": "vaf_never_display_make_you_happy",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_backing_up_your_data",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_investing",
          "rating": 2
        }
      ]
    },
    {
      "id": "f1ca6353-7f35-47c1-9181-c83ede2d97cb",
      "userName": "Elizabeth Marler",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKYC8mK79Uo5QkFO-OI0_aVuKttZbviBbzRFMHmgFCR=mo",
      "date": "2021-02-16T18:26:19.282Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f1ca6353-7f35-47c1-9181-c83ede2d97cb",
      "title": null,
      "text": "I've used Turbo Tax for years. App doesn't seem to be working. I've updated, removed and reinstalled. When I hit \"Start Free File\", the app does absolutely nothing. Been trying for days! *Apparently the links on the opening page are broken. If you chose \"see all products\" and chose \"Free Edition\" from there, everything works fine. Took about 30 mins to completely file and submit both Fed and State returns.",
      "replyDate": "2021-02-16T15:30:34.187Z",
      "replyText": "Hi Elizabeth,\nIt's unfortunate to hear that your app isn't functioning properly despite all of the steps you have taken. Please share the difficulties with our app developers so they may look further into your issue here: https://bit.ly/3olzAI3.\n-Erika",
      "version": "7.3.0",
      "thumbsUp": 53,
      "criterias": []
    },
    {
      "id": "f942c680-1b82-4780-b510-f8f76ce369ca",
      "userName": "Golden Willich",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUKHWGKYAw8YVWoL8Frm_iX2KKFBJZc7PHXevwdoA-CqvU",
      "date": "2022-10-17T16:58:35.155Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f942c680-1b82-4780-b510-f8f76ce369ca",
      "title": null,
      "text": "I've used Turbo Tax for decades but this will be my last. it's become confusing without benefit of a back button, and it has almost constant annoying upsell of it's product that is deceiving in it's price displayed. Plus I have to subscribe to Credit Karma if I want to track my tax return status. There is so many tax apps out there I'm sure I'll find a better one next year. It was a good app in the beginning. They didn't have my bank for my mortgage listed. It's #6 largest in the world. Lame.",
      "replyDate": "2022-10-17T17:10:44.378Z",
      "replyText": "Hi there, we appreciate you sharing your feedback with us! To see why you may be asked to upgrade: https://intuit.me/3Hl54rv To track your e-filing status, you do not need to sign up for anything extra: https://intuit.me/3xmpGhK If you'd like to continue to track your return after it has been accepted, please visit: https://bit.ly/3G8wWA2\n-Erin",
      "version": "8.13.0",
      "thumbsUp": 336,
      "criterias": [
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 2
        }
      ]
    },
    {
      "id": "4fd8372b-9394-456b-9f71-75f3b44c7dcf",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-04-18T17:53:18.578Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=4fd8372b-9394-456b-9f71-75f3b44c7dcf",
      "title": null,
      "text": "I've used this app the last 4 years or so for my taxes and it's generally pretty easy. But the app itself, nowadays, seems to be filled with upgrade choices at every turn. If you choose to pay your taxes with your refund, that's a fee. I'm a single adult who rents, with no dependents. My taxes are a cakewalk for most specialists. However, what starts out as a $40 tax return, quickly becomes $140+. It was fun while it lasted, but this will be the last year. Also, the automated help bot sucks.",
      "replyDate": "2020-02-21T22:48:54.504Z",
      "replyText": "Hi Kyle,\nOur app begins with this on the Free Edition. You'll be prompted to upgrade if your taxes require extended coverage to accurately complete your taxes.  Here are steps to review your charges:  Menu bar in the top left&gt; Review&gt; Review your order.\n-Erika",
      "version": "6.5.2",
      "thumbsUp": 149,
      "criterias": []
    },
    {
      "id": "c913c459-5463-48a8-8a50-bb07b10a93db",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-26T09:13:08.881Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=c913c459-5463-48a8-8a50-bb07b10a93db",
      "title": null,
      "text": "I LOVED the ease, BUT I felt deceived by the end of it. It started out saying it would be $40 to file, but once I added state, that was another $40, and to wait until I got my refund to pay turned out to be another $40! Ended up being charge 3× as much as advertised. Although the program was easy, I will never use this service again because of the false advertising. It would have been better to outline these fees upfront, rather than adding then as I go, when I'm less likely to start over.",
      "replyDate": "2019-02-26T18:08:12.498Z",
      "replyText": "We understand how the price may be a concern. Tax preparation can sometimes be stressful and that's why every year our team ensures we're up-to-date with the latest laws so that you're confident when filing. We offer different products on different platforms, because these products have variations, the pricing does as well. - TurboTax Care Team",
      "version": "5.3.0",
      "thumbsUp": 79,
      "criterias": []
    },
    {
      "id": "e70d6c61-dc4c-4eb6-92c5-067b396d2f79",
      "userName": "John Gibson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWRhWgqs1h0KmYeYhzMHfHJLOC5x1Rzve8rkn1IVVRkz-8",
      "date": "2022-04-19T03:33:34.371Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e70d6c61-dc4c-4eb6-92c5-067b396d2f79",
      "title": null,
      "text": "Been using turbo tax for 10+ years. This year the software is much worse. I had to keep upgrading to even be able to enter my taxes correctly. Everything involves contacting support. I had to submit payments multiple times for turbo tax to register them. I was told to take it up with my bank for a refund. I will probably never use turbo tax again after this year. Read all the other reviews. 1 star after 1 star of longtime turbo tax users. Something has changed, this is not good software anymore.",
      "replyDate": "2022-04-19T01:30:04.610Z",
      "replyText": "Hi John,\nAs a longtime customer of TurboTax, this is absolutely not the experience that we wanted you to have. Our support team would be happy to further investigate the issues that you experienced this tax season. Please contact them on Facebook/Twitter. We hope we can turn your experience around and look forward to hearing from you.\n-Erika",
      "version": "8.6.1",
      "thumbsUp": 67,
      "criterias": [
        {
          "criteria": "vaf_phase1_managing_credit_cards",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_investing",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_life_insurance",
          "rating": 2
        }
      ]
    },
    {
      "id": "d3d26f49-07d3-4e68-bea6-ff8258311912",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-13T21:06:57.603Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d3d26f49-07d3-4e68-bea6-ff8258311912",
      "title": null,
      "text": "I had a rough time this year with TurboTax. I can't submit my taxes even after upgrading twice. they had an option to print it out and send it in manually, but that's lesser to H&R block in my opinion. I hope they fix this next year. I wasted 4 hours to find a glitch that prevents me from submitting, which is ok, I know that the cost was way too high anyway. (over 100 dollars, without optional upgrades, the upgrades where MANDATORY)",
      "replyDate": "2019-01-25T20:36:29.606Z",
      "replyText": "Hi there,\n\nThat sounds like a frustrating experience. We'd hate to lose you as a customer. If you're still having issues submitting your tax return, we're available to help. Please contact our Support Team on Facebook, Twitter or on our website. -TurboTax Care Team",
      "version": null,
      "thumbsUp": 16,
      "criterias": [
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_managing_credit_cards",
          "rating": 3
        }
      ]
    },
    {
      "id": "2b1949d9-8d1b-4a19-992e-3bede8af7e4f",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-12T21:58:30.791Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=2b1949d9-8d1b-4a19-992e-3bede8af7e4f",
      "title": null,
      "text": "Literal trash. This app had me swiping right more often then a horny kid on tinder. Every other step is \"ALMOST DONE!\" only for there to be one sentence of text or ONE checkbox until i have to swipe right again. It literally didnt copy ANYTHING from previous fields. I was typing things in 7 times. All of them separated by tons of swipes. hides free services. the cherry on top is it forced me to download a new app to access a pdf of my return. Actual trash.",
      "replyDate": "2019-02-13T22:04:37.101Z",
      "replyText": "Hi Stratton,\n\nWe understand how frustrating that could be, and it's definitely not how we want you to feel about us. We're always happy to hear feedback, and appreciate you sharing yours. If you have any questions, feel free to ask TurboTax Support on Twitter, Facebook, or out online community forum.\n\n-TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 11,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_life_insurance",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        }
      ]
    },
    {
      "id": "e6ee4464-8f74-4ae6-8f2a-1689f04985b1",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-02-22T10:40:19.288Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=e6ee4464-8f74-4ae6-8f2a-1689f04985b1",
      "title": null,
      "text": "I want to cancel the deluxe option, it said it was $40 but when ready to file they charge you double. There is no option to cancel so I have to file my taxes somewhere else. When you're only getting a $300 refund $80 is unreasonable. Reply: No, total it was $120. You offered $40 for the deluxe. At the end it charged $40 for each, state + federal equaling $80. THEN the $40 processing state fee on top of that. No option to cancel or start over. If there is, you make it very difficult to find.",
      "replyDate": "2020-02-24T20:12:40.104Z",
      "replyText": "Hi Samantha,\n\nThank you for your response.  If you wish to remove the refund processing fee, please follow this link: https://intuit.me/2SSeBAa.  Additionally, here's a link if you wish to clear and start over your taxes: https://intuit.me/2SF9PGe.  This article will instruct you on how to clear and start over your taxes on a web browser.\n\n- Erika",
      "version": "6.2.0",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "8475e601-34b1-4871-982f-3dbbabe9856c",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-21T15:45:08.650Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=8475e601-34b1-4871-982f-3dbbabe9856c",
      "title": null,
      "text": "It advertises as free. Then forces you to pay the upgrade to be able to continue, promising you more money, then charges that price 3 times what it was stating and doesn't get you a better tax return. And once you've filed you can't cancel an order. Credit Karma does your taxes for free, is easier and clearer to use, and doesn't steal your money. Never using Turbo Tax again. Toodles.",
      "replyDate": "2019-01-23T18:24:48.240Z",
      "replyText": "Hello,\n\nI hear your frustrations.This increase will enable us to continue to provide the quality & breadth of service you love. Depending on what your tax situation was last year, you might need to use new tax forms to claim the same deductions/forms of income, therefore upgrade. Thanks\n\nTurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 55,
      "criterias": []
    },
    {
      "id": "f1c91c00-5969-4b7e-b46b-12136afb8912",
      "userName": "Dustin Hensley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ10RB1owpCf2tF6wEcRKWJW-nljwvp-ibwkBF-UgGEqQ=mo",
      "date": "2021-01-23T00:48:56.307Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=f1c91c00-5969-4b7e-b46b-12136afb8912",
      "title": null,
      "text": "I've used turbotax to file my taxes every year for the past 4 or 5 years and it's been great. Apparently they updated the app or something because it's garbage now. Finally managed to get it to accept my login information (after locking my account despite using the correct info) only for it to say \"unable to connect to server\" repeatedly whenever I tried to login. Uninstalled and reinstalled, same problem. Super disappointing.",
      "replyDate": "2021-01-23T14:58:50.230Z",
      "replyText": "Hi Dustin,\nThank you for reaching out to us regarding the issues you're experiencing with our app. We recommend sharing this info with our app developers here: https://bit.ly/3lTUxZA. You may also contact our helpful support team on Facebook/Twitter for further assistance. We hope this helps resolve your concerns.\n-Erika",
      "version": "2.7.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "6767f171-123c-4c5e-84e5-8e303486c55e",
      "userName": "Amanda Strayer",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJUvh_6ccE0M_8t8ksHjNeO2tV65lwQirgas3l0K0St=mo",
      "date": "2022-04-14T15:32:31.508Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=6767f171-123c-4c5e-84e5-8e303486c55e",
      "title": null,
      "text": "I've filed with TurboTax for years. They're usually great. However, this year, for section 15-20, they removed the option to add additional rows to the same locality. Now they only have an option to Add a Locality. This completely eliminates my ability to file with them. I talked two customer service twice and one of their tax experts. All three times they used screen share and all three times they were shocked that this function (add row) was unavailable. Then had no resolution for me.",
      "replyDate": "2022-04-14T17:12:22.743Z",
      "replyText": "Hi Amanda! We are concerned about your experience with filing your return. We would like to hear about your experience and address any concerns you may have. Please reach out to our support team on Facebook/Twitter at your earliest convenience. We look forward to hearing from you! -April",
      "version": "8.6.1",
      "thumbsUp": 96,
      "criterias": []
    },
    {
      "id": "de27d974-761c-4694-9ba2-32b8db4c00db",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-03-01T04:08:01.720Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=de27d974-761c-4694-9ba2-32b8db4c00db",
      "title": null,
      "text": "I used to absolutely love using Turbo but now it's full of hidden fees and getting harder and harder to navigate. I had a hard time last year but thought I'd give it one more chance but the fees are ridiculous. They charge $40 for State, another $40 for Federal, and now ANOTHER $40 if you want to pay with your return. Turbo used to be the least expensive option and now it's the spendiest.",
      "replyDate": "2020-03-01T15:50:11.251Z",
      "replyText": "Hi there,\nThank you for reaching out to us regarding your concern.  Please know that your charges are based on the package you were recommended to use for your tax needs and any additional services/benefits you may have chosen.  If you wish to reduce some of your fees, please read the following article https://intuit.me/2V6FMcg. \n- Erika",
      "version": "5.6.0",
      "thumbsUp": 27,
      "criterias": []
    },
    {
      "id": "b4733d8e-d490-464a-ac99-c84dc9c31fed",
      "userName": "Jay",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVfvOycJmQoph7JWevN1wzLgVE7qx6YY6ODcYlGp3953Sc",
      "date": "2021-04-25T12:45:56.691Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=b4733d8e-d490-464a-ac99-c84dc9c31fed",
      "title": null,
      "text": "a buggy mess, a struggle to get to sign in every time. tried on multiple browsers, only for it to circle back to the sign in screen after a correct sign in, and the app always fails to connect to the server at sign in. i reset the password even, and its the same result no matter what. it does this every year, and its a struggle to even get assistance from intuit in any way so i can do my taxes. dont waste your time like mine has been",
      "replyDate": "2021-04-25T16:08:17.951Z",
      "replyText": "Hi Jay,\nThank you for letting us know the issues your experiencing when trying to log in. We would like to ask you to fill out this form: https://bit.ly/37k3NBL to report the issue to our developers so they can make sure this situation is corrected. If needed, please reach out to our great support team on Facebook/Twitter, we'd like to help! ~JK",
      "version": "7.5.3",
      "thumbsUp": 55,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "c9d97862-2025-4a69-89a5-23e751a59a27",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-01-31T01:45:36.196Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=c9d97862-2025-4a69-89a5-23e751a59a27",
      "title": null,
      "text": "Terrible. I never had a problem with TurboTax until this year. All of a sudden you have to pay $40 to file your state. I had to pay $40 to claim Student loan interest credit... It wont let me make any changes and wont even let me delete the return and start from scratch. It's very deceptive, sneaky and suspicious. I had no choice but to uninstall the app. Very upset and wont be filing with them this year or probably any other year to come.",
      "replyDate": "2019-01-31T21:08:30.526Z",
      "replyText": "Hi Tish,\n\nWe understand change is sometimes hard, but we have resources to help you understand what these changes mean to you! TurboTax is always up to date with the latest tax laws so that you can file your tax return with complete confidence. \n\n-TurboTax Care Team",
      "version": null,
      "thumbsUp": 24,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_homescreen_widgets",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        }
      ]
    },
    {
      "id": "84465a61-11f5-4f25-a39d-2f96f24612e8",
      "userName": "Raul Torres",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWye9tSigXz-AIi8W4YEx0MsCNavxut0zIHCfgaECnHXuBT",
      "date": "2021-01-11T15:34:23.300Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=84465a61-11f5-4f25-a39d-2f96f24612e8",
      "title": null,
      "text": "Does not load the main/primary tab, the essential tax filing page, app layout and graphical elements look like it could be far better improved, help article links through virtual assistant contain dead links to pages which have been re/moved, basic account linking feature is still in the works and not implemented in any capacity. Truly one of the best examples of an app in alpha development still months away from being ready for any sort of adoption. I'm left scratching my head as to how or why?",
      "replyDate": "2021-01-14T17:54:38.323Z",
      "replyText": "Hi Raul,\nWe want your tax experience with us to be the best you can have. If you're having an app-related issue, an uninstall/reinstall can usually help with these. If you are noticing our articles not working correctly on the app, you can manually go to the TurboTax community and search there! For further help, reach out on Facebook/Twitter.\n-AL",
      "version": null,
      "thumbsUp": 25,
      "criterias": [
        {
          "criteria": "vaf_phase1_getting_credit_scores",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_personal_loans",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 2
        }
      ]
    },
    {
      "id": "19277e70-7ed2-4088-8d40-7658bf0e7b19",
      "userName": "Mark Johnson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIRu_EPJ46g4TTW4b3SjEB-B99h6wTlcbU7pXq6YtTH=mo",
      "date": "2023-04-17T06:04:12.950Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=19277e70-7ed2-4088-8d40-7658bf0e7b19",
      "title": null,
      "text": "I feel tricked into paying $60 for \"turbotax deluxe\" for federal taxes. I could have qualified for a free return, but that option was basically hidden. The constant push to pay more money is also annoying. With that in mind; I'll be looking for a different tax service next year, and recommending that people I know (who file simple returns) do the same. So long turbotax, thanks for screwing me out of $60 that I could really use right now.",
      "replyDate": "2023-04-17T12:19:17.739Z",
      "replyText": "Hello Mark! With TurboTax Free Edition, you can file qualifying simple returns. After answering a few questions, our packages continue up to Self-Employed for those who have specific tax situations. Please send us a private message on your favorite social platform to further discuss your concerns. Thank you for using TurboTax!- Anthony",
      "version": "9.5.0",
      "thumbsUp": 92,
      "criterias": []
    },
    {
      "id": "a31505c1-16bc-4f08-be0c-cd67e9d0ec64",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-02-09T20:20:08.436Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=a31505c1-16bc-4f08-be0c-cd67e9d0ec64",
      "title": null,
      "text": "NOT FREE. USELESS! The app does not let you complete everything unless you agree to the upgrades. I had gone without accepting any upgrades and it added 3 at the end for me right before accepting payment form. I guess im just not a tax person like the commercials say, or they just try to trick ordinary people and charge them in a very sneaky way. Dislike the app 100%. It was but a waste of time.",
      "replyDate": "2020-02-10T21:35:40.515Z",
      "replyText": "Hi Daniel,\nWe respect our customers and would never want them to feel tricked. You may find the following link to understand why you would be charged for the Free Edition: https://intuit.me/3bqUT5L. Your tax situation may have also prompted an upgrade to a higher product. To learn more about upgrades, go here: https://intuit.me/2uqw6OT.\n-Minh",
      "version": "6.2.0",
      "thumbsUp": 104,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        }
      ]
    },
    {
      "id": "1f711558-c202-4638-a146-0f31a5f76448",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-04T09:26:27.816Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=1f711558-c202-4638-a146-0f31a5f76448",
      "title": null,
      "text": "Been using Turbo tax for years. Never having to pay. with all the new commercials about it being COMPLETELY free, i assumed they got rid of fees for upgrades as well. Well when i went to file mine, all my previous info was stored already. but then i noticed as I'm checking out it kept saying i owe 39.99 twice. and wouldn't give me any other options.. then by then end of it all im out 130$ ...im PISSED!!!",
      "replyDate": "2019-02-06T17:20:25.376Z",
      "replyText": "Tax preparation can sometimes be a bit stressful and that's why every year our TurboTax team ensures we're up-to-date with the latest tax laws so that you're confident when filing. We offer different products on different platforms, and because these products have variations, the pricing does as well. – TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 12,
      "criterias": [
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_auto_investing",
          "rating": 3
        }
      ]
    },
    {
      "id": "99402981-7b01-443c-92d9-ef2f2a155eb4",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-02-09T16:58:27.483Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=99402981-7b01-443c-92d9-ef2f2a155eb4",
      "title": null,
      "text": "Hilarious that they claim it's free, even if you don't upgrade the version you use they charge you to efile, If you do upgrade to the deluxe version they charge you for each return. EDIT: I was totally willing to pay $40 for the deluxe version the problem was that the app was not forthcoming about the actual amount I was going to be charged. It wasn't until after I upgraded and opted to have the fees taken out of my refund did it tell me it was charging me $40 for each return and $40 to efile",
      "replyDate": "2019-02-09T16:15:03.382Z",
      "replyText": "We understand how the price may be a concern. Tax preparation can sometimes be stressful and that's why every year our team ensures we're up-to-date with the tax laws so that you're confident when filing. We offer different products on different platforms, and because these products have variations, the pricing does as well. - TurboTax Care Team",
      "version": "5.2.4",
      "thumbsUp": 21,
      "criterias": []
    },
    {
      "id": "5355800d-c611-43e9-ac7b-13eb8f292d56",
      "userName": "Sun",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUqzk5Jk7rjhwXEd8my_79w99ZF_s3gE6BJlGI9QrRlDw",
      "date": "2023-04-18T22:50:48.569Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=5355800d-c611-43e9-ac7b-13eb8f292d56",
      "title": null,
      "text": "Wow. Talk about a price change rip off. I'm doing all the work plus I ended up paying $160 plus and additional $$ at the end for the convenience of Turbo Tax taking thier cut from my return. And then they want me to upgrade several times throughout my form. I was satisfied with Turbo Tax the previous 5 years I had it. But now this is my last time using it. Might as well pay someone that amount to do it all for me.",
      "replyDate": "2023-04-18T23:01:41.572Z",
      "replyText": "Hi Sun, we certainly appreciate your concerns regarding the fees. We would be happy to look into it for you. So that we may best assist you, please reach out to us privately on Facebook or Twitter. Thank you for choosing TurboTax! - David",
      "version": "9.5.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "97a83a1a-61e7-40a4-a697-9c081012558d",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-01-25T19:30:24.470Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=97a83a1a-61e7-40a4-a697-9c081012558d",
      "title": null,
      "text": "This is my 9th year using it.  The product is extremely simple to use.  That said, recent years the fees are getting increasingly sneaky.  Last year I paid $40 to file both my State and Federal while selecting the Deluxe version. This year for the same option, they charged me $70 ($40 state $30 federal with a discount code). An additional $40 for paying from my refund which used to be free and was not stated as \"additional\". I will be considering another platforms next year.",
      "replyDate": null,
      "replyText": null,
      "version": "6.2.0",
      "thumbsUp": 299,
      "criterias": []
    },
    {
      "id": "ef4b8133-82a0-4074-85b7-d097b9527536",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-03-13T23:24:56.104Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=ef4b8133-82a0-4074-85b7-d097b9527536",
      "title": null,
      "text": "my issue is that it guides you to pay for the (free) return that it advertises. It went from free to $139.00 and I had to start over to change to free again. also the mobile app doesn't allow you to start over. i had to get on my tablet to be offeted that option. This will be my last year using turbo tax. The hidden choices and lack of transparency is diturbing to me. If you offer free then i shouldnt have to navigate a bombardment of asking the same question over and over again.",
      "replyDate": "2019-03-14T22:24:49.934Z",
      "replyText": "Hi there,\n\nWe hear your concerns. We're here so you can file with an extra level of confidence and to make sure you make the most out of your investment. TurboTax Free Edition is for taxpayers with a simple tax return, that file only the new 1040 form. Feel free to contact TurboTax Support on Facebook or Twitter - TurboTax Care Team",
      "version": "5.4.0",
      "thumbsUp": 25,
      "criterias": []
    },
    {
      "id": "d0ff6254-b159-47ba-98c9-532ce0fe702c",
      "userName": "Karina",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUQ136tRIIsdDTAcCxN0C-nPu52_K1gkeNu8jJ9F97KvZRy",
      "date": "2022-03-13T21:23:40.950Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d0ff6254-b159-47ba-98c9-532ce0fe702c",
      "title": null,
      "text": "TurboTax is a wonderful app that makes filing taxes simple, even as a first-timer. That said... don't use it. As much as it advertises the ability to file for free, you'll likely still have to pay since they're no longer with IRS Free File. Then at the VERY end, just as I'm about to file, I'm prompted to pay $119 to upgrade, because I am claiming one specific credit. It couldn't have prompted me WHILE I worked on it? Plain manipulative. I'd rather do it all again elsewhere & keep my money.",
      "replyDate": "2022-03-14T17:32:14.744Z",
      "replyText": "Hai Karina, we understand your concern about being asked to upgrade from Turbotax free edition to a paid edition. TurboTax Free Edition is available for the preparation of Simple Tax Returns. For more information on how our products are priced and why you may be upgraded to a paid version, check out this link: https://intuit.me/3dDSUgL. -Vanessa",
      "version": "8.4.1",
      "thumbsUp": 476,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_auto_insurance",
          "rating": 2
        }
      ]
    },
    {
      "id": "0c147447-2304-4a1a-8a62-b5631af4998d",
      "userName": "Vallarie Grassel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV_M52hcO5bMHomRn2GDQZMRZpXAOmPXQEcxDneeeodUa4",
      "date": "2024-03-07T23:11:26.919Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=0c147447-2304-4a1a-8a62-b5631af4998d",
      "title": null,
      "text": "i agree with another customer on my tablet the app wont let me flip the screen,makes it kinda hard to do ur taxes long ways. really should fix that. also i dont know why, but my screen keeps going blank on my tablet. when i try to review it loads a blank screen. ive been using t.t. for many yrs and ive never had so many problems as i did this year, in fact ive never had any problems. If it doesnt change i WILL NOT be using turbo tax ever again. really disappointed.",
      "replyDate": "2024-03-07T23:19:07.127Z",
      "replyText": "Hello there Vallarie, thank you for reaching out to TurboTax. We are disheartened to hear you had a negative experience this year, as this is never how we want our customers to feel. Please feel free to reach out to us directly on X, Instagram, or Facebook and we will be happy to help! - Madison",
      "version": "10.6.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "801554ad-21a7-43b6-982f-3a222cf1f599",
      "userName": "Marc Holtzman",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL9CZmMpfwIRuPRNdTba7oi7KznE40EkaQo7vFqEz46=mo",
      "date": "2024-03-04T21:44:23.678Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=801554ad-21a7-43b6-982f-3a222cf1f599",
      "title": null,
      "text": "Horrible app, irs rejected the return due to no putting my spouses pin. The app will not allow me to add it. Spent the $29 on support and can't get an answer. I was able to fix the problem by logging on to my laptop. Still no thanks to any customer support. Save the $29 it's a waste. I agree with other reviews, last year was so much easier.",
      "replyDate": "2024-03-04T21:50:38.344Z",
      "replyText": "Hello there, thank you for reaching out to TurboTax. We are disheartened to hear you had a negative experience this year, as this is never how we want our customers to feel. Please feel free to reach out to us directly on X, Instagram, or Facebook and we will be happy to address any questions or concerns you have! - Madison",
      "version": "10.5.1",
      "thumbsUp": 42,
      "criterias": []
    },
    {
      "id": "9f71b77f-915e-43f1-9ff4-6bc8e4840ccf",
      "userName": "Eli B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVgn9GNDqEd4LXa_v7hgb93RAVIvr1DPkprsFHopvvoumo",
      "date": "2024-03-12T01:09:54.897Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=9f71b77f-915e-43f1-9ff4-6bc8e4840ccf",
      "title": null,
      "text": "I have been with TurboTax a few years and this year I have to pay $1500.00 to have alleviate tax specialist fix the last 3 years and also fix an issue with 2018 taxes because TurboTax does not help at all no matter if you got the deluxe package or not. I don't suggest using turbotax, they have gotten real bad! To the response from turbo tax.... I have also been unable to get 2022 done because I got a form from a credit card and no place to put anything so I can't include assets don't exceed debt",
      "replyDate": "2024-03-12T01:20:57.678Z",
      "replyText": "Hello Eli, Thanks for the review. We are saddened to hear about this experience. Please feel free to contact us on our social media platforms on Instagram, X, or Facebook and we will be more than happy to assist you!\n\n-Mari",
      "version": "10.6.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "79d27631-3108-41e5-99d8-f29165e35edc",
      "userName": "Jeremy A Neevel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXnbahPU88qkopTpgnRnc-1qKnMLJz7M2IA8aXKIK-43WBo",
      "date": "2024-03-08T23:10:26.101Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=79d27631-3108-41e5-99d8-f29165e35edc",
      "title": null,
      "text": "This is by far the worst experience I've had with TurboTax and I've used them for the last few years. I had my federal and state rejected due to a dependent listed when they were being claimed by the other party and won't let me change my information so I can re-file! You are about to lose a loyal customer TurboTax!!",
      "replyDate": "2024-03-08T23:19:19.449Z",
      "replyText": "Hello there, thank you for reaching out to TurboTax. We are disheartened to hear you had a negative experience this year, as this is never how we want our customers to feel. Please feel free to reach out to us directly on X, Instagram, or Facebook and we will be happy to help you in fixing your return! - Madison",
      "version": "10.6.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "961763fc-7fda-48be-839a-81f16d12d132",
      "userName": "First on Racing day",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKk0MVRmuuFuCvl-m4ThC3_f1xAj2IAos0mFfyP3fft=mo",
      "date": "2024-03-06T03:27:15.941Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=961763fc-7fda-48be-839a-81f16d12d132",
      "title": null,
      "text": "Extremely high fees. Every year, the price of the service increases. The last two years. I've invested money. Trying to collect divided and was charged 189$ by turbo tax for reporting. That's more than the money I made from divideds and my savings account. And was forced to use a higher priced turbo tax because of it. All that investing is pointless. When tax companies just steal it. It's bad enough that the government steals your money. Now turbo tax is going to now. I remember when it was $20",
      "replyDate": null,
      "replyText": null,
      "version": "10.5.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "d4bf7b75-b3f2-4d1d-bff5-0810a558d679",
      "userName": "Krypto graphy",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJP9xisA02VhhJ4LYOFrvl46rjo92Bp0DsJ1B_xXSzx=mo",
      "date": "2024-03-08T04:19:57.342Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d4bf7b75-b3f2-4d1d-bff5-0810a558d679",
      "title": null,
      "text": "App no longer works. Period. Uninstalled and reinstalled as suggested, still Can't continue or sign in. Tried a reset. Didn't work. Tried on another device: didn't work. Been a customer for 7 years, and have paid premium regularly, and now I guess I'll have to choose another option. Not sure who yall hired to \"revamp\" your application but they need to be fired and as a company you all should be embarrassed that my 7 year old can make an application better than your whole team can.TOTAL joke",
      "replyDate": "2024-03-08T04:33:51.767Z",
      "replyText": "Hi there! We appreciate you taking the time to leave us a review. We are saddened to hear about your difficulties trying to log into your account, as this is never our intention for any of our valued customers. Please reach out to us on FB, X, or IG and we'd be happy to assist you with logging into your TurboTax account.\n\n- CC",
      "version": "10.6.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "6ba88ef3-76f4-4f82-8294-9bcb03566aae",
      "userName": "Daniel E. Baker",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW43G2SsJXWpg7HjQ9e-fY1rAg0CLAd_9y8GTLcJ94t6A",
      "date": "2024-02-28T18:08:15.548Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=6ba88ef3-76f4-4f82-8294-9bcb03566aae",
      "title": null,
      "text": "It's false advertising, it isn't free. It will for e you to pay a 40-120+ dollar fee that you won't know about until it's taken out of your refund.. they will try to convince you when you contact them you bought a deluxe. Version of turbo tax and they added fees... If you can negotiate a refund of the stolen funds you are told it will take 4-8 weeks to return what they took in seconds... Watch your returns and hold them accountable.",
      "replyDate": "2024-02-28T18:39:46.267Z",
      "replyText": "Hi Daniel. We appreciate your feedback! Around 37% of customers qualify for our Free Edition. Yes, due to your upgrade to file your tax return properly you will have to pay to file. The fee is displayed before you file. You do not have to choose this option. For help, come to Facebook, Instagram or X. Charged fee:https://intuit.me/3FtkIA4 -Darling",
      "version": "10.5.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "180fbc5f-0749-4fcf-8a08-3f5671d3c2e0",
      "userName": "B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXUtdtrVaWqHaR3LjnU4-HQXHkWeq1Wb03ON9JcEks8dhOq",
      "date": "2024-02-25T12:48:12.797Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=180fbc5f-0749-4fcf-8a08-3f5671d3c2e0",
      "title": null,
      "text": "Absolutely love this app! I've been using it for about 8 years and it gets better every year. I only gave 4 stars because it seems like they raised their prices and charges me for something I didn't want. I can't figure out how to get it off. Still tho I think this is the easiest way for a person to do their taxes without H&R block taking your whole refund!!!",
      "replyDate": "2024-02-25T16:12:24.225Z",
      "replyText": "Hey, there! Thank you for your feedback on TurboTax we are glad to hear you are pleased with your experience with us. For any support or assistance regarding the matter, please send us a private message on one of our Facebook, Instagram, or X (Twitter) pages. We would be glad to help!\n\n-Joell",
      "version": "10.5.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "93c88a53-aafa-4077-9283-0b16d78d6b09",
      "userName": "Blayde Kuesel (Queso)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUleBZW3ZSKYES1fCNkdcXg9Nma-Drebk_VNowO_BZkByI",
      "date": "2024-03-12T21:07:12.690Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=93c88a53-aafa-4077-9283-0b16d78d6b09",
      "title": null,
      "text": "Never ever using this service again. Do not be fooled by their false and misleading advertising. They claim to be a free service but it is a scam. Only had 2 W2s and no other documents, yet they proceeded to forcibly upgrade me to the premium option from the free one sequentially charging me 60 dollars for state and 60 dollars for federal on top of adding a 40 dollar service charge just for choosing direct deposit over their Credit Karma bank account. I WOULD ADVISE NEVER USING THIS SERVICE!!!!!",
      "replyDate": "2024-03-12T21:08:46.710Z",
      "replyText": "Hi there! You can file with TurboTax Free Edition if you have a simple tax return; Form 1040 only. Here are a few reasons you may be asked to upgrade: http://intuit.me/3QtyGJp\n\nTo have me look further into your account, or for more information please send us a direct message on X, Facebook, or Instagram! - Madison",
      "version": "10.6.0",
      "thumbsUp": 61,
      "criterias": []
    },
    {
      "id": "c8c40c6e-29cd-4c71-9d53-4745765e94b2",
      "userName": "Matthew Fragoso",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI314YuhllkyBQBicQu4zZVCA6MFZ4mBrv7zD0Pr6FN=mo",
      "date": "2024-02-23T05:11:02.460Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=c8c40c6e-29cd-4c71-9d53-4745765e94b2",
      "title": null,
      "text": "Fees for the service are way to high. Once finished you get a payment error if you try to pay by credit card, forcing you to pay with your refund which changes you additional processing fees. Also, you can't get ahold of customer service, AI never knows what you are asking by the time you figure out and get to call a number or talk to a person the office is closed. The how to select customer service tells you the same thing over and over to select the contact us button that doesn't exist.",
      "replyDate": "2024-02-23T13:53:11.465Z",
      "replyText": "Hi Mathew! TurboTax Free Edition can file qualifying simple returns. After answering some filing questions, our packages continue up to Self-Employed for those with specific tax situations. Please send us a private message on your favorite social platforms like Facebook, X, or Instagram to further review your upgrade or payment. Thank you! -Anthony",
      "version": "10.5.1",
      "thumbsUp": 31,
      "criterias": []
    },
    {
      "id": "d45dd943-f418-42ef-9e10-e6a215f24270",
      "userName": "Cora Mae",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVJWQJr388tSrPoKJbt73DdT4pFD0cKpvn3oHBZ43KNmns",
      "date": "2024-03-02T00:08:07.536Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=d45dd943-f418-42ef-9e10-e6a215f24270",
      "title": null,
      "text": "This will be my last year ever using TurboTax!!!! I knew better than to use it this year, I even tried deleting my tax forms and it won't let you once you start, so I really had no choice, so this is the second year, that I'm not getting two parts that normally, I get, and even talked to support, she said sorry you can't delete once you start, took them to another place just to see, guess what I was Intitiled to these, so after this! Update; 3rd year, state has held my taxes because of TurboTax!",
      "replyDate": "2024-03-02T00:24:40.251Z",
      "replyText": "Hi Cora, thanks for the review. We are sorry to hear that you are having difficulties deleting your tax return. We would love the opportunity to assist you with this matter and resolve it as soon as possible. Please get in touch with us through Facebook, Instagram, or X for further assistance.\n- Tamara",
      "version": "10.5.1",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "b4ed7c7b-dfe1-44bf-a4e3-51389b21a113",
      "userName": "Zackery Bartlett",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLKwdj6fOB7aB8bnEDTLGLvYPGTaKTVwFbiY6Qzhq6E=mo",
      "date": "2024-02-28T03:37:56.266Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.intuit.turbotax.mobile&reviewId=b4ed7c7b-dfe1-44bf-a4e3-51389b21a113",
      "title": null,
      "text": "This year I had to click on deluxe or else the app wouldn't let me proceed with filing. I was charged an extra 40$ just for filing my state taxes and then an additional 40$ for a processing fee. None of the assistance helps in any way and theirs no way to get those charges off even if you don't use them. So yeah you're better off going somewhere else. It's costing me 118$ and theirs no way for me to get any of it back lol.",
      "replyDate": "2024-02-28T04:07:26.750Z",
      "replyText": "Hello Zackery, thank you for leaving a review. We are saddened to hear about your experience. If you select Pay with My Refund, a $40 processing fee is charged by the third-party bank that handles the transaction. If you have any questions or concerns, please contact us Via our socials: Facebook, X (formally known as Twitter), or Instagram. -Alana",
      "version": "10.5.1",
      "thumbsUp": 0,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CnIKcDAsMTAwMDAwMC42OTU2MjM4NzQ3LDU1ODM3MTQ2MjMzNiwiaHR0cDovL21hcmtldC5hbmRyb2lkLmNvbS9kZXRhaWxzP2lkPXYyOmNvbS5pbnR1aXQudHVyYm90YXgubW9iaWxlOjEiLDIsZmFsc2U"
}