{
  "data": [
    {
      "id": "61c10151-fccc-464a-93bd-bbd382738bba",
      "userName": "Taylor “Marine”",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU5uvRqhsljZ6K73rJkqa_oyoCAjZ5Y9L8Y3KQtLgJ9HPU",
      "date": "2024-03-14T15:50:57.811Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=61c10151-fccc-464a-93bd-bbd382738bba",
      "title": null,
      "text": "app is still a bit difficult to navigate, I was attempting to make a purchase on the app. I had items in my cart for purchase. So then I apparently opened up Walmart online through my browser. I was switching back and forth from the app and the site and had two different cart contents. I almost paid for the wrong cart, glad I didn't but still, there should be a way to link your accounts, through the app and the site as long as you are signed in to your profile... Just saying",
      "replyDate": "2024-03-13T18:38:09.968Z",
      "replyText": "Thanks for sharing your experience with us. We understand you had an issue with the Walmart app. Please contact us at https://survey.walmart.com/app. Thank you.",
      "version": "24.10.1",
      "thumbsUp": 49,
      "criterias": []
    },
    {
      "id": "0644ee96-4e6e-43fd-9f3b-c223bf1e0d78",
      "userName": "lindy raquel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXwYf_uR_s-t-85UixdzdaD0DvQyny6DApnKURAt-T4LQ",
      "date": "2024-03-06T00:43:56.439Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=0644ee96-4e6e-43fd-9f3b-c223bf1e0d78",
      "title": null,
      "text": "The Wal-Mart app is good for the most part, but one bug that I found is when I try to select substitutions. When I search for a similar item it kicks me out of the substitute section, and I have to start over. I noticed it does that even after I hit the select button for a substitution. I had to select the done button after each item or it wouldn't save. Also, when selecting substitutions, it doesn't show all available options for a product that I just saw when I was adding items to my cart.",
      "replyDate": "2024-03-06T01:13:51.900Z",
      "replyText": "We'd like to assist you further. Kindly contact us at https://survey.walmart.com/app if you're facing any issue with the Walmart app.",
      "version": "24.8",
      "thumbsUp": 378,
      "criterias": []
    },
    {
      "id": "f92567c7-c329-48c5-8ae1-768d18982e26",
      "userName": "Keith Culbertson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVgmyl5mZwjVHn1fy1w3CPBUpBvEjXchGUvOAzMMP4_hWI",
      "date": "2024-03-02T20:36:00.278Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=f92567c7-c329-48c5-8ae1-768d18982e26",
      "title": null,
      "text": "Very cumbersome. Also very easy to get ripped off. Items I have purchased are kept in a list with a little blue reminder of how many times I have purchased this item. However it can easily change from the one delivered for $2 to one shipped from XYZ Co for $27.50. There are several settings that should be part of the profile. For instance if I don't want substitutions I don't want to tell you each time,if I went thru the process of setting up the round up again I don't want to tell you each time",
      "replyDate": "2024-03-02T21:14:37.729Z",
      "replyText": "Thanks for sharing your experience with us. We totally understand your concern. The pricing depends upon a lot of factors like distance, weight and availability. For further details, please contact us at: walmart.com/help",
      "version": "24.8",
      "thumbsUp": 49,
      "criterias": []
    },
    {
      "id": "40a55d19-e4ad-47f2-858a-53654a68dce0",
      "userName": "Daniel P",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXSNNYSv7BHFeVImEI--ZBQlnHbS1WS-3kTrjmS32HFsw",
      "date": "2024-03-05T18:26:47.905Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=40a55d19-e4ad-47f2-858a-53654a68dce0",
      "title": null,
      "text": "I always compare prices from Amazon and Walmart. Walmart is becoming more and more competitive every time. If the prices are the same, I ALWAYS purchase from Walmart because I hate Amazon and would love to never use it again. The cost savings of using it almost make life without it impossible due to limited income. Walmart's app is becoming easier and easier to use and had very nice features, like add multiple to the cart with a single tap. Keep it up Walmart!",
      "replyDate": null,
      "replyText": null,
      "version": "24.8",
      "thumbsUp": 354,
      "criterias": []
    },
    {
      "id": "622469f9-5daf-4880-b61d-8f3d8afe62e1",
      "userName": "Timothy Robbins",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJVIYeDVoQ1mabXhwPZ4Z89KgSJXiqxwYDShQ4bvoYX=mo",
      "date": "2024-03-02T15:16:42.770Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=622469f9-5daf-4880-b61d-8f3d8afe62e1",
      "title": null,
      "text": "Terrible! Terrible! Terrible! This is the second month in a row the app has glitched out this time costing me $188.31. It goes to blank screen and you think that the oder wasn't placed; it doesn't show up in your shopping cart. So When I added it to another order it show up in the original order. Canceled immediately and they shipped it anyway even though their representative said it was taken care of. Ended up with two of the same order.",
      "replyDate": "2024-03-02T15:46:10.264Z",
      "replyText": "We hear you loud and clear! Your words is crucial in helping us iron out these glitches. Here’s to a smoother, glitch-free Walmart experience in the future. Please contact us at https://survey.walmart.com/app",
      "version": "24.8",
      "thumbsUp": 187,
      "criterias": []
    },
    {
      "id": "4cb3e836-70a1-4e41-81b7-7424044d6d36",
      "userName": "Desert Sky",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUDwGN2jT9NHIIwsSkdRq1N4989GWn1cPfW09NJ4rR-Cz0",
      "date": "2024-03-11T16:08:54.648Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4cb3e836-70a1-4e41-81b7-7424044d6d36",
      "title": null,
      "text": "I value the app. Some functions are lacking. The sort by price only somewhat sorts so I feel I need to check the entire list to make sure I am getting the lowest price. The pricing also bizarre. You will have an item priced for $15 and the exact same item listed for $35 with neither item on sale. I can't seem to easily move saved favorites to different lists and recently the option to select alternatives at checkout isn't available. Thank you",
      "replyDate": "2024-03-11T16:21:54.460Z",
      "replyText": "We regret to hear about the issues you’ve encountered. Your words is crucial for us to improve. We’re committed to making your Walmart app experience better. Please contact us at https://survey.walmart.com/app",
      "version": "24.8",
      "thumbsUp": 8,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "1c181466-895a-4791-b8c1-61a7f1eae6f8",
      "userName": "Darren Hildebrand",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLYc2gNeiqqNaptWKH8G6BPJu--1rnqbgqCEpBtofT7=mo",
      "date": "2024-03-08T02:05:32.168Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=1c181466-895a-4791-b8c1-61a7f1eae6f8",
      "title": null,
      "text": "Deceptive pricing for delivery. Free until checkout while I was shopping, then at CHECKOUT split into 2 orders - 1 shipped (free) and 1 \"delivery from store\" for a $9.95 fee. Nothing I bought was time-sensitive so I was fine with shipping for free, but that option disappeared. Canceled items and bought from Amazon and Target instead because both have a very straightforward checkout system. Pricing is usually fine at WM, but their checkout process is way too hosed up to be worth the effort.",
      "replyDate": "2024-03-08T02:31:47.821Z",
      "replyText": "We regret the confusion over delivery pricing. Your words is crucial for us to enhance transparency in our checkout process. Please contact us at walmart.com/help",
      "version": "24.8",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "50c82431-92a8-4ef6-a4b3-fac83e2644de",
      "userName": "Tara A",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVHg0MEdTDa-QEx_LW-3wmVc7zwM0TzmT2Id8R-f2-SKK0",
      "date": "2024-03-14T13:59:44.302Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=50c82431-92a8-4ef6-a4b3-fac83e2644de",
      "title": null,
      "text": "I always shop for my groceries on this app because I have agoraphobia, so going to public places causes so much anxiety that I can't concentrate. I have one problem with the app. The main page keeps popping up every few seconds. This makes it difficult and frustrating while trying to focus on what I want to order. Walmart, can you fix this bug? I don't want the main page to pop up unless I actually click on it.",
      "replyDate": "2024-03-14T14:54:09.784Z",
      "replyText": "We’re glad our app is a helpful shopping tool for you! We understand your issue with the main page issue and appreciate you bringing it to our attention. We’re always striving to improve. Please contact us at https://survey.walmart.com/app",
      "version": "24.9.1",
      "thumbsUp": 1,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        }
      ]
    },
    {
      "id": "65a24d3a-2521-452d-956d-e3c14c07b5c4",
      "userName": "Mandy Perricone",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUAqJT1eR7KGjVVa6rLJmF5d8amAf7BuSS1GvSkeV1JfA",
      "date": "2024-03-15T14:19:31.319Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=65a24d3a-2521-452d-956d-e3c14c07b5c4",
      "title": null,
      "text": "My only complaint is that my favorite ice cream (Ritchey's) is only offered as one choice; there's no way to choose a flavor. You have to just order it and see what you get :( It's also not possible to add a tip if you're paying for the entire order via EBT and/or gift card. You have to select \"I'll sign for my order\" and tip with cash. Otherwise I love it, and those are only minor annoyances.",
      "replyDate": "2024-03-15T14:30:20.890Z",
      "replyText": "We appreciate your words on the ice cream flavor selection and the tipping process. We’re always working to improve our services based on customer experiences like yours. Please contact us at https://survey.walmart.com/app",
      "version": "24.9.1",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "59d72e1c-03a0-4719-b8be-1689312d4b75",
      "userName": "Matthew Harrison",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK5OsDtfoF525Gcj-X2Lj4K1JwVfvOAyNEhEN1valLD=mo",
      "date": "2024-02-25T06:07:31.932Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=59d72e1c-03a0-4719-b8be-1689312d4b75",
      "title": null,
      "text": "App's ability - probably 3 stars. Schedule service, in store inventory (meh), scan UPC. App's usability - 0. If I search for a battery for my lawnmower, I don't want you to tell me there are no results that fit my car. I want you to remove the car when I select that option, so I can see those results. If I search for a U1 battery. Showing me the U1P and U1R (not shown) are likely relevant results. The myriad power sports batteries (shown) are not. It's an app that tries to run but can't walk.",
      "replyDate": "2024-02-25T07:23:58.700Z",
      "replyText": "Thanks for sharing your experience with us. We regret you’ve had issues with the application feature. Please contact us at walmart.com/help.",
      "version": "24.7",
      "thumbsUp": 198,
      "criterias": []
    },
    {
      "id": "43d48943-855b-41e8-8cb8-bbaa608392c3",
      "userName": "Ozcyr Aguilar",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUnbJAnvb5M5qSGv2Axr_V-OiAkiP5XgxHSk5_9ouSkk5c",
      "date": "2024-03-16T06:27:10.888Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=43d48943-855b-41e8-8cb8-bbaa608392c3",
      "title": null,
      "text": "The Walmart app is a convenient way to shop for groceries, household essentials, and more. It offers features like in-store pickup, delivery, and mobile checkout to save you time. You can browse products, check prices, and even build shopping lists with the barcode scanner. While there can be occasional glitches with substitutions, the overall functionality and savings potential make this app a worthwhile download for Walmart shoppers.",
      "replyDate": "2024-03-16T06:37:17.615Z",
      "replyText": "We're glad to know that you find the app's functionality and savings potential worthwhile. Thank you for choosing Walmart.",
      "version": "24.9.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "807b4be8-dab7-4b37-8366-56f083856f19",
      "userName": "zoo refugee",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLpsCauaMMXCW9vvvpZx52GWFkPrAm0WNn5vrp3Q2D9=mo",
      "date": "2024-02-23T18:03:31.840Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=807b4be8-dab7-4b37-8366-56f083856f19",
      "title": null,
      "text": "Just commenting on the app in this quick review, not any specific Walmart store! Overall the app is fairly well designed, and definitely easy to use. It's so easy to pick out what you want and place an order. The order tracking works well too! Also, the few times I've needed to talk to someone re: app/order issues, they're typically very good at fixing any issues I have, and usually find a way to make up for it in a little way. I usually don't rate 5*, but they deserve a solid 4 1/2*!",
      "replyDate": "2024-02-23T18:27:43.610Z",
      "replyText": "Thanks for sharing your thoughts on the Walmart app! It's great to hear you find it easy to use and that it's been helpful for your shopping needs. The fact that the customer service team has been responsive and accommodating when you've had issues is definitely a plus. Your 4 1/2 star rating speaks volumes about your positive experience.",
      "version": "24.7",
      "thumbsUp": 210,
      "criterias": []
    },
    {
      "id": "271de53b-08c7-4c4d-998f-8908eadd8e3a",
      "userName": "Brenda Reed",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKegchqnUQBOsytDuCsvKL5D40tl_YdN5QVhfB4vFUV=mo",
      "date": "2024-03-14T19:23:46.352Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=271de53b-08c7-4c4d-998f-8908eadd8e3a",
      "title": null,
      "text": "Sometimes it's great, but sometimes not. Lately it want let me add my new debit card, I have checked and double checked that it was entered correctly, but it still gives me an error message that doesn't let me save the card. Just recently I wasn't able to add my substitution on my delivery orders. As well as so many things showing out of stock or its not showing everything available in store.",
      "replyDate": "2024-03-14T19:47:49.649Z",
      "replyText": "Thank you for your concern about the issues you're facing, Brenda. We're happy to assist you even more. Please contact us at walmart.com/help for further guidance.",
      "version": "24.9.1",
      "thumbsUp": 1,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        }
      ]
    },
    {
      "id": "01013db5-2bcf-4086-9459-fb6e6ecffb6e",
      "userName": "Russell Easters",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXbNCCZIznjjC2RwHbHsLT6-X6QBMtjGvlJsfPj2e0Oug",
      "date": "2024-03-10T15:39:17.838Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=01013db5-2bcf-4086-9459-fb6e6ecffb6e",
      "title": null,
      "text": "Scam alert! Be very careful with misleading pricing. I pay for Walmart+ which gives me free shipping. Every time I place an order lately I'm always missing an item or two. Then you go in and amazingly enough it's available. So you put in that couple of items that were missing. Now, they either get you to increase your order to a $35.00 minimum to get what \"they\" missed, or they charge you a $6.99 delivery fee for getting your missing items out to you. Does this sound like a SCAM to anyone else",
      "replyDate": "2024-03-10T19:13:07.986Z",
      "replyText": "We'd certainly like to look further into the issue you mentioned. Please connect with us at https://www.walmart.com/help",
      "version": "24.9.1",
      "thumbsUp": 270,
      "criterias": []
    },
    {
      "id": "28b5421e-1e9a-4027-9ea0-fd39713b2005",
      "userName": "Alvin Alves",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLeyJKdzcLQzsjtJo4-e8C2lRX1bPcpJYol91o19qHz=mo",
      "date": "2024-03-02T10:46:31.600Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=28b5421e-1e9a-4027-9ea0-fd39713b2005",
      "title": null,
      "text": "It's a well-designed app. It's easy to use for product searches and reviews, to tell you if a product is available in the store or nearby, to view past purchases and initiate returns, for Rx reminders and curbside pickup. The Walmart app spams your phone with annoying promotional notifications. What's the point of promotions at Walmart since everything has the same everyday low price? But it's easy enough to disable the marketing notifications category and still get all other notifications.",
      "replyDate": "2024-03-02T11:05:59.367Z",
      "replyText": "Great to know you enjoy our app’s versatility! Your feedback on notifications is noted. Enjoy your Walmart shopping experience! 😊",
      "version": "24.8",
      "thumbsUp": 115,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 3
        }
      ]
    },
    {
      "id": "8ddf7ffe-6a15-423c-a94e-c7d55e582a43",
      "userName": "CDL",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVWLAFREILwmmpr86XfNXce6g6haASWT_xp6xikOS40Bg",
      "date": "2024-03-13T14:14:38.240Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8ddf7ffe-6a15-423c-a94e-c7d55e582a43",
      "title": null,
      "text": "Walmart+ is convenient, but I've had a couple of issues receiving products, they drop off at the wrong home, and when I chose the option to sign for my groceries, they leave sitting at the door anyway. That there is inconvenient, I would rather tip for my delivery in person. It doesn't make sense to tip before receiving merchandise.",
      "replyDate": "2024-03-13T14:33:44.711Z",
      "replyText": "We regret to hear about the delivery hiccups. Your words are crucial for us to refine our service. We appreciate your patience and are committed to making your Walmart+ experience better. Please contact us at walmart.com/help",
      "version": "24.9.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "846e07db-19cc-4d7a-bef7-c1f0afda0d85",
      "userName": "Melissa Lambert",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWta3MqQT6_PseDxfxeroWiihnExkwiorS96Euet-s6EBI",
      "date": "2024-03-08T01:20:07.647Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=846e07db-19cc-4d7a-bef7-c1f0afda0d85",
      "title": null,
      "text": "The app was fine before, but now suddenly the search bar was relocated from the top to the bottom of the screen? I keep accidentally clicking where the old search bar used to be, and accidentally opening the \"address preference\" box which is now in its place. The search bar really did not need relocating, it only makes the app more frustrating to use.",
      "replyDate": "2024-03-08T02:28:04.583Z",
      "replyText": "We regret to hear about the inconvenience caused by the app changes. Your feedback is crucial for us to enhance your shopping experience. Please contact us at https://survey.walmart.com/app",
      "version": "24.9.1",
      "thumbsUp": 138,
      "criterias": []
    },
    {
      "id": "f38d40af-8857-4d6b-a43b-0fe035003c1b",
      "userName": "S Dennis",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVCeBInkBABQZ-vCTEd95-8RlJwCmS_rR37zdYxB76xSeE",
      "date": "2024-03-18T01:34:46.384Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=f38d40af-8857-4d6b-a43b-0fe035003c1b",
      "title": null,
      "text": "I enjoy that I have access to my receipts via this app and I can pay via this app. However, I don't like when requesting a refund for items not delivered. The app is self marking item the customer did receive and unmarking the item the customer didn't receive. The customer shouldn't have to keep going up and down the list 4 or 5 times to make sure only the correct items have been chosen before hitting the submit button. This could cost walmart and the consumer big losses. Please fix it. Thx",
      "replyDate": "2024-03-18T04:20:27.700Z",
      "replyText": "We greatly appreciate you bringing this to our attention. Please tell us more details about the issue you mentioned with our app at https://survey.walmart.com/app",
      "version": "24.9.1",
      "thumbsUp": 4,
      "criterias": [
        {
          "criteria": "vaf_phase1_search",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_wishlists",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_good_coupons",
          "rating": 2
        }
      ]
    },
    {
      "id": "4f2dd2db-13b4-4282-993c-f4ece9d17bd3",
      "userName": "F D",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXtcsxo8g2rCeb7DrIaBBeynpiyTsKn26Z6WwPT1REa1OhU",
      "date": "2024-03-03T22:22:08.192Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4f2dd2db-13b4-4282-993c-f4ece9d17bd3",
      "title": null,
      "text": "I just spent literally 5 minutes, clicked the link from search to selected Walmart item, and 5 minutes later it'll be at my home in 3 hours. At times the app can be tedious, basically with extra taps that don't seem needed. searching, backing out from certain places, otherwise good app. understandable that they will all to view other items in your way to checkout. Those extra taps I understand. Again overall a good experience.",
      "replyDate": null,
      "replyText": null,
      "version": "24.8",
      "thumbsUp": 81,
      "criterias": []
    },
    {
      "id": "e074dc33-a779-421d-af54-24fafa83a0e3",
      "userName": "Krystal Patterson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUeU9R8Wtt7zJrvovdF-QsbKAxjuIht6p5QgYwLGRtjb_P4",
      "date": "2024-02-26T13:20:51.140Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=e074dc33-a779-421d-af54-24fafa83a0e3",
      "title": null,
      "text": "Great App! Super functional and I've had no issues. The only thing that I wish would change is being able to make multiple payments via Walmart Pay, like a gift card and debit card. Other than that, this app is one of the best! **Update** - not being able to use multiple payments for Walmart Pay might have just been a glitch when I tried it. I used 2 gift cards to purchase some items via Walmart Pay and it worked perfectly fine! 5 stars!",
      "replyDate": "2024-02-16T16:56:12.609Z",
      "replyText": "Thank you for your awesome review! We’re thrilled to hear that you love our app and find it super functional. We appreciate your words on Walmart Pay. Please contact us at https://survey.walmart.com/app",
      "version": "24.7",
      "thumbsUp": 56,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        }
      ]
    },
    {
      "id": "fffe7589-ca04-454b-82b0-7827f28889f5",
      "userName": "Kassie Stencel",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLX0dX2yvj8q6PF_I_gH5vFbtjUNCwrILBhbkHevmkZ=mo",
      "date": "2024-02-29T23:00:57.980Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=fffe7589-ca04-454b-82b0-7827f28889f5",
      "title": null,
      "text": "Everything has been really great with the app. Customer service has been amazing too. The only complaint I have is, my apartment isn't the easiest to locate and so I will use the chat with the driver option to give them the right directions to my place. The drivers rarely ever look and they spend way more time looking for my apartment then they do actually shopping for my stuff lol. Walmart can't really do anything about that, though ☺",
      "replyDate": null,
      "replyText": null,
      "version": "24.7",
      "thumbsUp": 34,
      "criterias": []
    },
    {
      "id": "268a2485-340d-4e81-9a9e-5aa4350fbc59",
      "userName": "Karen Tavares (Kissalude)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWawIgl4vFmBB2SINzrqJGubHwDC6gl_xSjvT4VcHWocA",
      "date": "2024-03-02T00:45:52.105Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=268a2485-340d-4e81-9a9e-5aa4350fbc59",
      "title": null,
      "text": "Buggy. And often times it says out of stock, but you to store and it's right there on the shelf. Can take up to 10 days or so to get refund on cancelled or unavailable items. Also some drivers will deliver to wrong house, so always request signature. Also resolving small problems through tech support is a nightmare that can take days. Absolute trash app. I am uninstalling and cancelling my subscription. Can't even do the basic thing of changing an address on an order.",
      "replyDate": "2023-10-27T15:14:03.583Z",
      "replyText": "Thank you for bringing this to our attention. We're sorry to hear about your experience. Please contact us at walmart.com/help for further assistance.",
      "version": "24.7",
      "thumbsUp": 19,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "11974579-c5b4-4934-94a3-d7ff4362d636",
      "userName": "Rhonda Ciao Hetrick",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUAb0Sk5zFSKayyOUM6CxmjVu8vdPSS72_eZUPTvjjEs1Dx",
      "date": "2024-02-24T22:34:23.637Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=11974579-c5b4-4934-94a3-d7ff4362d636",
      "title": null,
      "text": "Even Instacart has a button you can press to contact the shopper regarding your order. I constantly receive wrong items, even though I specify what item I would like, IF, an item needs to be substituted. Also, I know full well that the item that they are substituting is sitting right on the shelf, they're looking in the wrong place. I'm about to cancel my Walmart + & shop somewhere else with Instacart. Why doesn't this app have a button to contact the shopper?",
      "replyDate": null,
      "replyText": null,
      "version": "24.7",
      "thumbsUp": 24,
      "criterias": []
    },
    {
      "id": "7035a77d-e8e4-491e-b564-f4b123ea52a3",
      "userName": "Lizz Veit",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJl1w3vqmtbbcpPZs3_mRdKq6YBzcI2T310VmVTu4qb=mo",
      "date": "2024-03-01T14:32:25.474Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=7035a77d-e8e4-491e-b564-f4b123ea52a3",
      "title": null,
      "text": "After the newest update, I am no longer able to get my fuel discount at Mobil/Exxon stations. It pops up with the option to start fueling, but when I try to click on it, it does nothing. I've restarted my phone, uninstalled and reinstalled and still won't work. Only reason I gave 3 stars is because the rest of the features appear to work fine.",
      "replyDate": "2024-03-01T14:44:11.102Z",
      "replyText": "That's not the experience we wanted you to have with our app, Lizz. Please tell us additional details about it at https://survey.walmart.com/app",
      "version": "24.7",
      "thumbsUp": 69,
      "criterias": []
    },
    {
      "id": "2d72c00a-8621-4f9d-b1e6-7768c1de6a24",
      "userName": "Colin Mattison",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVH_ICT-edCd-W0_s9p4zzH8TJL3S6TDufjvP1fvMF4Ow",
      "date": "2024-03-02T21:53:57.201Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=2d72c00a-8621-4f9d-b1e6-7768c1de6a24",
      "title": null,
      "text": "They trashed the online ordering & pick up. It used to be so easy to find everything you needed, but they cluttered it like crazy. After 10 mins, I had 4 items out of the 50ish I'd normally buy. The new app design literally makes it take longer than actually shopping. Worthless. I can't even imagine how many customers gave up like myself. Thankfully Meijer & Hy-Vee & jewel have better options.",
      "replyDate": "2024-03-02T22:21:02.986Z",
      "replyText": "Thanks for sharing your experience with us. We’re remorseful to know about the issue you faced while using with the Walmart app. Please contact us at walmart.com/help.",
      "version": "24.8",
      "thumbsUp": 47,
      "criterias": []
    },
    {
      "id": "a1fe0949-765c-4702-9d62-4a7166461b35",
      "userName": "Jessica Buchite",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV7VpJgittOw_rUUie4qDqLLp_bqdn_dLo12HxoU2v0hJdI",
      "date": "2024-02-19T20:01:48.710Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=a1fe0949-765c-4702-9d62-4a7166461b35",
      "title": null,
      "text": "Quite good overall except for including lots of irrelevant things in search results; it can be hard to filter down to exactly what you want. I find the \"messages\" and \"My savings\" sections in the My Account page to be irrelevant & annoying; I wish I could get rid of them but that's impossible. Actual in-store prices often vary from what the app shows for that store. Note to others based on my previous experience: you may need to uninstall/reinstall if the app size gets bigger with each update.",
      "replyDate": "2023-07-20T13:36:12.316Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues while using the Walmart app. We’ve shared your issue with our App Development Team. Please provide with more info at https://survey.walmart.com/app",
      "version": "24.5",
      "thumbsUp": 141,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "b9cef587-8511-4e86-8c61-153fce908c10",
      "userName": "Pat L.",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXsIQaOgTcDTTGjmV41hKnN74lI2mB3yLXs9sBB4ofKBqM",
      "date": "2024-01-30T23:53:15.857Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=b9cef587-8511-4e86-8c61-153fce908c10",
      "title": null,
      "text": "Has refresh issues. As you scroll through items, it refreshes, and you lose your place. It's a bit annoying. Also, the automated security associated with the app will automatically cancel your order if it senses suspicious activity. That's good in a way, but it's too demanding. If you change anything in your account before an order, it will cancel your order and give a refund. But not until after they take your payment. Happen twice, $180 . I now have to wait 10 days for refund & hope not again",
      "replyDate": "2024-01-31T01:02:32.414Z",
      "replyText": "We regret for the inconvenience caused due to the technical issues. Please contact us at https://survey.walmart.com/app.",
      "version": "24.2.1",
      "thumbsUp": 84,
      "criterias": []
    },
    {
      "id": "4fd822c9-3a81-4943-8e1d-1e6e7463e6e2",
      "userName": "Jack Rippr",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXspU2861MY8E06DVqlr-jZBewKThpMT03SG_h2D5gNYMA",
      "date": "2024-03-01T12:37:28.548Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4fd822c9-3a81-4943-8e1d-1e6e7463e6e2",
      "title": null,
      "text": "Well, the shopper never used the \"best matched\" awesome. I mean, it was medicine, he didn't think it was important? Plus, remember to adjust the if you do a percentage. The driver will get the total percentage. My driver didn't get a couple of big ticket items, and he got twice as much as originally attended. The app doesn't adjust the total price again after payment. It's totally misleading. Most related doesn't work. And percentage stops working after payment.",
      "replyDate": "2024-02-29T00:55:01.598Z",
      "replyText": "We're happy to provide you convenience and ease. Thank you for shopping with us.",
      "version": "24.7",
      "thumbsUp": 16,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "151ba3c2-108b-42b4-919d-d5657b1d7525",
      "userName": "Jeri Jarvis",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLei49gZo0RmuCOwMuv4Zxz-q6SJ0UE0QoVMwJnAbV9=mo",
      "date": "2024-03-07T20:01:45.997Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=151ba3c2-108b-42b4-919d-d5657b1d7525",
      "title": null,
      "text": "3rd time in a row that my custom tip amt didn't take and it reverted back to original way too high amount! I'm having to go back into my order after paying and edit it again. At least the last 2 orders weren't missing anything, like my first 3. The map to follow your order is auto zooming in way too close. You can't zoom back out and you can't even track the vehicle because you can't see it.",
      "replyDate": "2024-01-29T15:58:07.120Z",
      "replyText": "Thanks for sharing your experience with us. Please use the https://survey.walmart.com/app link to contact us if you're having issues with the Walmart app.",
      "version": "24.8",
      "thumbsUp": 81,
      "criterias": []
    },
    {
      "id": "2ba0279a-649f-4713-a190-ec320550fac7",
      "userName": "deerhuntmaniac",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUCkolbc9eo97aMO8RsuukCN-E5REMq6OJOqkBVHJVSaQE",
      "date": "2024-03-12T22:57:10.973Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=2ba0279a-649f-4713-a190-ec320550fac7",
      "title": null,
      "text": "I love the app and it is one of the shopping apps I don't delete. I would like to be able to copy and paste on the app so I could shop around better. The only other complaint is with Walmart policy and not the app, and may not be mentioned here but I will, I think they should add a price drop match policy where you wouldn't have to return to a store to return for the difference if price drops in a week or so. Hey, could be put in the app as well.",
      "replyDate": "2024-03-12T23:20:07.296Z",
      "replyText": "Thank you for sharing your experience with us. Please provide us with more info at https://survey.walmart.com/app for assistance with problems relating to Walmart app.",
      "version": "24.8",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "5523891f-019e-45e3-a3a7-4278fdf673a0",
      "userName": "Ally",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXB2DHbMsX7bDS6_KLLZKjysAX4qJI5RWtykyjbB11cYGY",
      "date": "2024-01-09T11:20:10.779Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=5523891f-019e-45e3-a3a7-4278fdf673a0",
      "title": null,
      "text": "PROS-The choose-your-model feature is wonderful! The ability to scan receipts to your account to keep track is very helpful. FINALLY, the simple feature of searching for a product by brand name is available. CONS-You should be able to filter by how you get the item; i.e: shipping, pick-up, etc. Not EVERYONE is able-bodied. I didn't realize that U CAN'T EDIT A REVIEW?! I thought that was standard for ALL apps. WTH! Amazon is the better option for convenience.",
      "replyDate": "2022-11-17T20:05:10.121Z",
      "replyText": "Thanks for using the Walmart app! We're happy to hear positive feedback on our barcode scanner feature. We appreciate you taking the time leave us a review.",
      "version": "23.49.2",
      "thumbsUp": 108,
      "criterias": [
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_customer_service",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_free_shipping",
          "rating": 1
        }
      ]
    },
    {
      "id": "080120a1-45a0-4779-a870-89e14384e4c2",
      "userName": "Hemlock Tea",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX65785nAZvfrgRPoQA8T5E5U_WdC42vTYD5Nx67nM8quE",
      "date": "2024-01-03T14:58:31.613Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=080120a1-45a0-4779-a870-89e14384e4c2",
      "title": null,
      "text": "Even if you filter to only shop for items fulfilled by Walmart, you'll still get items fulfilled by \"trusted partners\". The substitutions for delivery orders are random. They'll substitute for some things but not others, and often that out of stock item is the one thing you need- even if there are similar items available in the app. There's no way to communicate that you want a substution if it's not offered. Definitely not worth the subscription price, I'll stick to Amazon Fresh.",
      "replyDate": null,
      "replyText": null,
      "version": "23.49.2",
      "thumbsUp": 162,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_recommendations",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_customer_service",
          "rating": 2
        }
      ]
    },
    {
      "id": "d8b25b97-4fcc-45f2-9885-2c9b7599f61c",
      "userName": "Tara Spencer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXz-9wHrAbAxqo1gR1-2SwrtYq1viVoVGhmmz20ZipNc0Xs",
      "date": "2024-01-26T01:00:51.932Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=d8b25b97-4fcc-45f2-9885-2c9b7599f61c",
      "title": null,
      "text": "It's slightly better than it was but still has some frustrating issues. Sometimes when I schedule an item for \"shipping\" (due to the item not being available locally), it ends up actually being delivered by a driver yet there's no option to tip them after the fact. If it's changed from a shipment to delivery, I should be able to add a tip. When you search through the FAQs, there's a section that addresses how to add/edit a tip after the fact but those options/buttons don't actually exist.",
      "replyDate": "2024-01-26T02:23:29.476Z",
      "replyText": "Regret for the app issues. We know you want to tip the drivers. Please contact us at https://survey.walmart.com/app.",
      "version": "24.2.1",
      "thumbsUp": 544,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "534312f7-dd6f-4456-8e47-3e79c46dd3d6",
      "userName": "Caleb Myers",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJa2fwSpzNsSHxFIQ4POJxU2ApcOiid08huMCRK9nfR=mo",
      "date": "2024-02-13T20:01:26.763Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=534312f7-dd6f-4456-8e47-3e79c46dd3d6",
      "title": null,
      "text": "Very good idea. Making a list and seeing the price and knowing if it's in stock before I even step foot out the house is very convenient. Although, it could be optimized. The list feature tends to be buggy. For long grocery lists it would be more convenient if they could be organized by Isle and to have a search function to make sure you have something on there. Just use your own app or have people use it and you will fix a whole lot of things and it would be the perfect app.",
      "replyDate": "2024-02-13T20:51:28.383Z",
      "replyText": "Thanks for sharing your experience with us. We see you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app",
      "version": "24.3",
      "thumbsUp": 204,
      "criterias": []
    },
    {
      "id": "9db3484a-69a7-4955-b9fd-6962937c60f6",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2024-01-30T18:52:33.957Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=9db3484a-69a7-4955-b9fd-6962937c60f6",
      "title": null,
      "text": "Does NOT allow items to be 🌟 and add to favorite items list!!! Need to make it easier for Walmart Plus members to find the feature to add fuel at the pump with the code or scan feature!! Need to fix the \"Substitutions\" feature!! If you slide down the screen at the top of that list, but still have not pressed the \"done\" button, new preferences will NOT BE SAVED!! It's not a good idea to \"check in\" to let store know you are on the way! App should show the max time allowed to go for items per day!",
      "replyDate": "2023-02-13T05:01:42.782Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues with item substitutions for Pickup & Delivery. We’ve shared your experience with our App Development Team, they are working towards bringing back this important feature! Please contact us at https://survey.walmart.com/app for any additional feedback.",
      "version": "24.2.1",
      "thumbsUp": 62,
      "criterias": []
    },
    {
      "id": "be473f8c-8a1f-4bb2-92c9-0ffdb2dca6ec",
      "userName": "Bill Shallcross",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW9ZHcV0StIj8LosBdXQlmkRdC8094KTOWMQgUVcOLLwm4",
      "date": "2024-02-03T01:44:37.370Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=be473f8c-8a1f-4bb2-92c9-0ffdb2dca6ec",
      "title": null,
      "text": "This is a review for the pickup aspect of Walmart online. I really like the free option of ordering all my stuff then driving to the store when I scheduled the pickup. Someone puts everything in my trunk and I'm off! They are always efficient and I don't ever have to wait more than 5-10 minutes for them to bring out my order. Only one time did they forget to put an AC filter in my trunk and it's partially my fault because I didn't notice until I got home. Great service.",
      "replyDate": "2024-02-03T02:31:58.839Z",
      "replyText": "We’re happy to hear that you enjoy our pickup service and that our associates are always efficient and helpful. We apologize for the inconvenience caused by the missing AC filter and we hope you were able to get it later. We appreciate your loyalty and we look forward to serving you again soon.",
      "version": "24.3",
      "thumbsUp": 60,
      "criterias": []
    },
    {
      "id": "e9b7a4a2-259b-4ead-96bc-72089a232361",
      "userName": "Steven R",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVILGUkLMiV5r6JmCRxu-l7NGbvZ_nSZ_E998A7NpaE84c",
      "date": "2024-02-05T16:02:20.856Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=e9b7a4a2-259b-4ead-96bc-72089a232361",
      "title": null,
      "text": "Walmart really gives Amazon a run for their money. Everything works pretty well, most of the time. Very often Walmart will replace unavailable items. The buyer automatically pays for the replaced item, even if it is more expensive. The replacement selection system could be improved. Walmart is good about giving refunds quickly if an item is unwanted or was not received. Very rarely, one of the bags may be missing. The only compensation for missing groceries is a simple refund.",
      "replyDate": null,
      "replyText": null,
      "version": "24.3",
      "thumbsUp": 378,
      "criterias": []
    },
    {
      "id": "42cfbff4-d6a7-4391-877a-c2d496b6d3fa",
      "userName": "David Smallfield",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW8gubIaV3g18u77bK6AZYkkhoYkuJl2C9i9aZaKL9qGh5N",
      "date": "2024-02-27T14:10:34.464Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=42cfbff4-d6a7-4391-877a-c2d496b6d3fa",
      "title": null,
      "text": "I love shopping for groceries here, I was hesitant at first because I like to pick my own produce but they do an excellent job and whenever I have had any issues with produce, I just click refund on the app and get an instant refund, no need to return to the store. Saves me so much time and money because I am not tempted to stray from my list so much when shopping through the app.",
      "replyDate": "2024-02-27T14:24:18.806Z",
      "replyText": "Absolutely! Our prices are like buried gems, waiting for your discovery. Whether you’re on the hunt for deals or simply restocking, consider us your trusty sidekick. Happy shopping, intrepid explorer! 🌟🛒",
      "version": "24.7",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "6be567da-4167-49a1-b882-202df85a8348",
      "userName": "Ashley Napier",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXajPjNeW09ggDF0VCtFosuT2uhtWcNLQD6_lXV_N3P5eE",
      "date": "2024-03-17T23:05:50.180Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=6be567da-4167-49a1-b882-202df85a8348",
      "title": null,
      "text": "I love being able to get what I need without having to go to the store to get it. The only issue I've had so far is that the strawberry banana prime can be paid for in store with EBT but isn't eligible for EBT on the app. Other than that I haven't had any problems, delivery is always on time, my products are the correct brands, and all without the stress of having to go to the store in person, it's awesome!",
      "replyDate": "2024-03-17T23:43:26.566Z",
      "replyText": "Thanks for sharing your experience with us. We understand your concern related to EBT payment. Please contact us at walmart.com/help so that we can look into this for you.",
      "version": "24.9.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "9f009598-9fb4-45cd-90d7-81523c21f500",
      "userName": "Karen Byrd",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUFGSjweXHi6fN5i8Xxj4zmcHTMzvtMvx9SPA5RRW3ntYcg",
      "date": "2024-02-22T06:03:01.409Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=9f009598-9fb4-45cd-90d7-81523c21f500",
      "title": null,
      "text": "Truly love the delivery people. They are kind, caring and so helpful. It takes me almost 2 hours to walk the store, and I generally stay in the groceries. I especially like getting the price per ounce, just like when you are in store! It saves me energy and is relativly pain free shopping from home. There are quite a few items that only they sell. I like the store brand food and other Walmart products.",
      "replyDate": "2024-02-22T06:13:01.241Z",
      "replyText": "We are so glad you had a great experience, Karen. We love to make our customers happy with our services.",
      "version": "24.5",
      "thumbsUp": 56,
      "criterias": []
    },
    {
      "id": "daee89de-c56d-42a3-b3e9-d9ca749d6754",
      "userName": "Catherine Mungomba",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWdMWtR-SnwnqMCYdl09KnP1liqBlE7FSgujg-dm7FnN4U",
      "date": "2024-01-13T20:42:05.250Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=daee89de-c56d-42a3-b3e9-d9ca749d6754",
      "title": null,
      "text": "I like Walmart as a store. But due to life's circumstances and situations at the moment, I am unable to physically get to the store. I have had to use the delivery service several times, and each time, there has been something wrong. The app itself is just ridiculous. It is the worst app that I have used to order anything to date. It is so slow, it may as well be going backwards. I have had items missing. I also don't get notifications for substitutions when I need to because of the lag. Fix it.",
      "replyDate": "2024-01-13T20:51:17.609Z",
      "replyText": "Thanks for sharing your experience with us, Catherine. Please use the https://survey.walmart.com/app link to contact us if you're having issues with the Walmart app.",
      "version": "23.49.2",
      "thumbsUp": 62,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "02b15a77-4640-4093-be0a-659bddea2c5e",
      "userName": "Alexandra Neko",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW4TRCw6-BLj9QWIfx06BXOkdCRHAqNA-aj5gcHt7i8P2g",
      "date": "2023-12-31T17:30:33.493Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=02b15a77-4640-4093-be0a-659bddea2c5e",
      "title": null,
      "text": "Its BEYOND difficult to just make a pickup order, its in incredible really. its like the app has a mind of its own, one second it lets me use my benefits card, another it doesn't, then it changed location on its own, then i couldn't place my order, then they gave up my reserved time, then suddenly an item is no longer available and then it was, afterall, available, etc the list goes on... I've never had so much difficulty placing an order, i don't think i will ever again. HORRENDOUS....",
      "replyDate": "2023-12-31T19:04:25.766Z",
      "replyText": "We regret to hear that you had such a frustrating experience with the Walmart pickup order. It sounds like you encountered some technical issues with the app and the website. Please contact us at https://survey.walmart.com/app.",
      "version": "23.49.2",
      "thumbsUp": 208,
      "criterias": []
    },
    {
      "id": "3ce36c8b-4e57-46fc-b263-742919d7dd0d",
      "userName": "Gina Thornton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKgygmxf2jE0qCc0m_5ZcYF__83SZIM9aGhQfg6b65y=mo",
      "date": "2024-03-10T14:08:37.973Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=3ce36c8b-4e57-46fc-b263-742919d7dd0d",
      "title": null,
      "text": "Very pleased the list was added back to app, though I'd still like to have \"sort by aisle\" return, sorting by department is as close as I can get but sorting by aisle improves shopping experience. Even better would be to have item by space on shelf (like the WM shopper staff has), less time hunting an item would give more time to discover new stuff. Still, adding list back improved my rating of the app. Is there a way to get a list of WM cashback items? I may have just not found it yet.",
      "replyDate": "2024-03-10T14:19:19.430Z",
      "replyText": "Thrilled you're enjoying the return of the list feature! Your aisle-sorting idea is genius for optimizing the shopping journey. As for cashback items, stay tuned for exciting new features to uncover more savings! Happy exploring! 🚀🛒",
      "version": "24.9.1",
      "thumbsUp": 67,
      "criterias": []
    },
    {
      "id": "8cb49e2d-4a56-4c73-868a-52dd93f3c273",
      "userName": "Big Bill",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVa7QNMjP4AZt-m30fnDIz42XxP4lvli-gn1iPWArM1mEY",
      "date": "2024-03-17T18:22:09.850Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8cb49e2d-4a56-4c73-868a-52dd93f3c273",
      "title": null,
      "text": "$35 minimum for free shipping is annoying, but still great deals at Wally's. They're still learning how to do efficient deliveries and have a long way to go to catch up with Amazon. Also, I didn't like the fact that the $10 promo code they gave us doesn't work for any item, online an in the store!",
      "replyDate": null,
      "replyText": null,
      "version": "24.9.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "187854ef-25fd-4bc0-b361-c090396f9be4",
      "userName": "Josh Stacey",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXOYzRVtViPRnArTgNTxwc89uc_6-_fwiJqED5tVWGk_w",
      "date": "2024-01-01T22:40:54.784Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=187854ef-25fd-4bc0-b361-c090396f9be4",
      "title": null,
      "text": "Took 30 minutes after check-in to receive items. Items were marked as \"picked up\" long before I ever received my items, which is borderline fraud; marking an item as \"picked up\" as soon as I checked in invites theft by associates and causes anxiety for customers. To top it off, requiring the app to check in, as opposed to being able to check in via the web portal like Whole Foods/Amazon, is anti-consumer and absurd. Lastly, there was no option to choose the style of vehicle, only color.",
      "replyDate": null,
      "replyText": null,
      "version": "23.49.2",
      "thumbsUp": 284,
      "criterias": []
    },
    {
      "id": "eeb2a3ec-08d0-46fd-9d66-04b16bb0fdcb",
      "userName": "Brandy",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLlubQGiSkluBltPsJ5e2XIuMrngkI7pExWZk9oMvBK=mo",
      "date": "2024-01-26T13:10:12.107Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=eeb2a3ec-08d0-46fd-9d66-04b16bb0fdcb",
      "title": null,
      "text": "It is definitely convenient to have your groceries delivered and for the most part I have not had much trouble. I have had a few things come to me out of date or fresh produce not looking well. I have not been able to get a return to work when I have started it through the app and take in my phone with a barcode from the email, every time I do this Walmart customer service says when they scan it it says items cannot be returned even though the email says completely different.",
      "replyDate": "2024-01-26T13:36:50.402Z",
      "replyText": "We regret to hear that you had an issue with a recent return. We strive to make returns easy at Walmart. Please contact us at walmart.com/help.",
      "version": "24.2.1",
      "thumbsUp": 105,
      "criterias": []
    },
    {
      "id": "bf58981b-8d3c-4f27-a538-02bf8e1b4061",
      "userName": "Laura M (Jypsie)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXyp3zz-BYnIyYzI10QLsOp2JYSQFqaplCHixWRRr_ZClfS",
      "date": "2024-03-12T01:11:42.651Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=bf58981b-8d3c-4f27-a538-02bf8e1b4061",
      "title": null,
      "text": "I am tired of running into the same thing with your shoppers. You let us choose what we want for substitutions, but the shopper chooses what they want. Don't they read instructions? I didn't get a lot of my items this last order, & the substitutions they chose were not what I wanted. I understand certain situations, but when it happens constantly, it's obviously lazy shoppers, not unavailable items. Also annoying is when the driver literally puts the bags up against the door, and I can't open it",
      "replyDate": "2024-03-12T03:05:58.585Z",
      "replyText": "Your input is invaluable to us. Please reach out to our customer support team at https://www.walmart.com/help so we can further investigate and address these issues. We appreciate your understanding and continued support as we strive to improve our services. Thank you for choosing Walmart.",
      "version": "24.9.1",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "28db050d-2906-40ae-b146-c525a6063736",
      "userName": "GG Hey",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLbKO83rrleTIFh_sjyB16L4G-ZuRWJeqpF8drRwatn=mo",
      "date": "2024-01-19T18:16:37.255Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=28db050d-2906-40ae-b146-c525a6063736",
      "title": null,
      "text": "App has a great layout. Adding items to cart is simple, as is changing what store I'm shopping at & viewing what stores carry the items a/v for pickup. However, app freezes constantly when trying to view items in shopping cart. Have to uninstall and reinstall regularly (deleting cache doesn't help). Tech service did not help at all. I suspect if you don't order items same day as adding to cart, this \"glitch\" happens, but that is a suspicion.",
      "replyDate": "2024-01-19T18:29:40.631Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app",
      "version": "24.1",
      "thumbsUp": 434,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        }
      ]
    },
    {
      "id": "31eef56d-db71-4a8e-af02-05e394b694a7",
      "userName": "M RILEY",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLoA9OseuRDVIk7Q6oexdUsHASn2KDovlqbVfNmLyI_=mo",
      "date": "2024-02-28T19:08:49.170Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=31eef56d-db71-4a8e-af02-05e394b694a7",
      "title": null,
      "text": "Love The ease of ordering from Walmart App. So many more options than in store- prices fairly competitive w/ Amazon- some even better, depending on the item, and the option to pick up in store, same day is a huge bonus! New App features and updates are being made all the time, & I have to say, I'm using it more regularly as a main shopping resource!",
      "replyDate": null,
      "replyText": null,
      "version": "24.7",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "099349d1-da88-4744-ad0e-5b4149d27902",
      "userName": "Toni L Schneck",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLCMMLq26XX-p7C9tfUEPU-X8ubgpF7inlQ_ah3I-2y=mo",
      "date": "2024-03-16T13:39:39.613Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=099349d1-da88-4744-ad0e-5b4149d27902",
      "title": null,
      "text": "I would have given Walmart 5 stars, but they need to work on their site a bit. I've tried twice in the last 3 months to change my debit card info because I changed banks. My account page wouldn't let me. said there was a problem with the site and to try later. 3 months and 2 phone calls later, and the thing still says the same thing. Just for the heck of it, I tried putting something in my cart without having a card listed, and it finally accepted my new card #. First call should have done it.",
      "replyDate": "2024-03-16T13:58:48.774Z",
      "replyText": "Thanks for your patience as we work on this. We're committed to fixing it. If you need help in the meantime, visit: https://www.walmart.com/help",
      "version": "24.7",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "b3f9c7c4-69c9-46ac-b311-0dd68ef9df4e",
      "userName": "Joel “JC” Marchus",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWeTD0ihEd7veL-VvOAGav_bGpIULxcGFYY4p1esese8V8",
      "date": "2024-01-08T22:39:40.164Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=b3f9c7c4-69c9-46ac-b311-0dd68ef9df4e",
      "title": null,
      "text": "Pretty slick. sometimes it's a nightmare trying to find the scan&go app in there but it's pretty slick. It seems that they may have \"improved\" the scanner for the scan and go portion. Maybe it's always been this way and I've never noticed. Even with the barcodes out of sight, it seemed to be scanning products it saw in my cart while my eyes scanned what was on the shelves. So, the items instance did increase whilst the ingress indeed remained intangible.",
      "replyDate": "2024-01-07T21:18:02.789Z",
      "replyText": "Thank you for sharing your thoughts, Joel. Please provide us with your valuable input at https://survey.walmart.com/app",
      "version": "23.49.2",
      "thumbsUp": 177,
      "criterias": []
    },
    {
      "id": "444075c9-d7bf-4919-8201-611a3c9d65d4",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2024-01-06T19:43:16.861Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=444075c9-d7bf-4919-8201-611a3c9d65d4",
      "title": null,
      "text": "The app is unusable now. I never had a problem before ordering online. But for some unknown reason, I can no longer order anything. Everytime I click the add to cart button the app crashes. That's a big problem for me, I have a bad leg and it's hard to walk long distances. So I do all my walmart shopping online, either curbside pickup or delivery.",
      "replyDate": "2024-01-06T20:17:37.950Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app.",
      "version": "23.49.2",
      "thumbsUp": 144,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "80095c3d-a2f7-487e-95ae-355bd79bdc7e",
      "userName": "Morgan Laitala",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJuV2xy6hMOJ1VXLla_oNiqBJYfqrd1iTL4VBCesDYy=mo",
      "date": "2024-01-09T00:17:34.861Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=80095c3d-a2f7-487e-95ae-355bd79bdc7e",
      "title": null,
      "text": "The app is soooo slow and makes putting together a cart of items incredibly frustrating. Not to mention they don't tell you anywhere that the drivers are not employed by Walmart. If I could physically go to the store I would but I can't so I'm forced to use this buggy, laggy app. Not to mention recently in \"My Items\" every third item is a random recommendation, so the list I've purposely kept as short as possible takes way, way longer to populate than it did before to the point my phone gets hot",
      "replyDate": "2024-01-09T02:16:42.845Z",
      "replyText": "Thanks for sharing your experience with us. We see that you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app",
      "version": "23.49.2",
      "thumbsUp": 36,
      "criterias": []
    },
    {
      "id": "898b2d9d-2d57-43d7-91c8-5f20ee157bc3",
      "userName": "Leslie Davis",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXBQU91XxNPpzvVXnmKjZI2kyKg0YXrt7ZGHImLGKf6yp9j",
      "date": "2024-01-04T19:48:40.200Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=898b2d9d-2d57-43d7-91c8-5f20ee157bc3",
      "title": null,
      "text": "I recently was unable to place a grocery order for pick up for over 2 days due to \"technical difficulties\" on their end during the checkout process. I've also had items missing from my orders, despite it showing the item was picked up. I also don't like that it will only hold the reserved pick up time for an hour as it takes longer than that for me to shop sometimes. I'm glad I can order online and pick it up as I'm disabled and shopping is hard but the website/app has major problems.",
      "replyDate": "2024-01-04T20:52:27.352Z",
      "replyText": "Thanks for sharing your experience with us, Leslie. We’re sorry you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app.",
      "version": "23.49.2",
      "thumbsUp": 118,
      "criterias": []
    },
    {
      "id": "abc8dab8-f788-4b72-a33c-832cba123b27",
      "userName": "Stacey Brake",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXCaW_g8c5lxNHNfvCgu94WozSufmpp3QUkmExpdM4FKA",
      "date": "2024-01-16T13:57:15.705Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=abc8dab8-f788-4b72-a33c-832cba123b27",
      "title": null,
      "text": "The last few months the app has just progressively gotten worse. It keeps telling me I'm not connected to data or wifi when I have signal on my phone. As well when I'm trying to change things in my cart or remove something it's glitches and says it's unable to do whatever I'm trying to do. I normally have to remove or change something 4-5 times before it will finally do what I'm wanting. And this happens every time I place an order which is monthly. Updates to the app do nothing to fix the issue",
      "replyDate": "2024-01-16T14:12:17.812Z",
      "replyText": "Thanks for sharing your experience with us. We’re regret the issues you’ve had while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app",
      "version": "24.0",
      "thumbsUp": 136,
      "criterias": []
    },
    {
      "id": "d83b2170-6133-48d7-8c4a-cc4840c23d6e",
      "userName": "Shari Carruth",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ48qNS2o9OvoqEkn_rSZxeemYY-Y06ItPY3eqmGtBT=mo",
      "date": "2023-12-28T00:34:47.349Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=d83b2170-6133-48d7-8c4a-cc4840c23d6e",
      "title": null,
      "text": "CONSTANT error messages telling me I have no internet connection when I clearly do!!!!! Trying to add or remove anything from my cart is a chore because it keeps giving me \"we are having technical issues \" or \"you are not connected to the internet\" I have tried everything I can think of and it just keeps doing it. I rely on the pick up service for groceries due to health issues and now the app is basically making it impossible for me to do that! Has just started doing this about 2 months ago.",
      "replyDate": "2023-12-28T03:47:10.922Z",
      "replyText": "We’re sorry you’ve had issues while using the Walmart app, Shari. Please provide us with more info at https://survey.walmart.com/app.",
      "version": "23.49.2",
      "thumbsUp": 183,
      "criterias": []
    },
    {
      "id": "3f3f4f73-683e-48bb-a61f-d48da49f14ee",
      "userName": "G T",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW392RUS9Q21Qp7g01k06zDkQ0unOqlDkdUZJQT1Q5hi9Mc",
      "date": "2023-12-23T05:04:49.505Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=3f3f4f73-683e-48bb-a61f-d48da49f14ee",
      "title": null,
      "text": "Not sure why others are having problems. Works exactly like it's supposed to. Love using Walmart pay and being able to have a record of every single purchase I've made in the last 2, 3, 4 years? I've lost count as I don't care to review purchases beyond maybe a couple of years if any. I mentioned Walmart pay and records of transactions, but you don't need to use Walmart pay to digitally save your receipts.",
      "replyDate": "2023-12-23T06:11:30.663Z",
      "replyText": "Our goal is to make our customers happy with our services. Thanks for choosing Walmart!",
      "version": "23.49.2",
      "thumbsUp": 236,
      "criterias": []
    },
    {
      "id": "9f14c291-3dc0-4d61-8893-01934249177b",
      "userName": "Michael Wnuk",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU3ZLklZ2g5jJguFK-JyxPvsgUdh1HNOGyTaaPdRouySp0",
      "date": "2024-03-03T20:44:21.909Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=9f14c291-3dc0-4d61-8893-01934249177b",
      "title": null,
      "text": "A mostly useless app. It lacks intuition and ease, store mode is garbage & continuously highlights products only available online, when searching before arrival you'll find the \"instock\" it isn't or is left over broken garbage. Pickup orders is the greatest joke, if you order items in stock for pickup tomorrow the likelihood that they will be out of stock prior to the time that they pull your order is extremely high. This isn't amazon where they have warehouses the lock inventory upon ordering.",
      "replyDate": "2024-03-03T20:55:20.631Z",
      "replyText": "Thanks for sharing your experience with us. We understand your concern about the confusion you faced in the online section. Please contact us at walmart.com/help.",
      "version": "24.7",
      "thumbsUp": 10,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "02bb6700-7c03-49ee-a858-61fc2e076327",
      "userName": "Kalie Proctor",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIMMvcdilmgZ6IC4KA_RRrf3hKfHASLcrwGBxwdWZxH=mo",
      "date": "2024-01-01T22:34:52.567Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=02bb6700-7c03-49ee-a858-61fc2e076327",
      "title": null,
      "text": "The app was pretty helpful until I went to switch from a monthly membership, to an annual. I canceled my subscription, and went to resume one day later, but I keep getting an error message that they are unable to create the membership at this time.. I have tried to resume my subscription the upwards of 30 times in the past, without success. I have used different cards, different phones, different browsers, and customer service is absolutely no help. I have called them at least 8 times about this",
      "replyDate": "2024-01-01T23:06:06.103Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app",
      "version": "23.49.2",
      "thumbsUp": 79,
      "criterias": [
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "9f762fab-fc05-4298-8747-fa78cead301e",
      "userName": "Salacious Crumb",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVuGVBMV7scrYJzb2E_hZQRMlNZxMJaXE-MqFboiaqhMOQ",
      "date": "2024-02-26T19:01:20.239Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=9f762fab-fc05-4298-8747-fa78cead301e",
      "title": null,
      "text": "I use the order pick up. I have received the notification popup and tapped it accidentally. The app immediately says I'm on my way when I never did anything. I'll get a call from Walmart saying they can't find my car. I used to be able to click on the notification and view my order and tap \"I'm on my way\" when I was ready. Fix your app.",
      "replyDate": "2024-02-26T20:05:43.500Z",
      "replyText": "This isn't the experience we want for our customers. Kindly contact us at https://survey.walmart.com/app",
      "version": "24.7",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "fc01dd77-3bcf-49d6-9ffb-cb6faf4cb0a0",
      "userName": "Destiny Hernandez",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX3z9eUxyffCIGISUdo6-27Dw7fR3_tAb_NpbtEQLTqMdU",
      "date": "2023-12-27T17:57:39.814Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=fc01dd77-3bcf-49d6-9ffb-cb6faf4cb0a0",
      "title": null,
      "text": "I have been a walmart + member for over a year. Never had a issue until now. All of a sudden it will no longer recognize ebt items in your cart and won't allow you to pay using your ebt. Mind you this is also a issue on the direct website as well. Been told multiple times they are working to fix it and give 2 business days. I have given them 3 weeks and it's still not fixed! Seriously considering canceling my membership at this point.",
      "replyDate": null,
      "replyText": null,
      "version": "23.49.2",
      "thumbsUp": 49,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        }
      ]
    },
    {
      "id": "effdfc1a-8080-4d8b-ba24-5f7db2c7ca37",
      "userName": "Jeanine Stovall",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKCuMrSzk1Hs0TX6v3LozG_4FBUiD_kv1hpkFv4sfmX=mo",
      "date": "2024-01-30T13:36:20.989Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=effdfc1a-8080-4d8b-ba24-5f7db2c7ca37",
      "title": null,
      "text": "I love this store and app. It has allowed me to save money by buying on my list instead of physically walking through the store and getting things that I really don't need especially CLEARANCE racks! You'll also like the choice of pick or delivery to your home. I can't tell you the number of times when I have not felt well and opted for delivery instead of pick up. Thank you Walmart for adding this to your shopping experience.",
      "replyDate": "2024-01-30T15:09:16.500Z",
      "replyText": "We're thrilled to hear that you've had such a positive experience with Walmart. Thank you for your kind words and review.",
      "version": "24.3",
      "thumbsUp": 44,
      "criterias": []
    },
    {
      "id": "ca0f6cc7-fc97-470e-92ec-578fcb1e741a",
      "userName": "Katherine Royer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW3hfOidHFrvGliXQJdTUsMHqWNP68c3DJu26TU7G4O-5U",
      "date": "2024-01-29T04:43:48.805Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=ca0f6cc7-fc97-470e-92ec-578fcb1e741a",
      "title": null,
      "text": "The app is finally working correctly. Prev. Rev. This app has been having technical issues for a few days now. I can't place an order. The button that is supposed to say \"Complete order\" says \"Save card\" and when any payment method is chosen & I click on it the blue field just turns a darker blue and the order will not process. I have done every type of troubleshooting on my end to no avail~!",
      "replyDate": "2024-01-09T20:40:16.668Z",
      "replyText": "Thank you for sharing your experience with us, Katherine. Please provide us with more info at https://survey.walmart.com/app for assistance with problems relating to Walmart app.",
      "version": "24.2.1",
      "thumbsUp": 38,
      "criterias": []
    },
    {
      "id": "d0b7e198-3686-4df5-aa08-f5b895a09921",
      "userName": "Patricia Pettersen Chaparro",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW9IGZY7zGC2NEpaLYfTc307Fu32cr4wuFMgca4Q-wHoMp1",
      "date": "2024-03-08T21:14:10.802Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=d0b7e198-3686-4df5-aa08-f5b895a09921",
      "title": null,
      "text": "Love the flexibility of Walmart home shopping & delivery. I've tried several other providers and by far Walmarts has been the better experience. I wish there was a way of tipping the actual shoppers vs the delivery personnel. They definitely deserve the recognition for thier work. If I had to choose one area for improvement it would be the deli area- each time I've ordered cheese, they were placed piled up on each other to hard to separate and very thick, too thick. Otherwise Walmart ROCKS!",
      "replyDate": "2024-03-08T21:30:09.640Z",
      "replyText": "Your opinion matters to us. We're always working hard to make things even better. Thank you for taking the time to leave us a review.",
      "version": "24.9.1",
      "thumbsUp": 34,
      "criterias": []
    },
    {
      "id": "4eca490b-2155-4497-9fb3-93d1ee93fda9",
      "userName": "Phil Dunn",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUJlkTdhlMHZ_BM7ZzXfALVW1wpOBNfVkBbDpmn1l7KMd8",
      "date": "2024-01-21T14:28:25.201Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4eca490b-2155-4497-9fb3-93d1ee93fda9",
      "title": null,
      "text": "-3★ Not as good as it used to be. 1) For the past couple years, the ability to search past purchases only works for online purchases. In store purchases can't be found. 2) Receipt items are paged, which is slow and frustrating, requiring too many clicks -- just show the full list of receipt items. 3) Add a home button. Navigation requires excessive back button clicks.",
      "replyDate": "2023-04-23T18:10:25.674Z",
      "replyText": "Thanks for using the Walmart app! We appreciate you taking the time to rate us!",
      "version": "24.1",
      "thumbsUp": 129,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "6252ca07-0344-4a80-9f18-ae5d204139b9",
      "userName": "Ben K.",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUAgRXAvwMhQj_lrz2axx7mKwhbmDbkw6NSMydrYCwZN2s",
      "date": "2024-01-18T20:48:43.552Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=6252ca07-0344-4a80-9f18-ae5d204139b9",
      "title": null,
      "text": "Popups are infuriating; changing stores to check stock rarely works; windows close when I'm just trying to scroll down; items show as \"in stock\" at my store, but are \"unavailable for pickup\"; automotive appointments are a massive hassle where you can't achieve everything (e.g., different person bringing my car, need road hazard, want to pre-pay for installation). Two stars because being able to look up what aisle something is on its hugely convenient.",
      "replyDate": "2024-01-18T21:41:06.400Z",
      "replyText": "Hi there, sorry to hear the App feature within the app was not working properly. We'd like to assist with your issue. https://survey.walmart.com/app.",
      "version": "24.1",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "cdecb68b-8562-482c-8061-a36c0aadf419",
      "userName": "Ed Giachelli",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJVCg_7PIDkG_pzMg1b-1j3N8Y91UPfnZnzQVhpbxSt=mo",
      "date": "2024-01-24T21:53:08.311Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=cdecb68b-8562-482c-8061-a36c0aadf419",
      "title": null,
      "text": "The stock levels Walmart keeps are appalling. 0n my last order they were 'out of stock' on 50% of the items I ordered. On a recent order, I ordered three items. Two of the three items met the $35 limit on delivery. The third item was only $5 approximately. Guess what two items they were out of. If you if you guessed the expensive items, you are correct. My exacto knife was delivered. Also, I had to pay a tip on the amount of the full order before the shortages in the store were realized.",
      "replyDate": "2024-01-24T22:49:35.214Z",
      "replyText": "Your input is valuable. We're committed to optimizing our stock management system to minimize order fulfillment challenges. Please provide us with more info at https://survey.walmart.com/app",
      "version": "24.2.1",
      "thumbsUp": 68,
      "criterias": []
    },
    {
      "id": "e841f464-1168-453d-b18c-115abb11825c",
      "userName": "elijahishere",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWqZsqTWGwEqmj3rE-vv4fbe5gu6zTd5tle5tcTC_j7yG0",
      "date": "2024-01-07T14:13:32.420Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=e841f464-1168-453d-b18c-115abb11825c",
      "title": null,
      "text": "You cant pick up your grocery order without downloading the app. Then you cant let them know you're on your way without granting location access, why is that? For a travel time? Thats what I have Maps for. Then it offers a trip summary. For the 7 minute trip to Walmart? No thanks. Uninstalling as soon as the order is put in my car. My reply: Needing an app to pick up is dumb when the button is on the site you are already looking at. Thanks for the mean response. App's already gone. Never again.",
      "replyDate": "2024-01-07T13:59:29.721Z",
      "replyText": "Thanks for the input. App helps us serve you better. Location gives you faster pickup. Summary shows you savings. Walmart values your words. Please contact us at https://survey.walmart.com/app.",
      "version": "23.49.2",
      "thumbsUp": 27,
      "criterias": []
    },
    {
      "id": "880b5f61-1187-4223-a6fc-ee85cc3ea237",
      "userName": "Kenneth Gregory",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVm-HKKxfQEKgItyUCYy8Yakdx1xr4auCDU5VSlxzJQ9xap",
      "date": "2024-01-14T23:46:55.504Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=880b5f61-1187-4223-a6fc-ee85cc3ea237",
      "title": null,
      "text": "This app is terrible for the same reason the amazon app has historically been terrible. It tries to accomplish way too much in 6 iinches of screen real estate. You cannot possibly provide enough at a glance information to cover all of your services, so using the app to do mundane stuff becomes this huge trail or tears through a labyrinth of hidden options, menus, sub menus, location context. At the end of the day, it's just poor software design. Consider your platform: mobile devices.",
      "replyDate": null,
      "replyText": null,
      "version": "23.49.2",
      "thumbsUp": 20,
      "criterias": []
    },
    {
      "id": "bafca500-02a4-4a74-8b20-1a64b52aa6df",
      "userName": "Inspired by",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWXmYLjMlzYySKHmNw2LbgzEfPtvdDi1aaVYwikLbE_je3I",
      "date": "2024-02-13T00:50:09.728Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=bafca500-02a4-4a74-8b20-1a64b52aa6df",
      "title": null,
      "text": "Good quality app, works fast and well, and has lots of information, sometimes a \"bit\"toooo much, but most of the time everything you could need! I also love how they handle delivery services, besides it just being who fulfills it doing it right. Just wish you could get more \"free\" benefit options with Walmart Plus+ when it comes to free option times.",
      "replyDate": "2024-02-13T01:08:26.444Z",
      "replyText": "We're pleased to hear that you've had a great experience with our app. Thank you for taking the time out to rate us.",
      "version": "24.3",
      "thumbsUp": 77,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        }
      ]
    },
    {
      "id": "8e52a0fe-a8bf-4eaf-98e8-aa7347b683aa",
      "userName": "R King",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW3g2IeACTB4QfFoKCQg4HnCjnRTNQwN60L__ZJr3EwY_JH",
      "date": "2023-12-29T01:30:13.401Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8e52a0fe-a8bf-4eaf-98e8-aa7347b683aa",
      "title": null,
      "text": "Our local Walmarts are forcing us to log into their WiFi now, which I don't understand why the app couldn't just log us on automatically. On my WM Motorola E6 I couldn't even get it to login, because every time I clicked Agree, it would uncheck the checkbox. I also wish they would add support for Bluetooth barcode readers, because I can not stand having to look at the screen to make sure it scanned an item. Sometimes I have to fiddle with the camera angle to to get it to scan.",
      "replyDate": "2023-12-29T06:28:27.859Z",
      "replyText": "We’re sorry you’ve had issues while using the Walmart app. Please provide us with more info at https://survey.walmart.com/app",
      "version": "23.49.2",
      "thumbsUp": 34,
      "criterias": []
    },
    {
      "id": "7d803284-787e-4218-bedf-0c5791029d3b",
      "userName": "Steve M.",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKTA90CXrF_Bt_LY_hjNrlN5yj63FVDJMego-f61Xe8=mo",
      "date": "2024-01-30T18:16:42.999Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=7d803284-787e-4218-bedf-0c5791029d3b",
      "title": null,
      "text": "overall, a good app that is constantly getting improved on. The biggest issues currently are 1) When missing an item from the order, missing is not an option for starting a refund. 2) Never add on additional items to an order once it is placed. It causes billing issues. 3) Substitutions no longer charged at the ordered item price. They often substitute in a higher priced item even though the item you ordered is still in stock in the store. I recommend you turn off substitutions.",
      "replyDate": "2024-01-30T18:20:39.383Z",
      "replyText": "We're dedicated to enhancing the user experience, and your input is crucial in this process. Please share additional details through the provided link at https://survey.walmart.com/?walmart-store-core. Your contribution is highly valued, and we appreciate your assistance in improving our services.",
      "version": "24.2.1",
      "thumbsUp": 25,
      "criterias": []
    },
    {
      "id": "b391d5c6-5e81-4e28-83a5-aae78afab7f1",
      "userName": "Chiquita Blue",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJzB3znM6HqfhNT_iVBAg3BJ45F6t-oFbcR4bR1nOvv=mo",
      "date": "2024-02-06T05:38:40.344Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=b391d5c6-5e81-4e28-83a5-aae78afab7f1",
      "title": null,
      "text": "This App is great when it works but frustrating when it doesn't. It doesn't let you pick substitutions sometimes and when it does it freezes and starts you all the way over. It sometimes has a delay also. I would advise you to set your pick up or delivery time when you know you're going to be awake because if you can't pick subs and they ask you if you want another item instead if you don't answer, you won't get anything.",
      "replyDate": "2024-02-06T07:43:32.982Z",
      "replyText": "Thank you for sharing your experience with us. Please reach out to customer care at walmart.com/help for issues with fulfillment of your order. If you have suggestion for the app, you can contact us at https://survey.walmart.com/app",
      "version": "24.4",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "8509a5b9-6c45-46c2-8b9d-ff13e8c37b54",
      "userName": "Leila",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLu-pDZMeBVv4VMNZSL8k_liZPBo-ZPU-CQG_TmWP-w=mo",
      "date": "2024-01-11T22:19:16.640Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8509a5b9-6c45-46c2-8b9d-ff13e8c37b54",
      "title": null,
      "text": "Very disappointed by last 2 orders! I'll cancel my walmart premium plus subscription if you don't become dependable! My last 2 delivery orders were delayed 2 hours, 2 hours passed and still no delivery or update. I was told to cancel them each time by customer service. Once I was promised a $10 walmart cash payment, but never got it. Fix me having to cancel an order myself if you get stuck in a delivery error. Most importantly, actually deliver my food on time 99% of the time! 3 deliveries came",
      "replyDate": "2024-01-11T22:45:55.398Z",
      "replyText": "We regret to hear about your recent experience with the delivery service. Please reach out to us at https://survey.walmart.com/?walmart-store-core",
      "version": "23.49.2",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "93be6298-243f-49a7-9102-5a6b720e7178",
      "userName": "Ashley Terry",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIwNEk1j0akMkOswN-o9WRbzZ_2yx58NelmJyvW98UA0u4=mo",
      "date": "2024-01-14T16:01:42.213Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=93be6298-243f-49a7-9102-5a6b720e7178",
      "title": null,
      "text": "I use this order for my weekly groceries and it has saved me so much time from going into walmart. However, right now it is not allowing me to place an order and customer service is no help. I have tried customer service via phone and chat on the app. They both gave me solutions that point to my phone being the issue. I have been trying to place an order for three days.",
      "replyDate": "2024-01-14T16:34:05.187Z",
      "replyText": "We regret to hear that you’re having trouble placing an order online. Please contact us at https://survey.walmart.com/app.",
      "version": "23.49.2",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "8ea4ffff-b329-4c1f-bea4-8059d9cf6363",
      "userName": "Jonathon Prince",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXe7LTrlqQICQ7ZMPHSAk-J8P9kj-bHXFGPMF3-AqamUDw",
      "date": "2024-01-21T19:09:42.861Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8ea4ffff-b329-4c1f-bea4-8059d9cf6363",
      "title": null,
      "text": "Constant inventory issues causing huge inconveniences. For years, your online inventory has been incorrect, causing customers to have to stop what they're doing and shop for alternate items which may or may not be in stock. I now have 2 orders ($300) sitting to be refunded and have to wait 10 or more days to get my money back. So frustrated! I am definitely NOT renewing and will be telling family and friends NOT to purchase the Walmart+ membership as it's not worth the frustration.",
      "replyDate": "2024-01-21T20:59:48.616Z",
      "replyText": "Your concerns about inventory accuracy are noted. We're committed to resolving the inventory inaccuracies and providing a more seamless experience. Please contact us at walmart.com/help for further assistance.",
      "version": "24.1",
      "thumbsUp": 29,
      "criterias": []
    },
    {
      "id": "8dc75167-fa71-45e8-898f-d77f177ac91d",
      "userName": "Char McKeon",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJsjSXJEI3SoTYHudVLs0nkH5A3a499SocXdPd82AqBjw=mo",
      "date": "2024-01-17T02:55:24.264Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8dc75167-fa71-45e8-898f-d77f177ac91d",
      "title": null,
      "text": "it's extremely frustrating that common items are never in stock. 1/16/24 I have ordered delivery for the last time. Once again, my order has substitutions, nothing is in stock. And this time? They shipped my tuna with 3 day delivery. I won't be home for a month. I didn't notice the issue because the app is incredibly convoluted. They should have just cancelled that item completely.",
      "replyDate": "2023-08-01T03:33:23.670Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues with product availability within the Walmart app. Please contact us at walmart.com/help.",
      "version": "24.1",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "6107bd8d-f1d5-42e9-b6d9-8a0b1c28e920",
      "userName": "Sharon Cox",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUxuzddaVOXGEAGXqpwKpk30QRoeGznYqY8P1mUvP9XeM8",
      "date": "2024-02-12T20:43:07.700Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=6107bd8d-f1d5-42e9-b6d9-8a0b1c28e920",
      "title": null,
      "text": "Used this app all the time due to the inability to travel for grocery shopping, and it worked great... until it stopped allowing payment to process. Paid for not one but 2 different services (walmart+ & walmart in-home) and haven't received a single order in about a month. Calling in doesn't help. Nothing does. Apparently your tech guys aren't quite hacking it. So I've paid for 2 services I've been screwed by and the company doesn't care. *Edited to add* I'm not changing anything. Refund me.",
      "replyDate": "2024-02-12T10:07:11.264Z",
      "replyText": "We regret you've had issues with payment mode and pricing. Thanks for sharing your experience with us. Please contact us at walmart.com/help.",
      "version": "24.3",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "a2747d08-e7d0-41e4-87d1-52f30f471a0d",
      "userName": "Jonette Ottaway",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgvAP2HQ7z-U3Xwz4tSijhrsigF0g-ezf-UFLq4WUv7-d-",
      "date": "2024-01-10T23:22:04.792Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=a2747d08-e7d0-41e4-87d1-52f30f471a0d",
      "title": null,
      "text": "My order is DELAYED, and customer service can't find it. And they already charged my card for $30 more than the total. WALMART IS THE WORST I just wasted so much time. Added about 30 items to my shopping cart. All of a sudden, I'm being told they're ALL out of stock, to move to the \"save for later\" list. I try to move them back to my shopping cart, constantly tells me it's out of stock. I'm going back to Instacart or Target. FRUSTRATED 😤",
      "replyDate": "2023-11-18T23:53:52.158Z",
      "replyText": "Thanks for sharing your experience with us, Jonette. We’re sorry you’ve had issues with pricing within the Walmart app. Please contact us at walmart.com/help.",
      "version": "23.49.2",
      "thumbsUp": 32,
      "criterias": []
    },
    {
      "id": "5e93e2f1-2eeb-4a58-a902-691d1fdb989f",
      "userName": "Meli S",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWe15SqUlRstBWlxFcs0E89oYoAQg0znLd0St9QYxXHbQ",
      "date": "2024-02-26T22:48:30.694Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=5e93e2f1-2eeb-4a58-a902-691d1fdb989f",
      "title": null,
      "text": "They often don't have what you ordered or a suitable replacement by the time they fill your order even if you pay for express delivery. Overdone, counterintuitive, and difficult to navigate app and site. I have given this corporation almost a year, and I am done. It is more stressful than just going to the store. I will be canceling my membership before the renewal date. I am currently looking for an alternative. I should have known better than to trust Walmart.",
      "replyDate": "2024-02-26T23:05:37.604Z",
      "replyText": "We regret for the issue cause to you by not receiving the right items. Please contact us at walmart.com/help.",
      "version": "24.6.2",
      "thumbsUp": 25,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "0ade5275-3d14-461d-b8e6-e97d6d3feef9",
      "userName": "Dawn's Dogs",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWK2rv7K4PfhZ5yO1zOUvFVBXqhOEhcTuowyNPhxg1TkA",
      "date": "2024-02-01T11:32:59.967Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=0ade5275-3d14-461d-b8e6-e97d6d3feef9",
      "title": null,
      "text": "Walmart+ is the best thing ever for those of us who work from home, go to school full time, are older and/or with disabilities, or anyone at all who doesn't have the time to shop or has difficulty getting around. The app is super easy to use and I love that they include Paramount+ !!! Also, if you get government assistance, it's discounted, which is a great thing during these hard times!",
      "replyDate": "2024-02-01T14:35:36.251Z",
      "replyText": "We're always here to make things easier for you. Thank you for choosing us!",
      "version": "24.3",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "8aed5fd0-e0b4-4f66-8699-afeaf02f20f6",
      "userName": "Lindsay Spates",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV81eGGDhvX0lKd1YsEvG3okyM3YS-8sPf1iWwiiGnGZkTA",
      "date": "2024-01-29T13:12:35.513Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=8aed5fd0-e0b4-4f66-8699-afeaf02f20f6",
      "title": null,
      "text": "Good not great. You can't add a tip if you pay with EBT. They make you pay an extra $7 if you order less than $35 worth of stuff even if you do a pick up, and they don't include the tip in the order. They falsify savings by displaying a fake higher price then showing the normal price as if it's a discount, but it's not a discount.",
      "replyDate": "2023-12-10T03:45:02.869Z",
      "replyText": "We apologize for any inconvenience this may have caused you. Please contact us at https://survey.walmart.com/app\n",
      "version": "24.2.1",
      "thumbsUp": 20,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "14797d42-4312-418c-a7e5-fe2aade5ec1b",
      "userName": "Shayla Nicole",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKIFw4UDcyHNdlj9IzFD-u_YjKYw2FuJc5EIXx3s3nS=mo",
      "date": "2024-02-06T19:03:20.333Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=14797d42-4312-418c-a7e5-fe2aade5ec1b",
      "title": null,
      "text": "I don't know what's going on w/this app. 1 minute it shows free pickup w/Walmart+ then at checkout it shows a $6.99 fee. Free pickup is the main purpose I purchased a years worth of Walmart+ & I live out of range for home delivery. It was perfect w/month to month prior to the year purchase, after, a headache. When I work 66 hrs/wk picking orders for Amazon the last thing I want to do is walk into the store, but I'm forced to, and probably forced to cancel my Walmart+ membership too. Waste of $",
      "replyDate": null,
      "replyText": null,
      "version": "24.1",
      "thumbsUp": 14,
      "criterias": [
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "b3e90b34-fff7-413f-8925-77114963a75b",
      "userName": "Aaron Thomas",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocILlm9GgGExmV9j6jQpOjPy6U5H8aGRud5op0jUh11l=mo",
      "date": "2024-02-26T14:44:14.562Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=b3e90b34-fff7-413f-8925-77114963a75b",
      "title": null,
      "text": "FRAUDULENT. I did not try to sign up for Walmart+, the app showed a pop up when I tried to click the account section at the bottom and it immediately signed me up for a trial without any confirmation, and I had to hunt down a way to cancel it. Now it aggressively tries to get me to \"restart\" my membership by constantly asking me every time I open the app or sign into the website, and the button on the popup is still at the bottom, where the app's categories are.",
      "replyDate": "2023-06-06T20:10:38.880Z",
      "replyText": "Thanks for your feedback. We’re sorry you’ve had issues with the Walmart app. We’d like to know the details of the problem you mentioned. Please provide more information at https://survey.walmart.com/app. We'll pass it along to our development team and see if we can fix this technical issue. Thanks!",
      "version": "24.6.2",
      "thumbsUp": 24,
      "criterias": []
    },
    {
      "id": "047697a6-f889-4d62-a9a7-543ddcc40528",
      "userName": "Christopher Martin",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLvlFHU892A6vzrXwrbbUZjogXm5mB-lcegs3rUR5qJ=mo",
      "date": "2024-02-02T18:33:18.720Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=047697a6-f889-4d62-a9a7-543ddcc40528",
      "title": null,
      "text": "The service is a great idea, the app is a bit clunky but it's functional... My frustration is that I pay extra for this service but then I have to stand it line behind people who don't pay for with while they scan each item one at a time... Half the machines are down most of the time... What am I paying for exactly? It would be nice to have a checkout or 2 dedicated for + customers",
      "replyDate": "2024-02-02T20:47:03.112Z",
      "replyText": "Thank you for sharing your thoughts on the Walmart+ service. To ensure a smoother experience in the future, we recommend providing more detailed input through our survey at https://survey.walmart.com/app. This will allow us to gather specific information and work towards improvements.",
      "version": "24.3",
      "thumbsUp": 44,
      "criterias": []
    },
    {
      "id": "b90ec79a-4de3-42bc-adc8-274bd8b2a877",
      "userName": "jennifer C",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU_Noia1_m2SpSmee5_BfOd5_7WCASMh3VF6_A4UFwOTd4",
      "date": "2023-12-30T18:14:48.805Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=b90ec79a-4de3-42bc-adc8-274bd8b2a877",
      "title": null,
      "text": "Horrible. Really convenient, but they will charge you 5 times for 1 order!! And getting \"customer service \" to help correct the over charging takes several phone calls. I called once, they said they'd take care of it and send me an email. No email, no correction. Calledback, nothing but double talk. Checked my bank account, THEY CHARGED ME FOR THE 5TH TIME. Don't store your bank or credit card info on the app if you do use it.",
      "replyDate": "2023-12-30T18:48:11.234Z",
      "replyText": "We regret to hear that you’ve been experiencing issues with overcharging after placing a Walmart order. Please contact Walmart’s customer service at walmart.com/help to report the issue and get assistance with resolving it.",
      "version": "23.49.2",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "4c8c0ff7-7c4b-4252-8d9b-e5954bb8eff1",
      "userName": "Kit",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJXjL1s0kK6LpC3zIn-nN1CUK9Ub9F84uRrVcUfOkMZ=mo",
      "date": "2024-02-13T17:27:23.478Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4c8c0ff7-7c4b-4252-8d9b-e5954bb8eff1",
      "title": null,
      "text": "Some cards paranoid security, or glitched out cellphones, you can no longer access Walmart+ and some things do not function properly. In example, I purchased a back pack for delivery and it was unavailable in store and it gave me the option to have it shipped, it would not allow me to select ship. I called in about it, and the person said it will send anyways. Actually I was refunded instead. It is extremely slow, very glitchy, but as far as the purpose itself it does work.",
      "replyDate": "2024-02-13T18:07:29.448Z",
      "replyText": "We regret for the inconvenience caused by the Walmart+ app. Please contact us at https://survey.walmart.com/app",
      "version": "24.3",
      "thumbsUp": 18,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "3e8c1980-10be-4291-a717-0fa9444bfcfd",
      "userName": "Gene Olson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJrR1OHvFjE9Uv8xfE1erx-zvBuXI9PNzdIIzinGkoD=mo",
      "date": "2024-01-30T04:32:01.303Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=3e8c1980-10be-4291-a717-0fa9444bfcfd",
      "title": null,
      "text": "If a significant portion of your order is undelivered because it was forgotten, not labeled out of stock, and you've tipped a percentage of the order to the driver, the customer is being cheated even if the cost of the items are refunded. And if you try to reorder what wasn't delivered for less than 35 dollars, a shipping fee is added, not to mention tipping on the same items twice and waiting another day for a delivery time. Feels like a scam that has the customer pay more for their mistakes",
      "replyDate": "2024-01-30T05:25:32.843Z",
      "replyText": "We acknowledge the trouble caused. Please contact us at walmart.com/help.",
      "version": "24.2.1",
      "thumbsUp": 28,
      "criterias": []
    },
    {
      "id": "4e31ba9a-49a2-4c3d-8c78-7ed315146134",
      "userName": "April Norman (AprilNO1973)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXbKuTRZOo6kodSC8YeXtLTrfphJYytjxatFD_RCODf-Q",
      "date": "2024-01-21T23:02:56.192Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4e31ba9a-49a2-4c3d-8c78-7ed315146134",
      "title": null,
      "text": "I need the app installed on the rest of my families phones and it keeps saying we have the wrong password used to many times and it locked account, the app on my personal phone is fine, it's just their phones. We need it on multiple phones so everyone can contribute to the grocery list before going to pick it up. Otherwise the app works pretty well, but still glitches everything I use it. Yesterday it kept telling me my order was ready for pickup over and over.",
      "replyDate": "2024-01-22T01:10:13.870Z",
      "replyText": "Your input is crucial. We're committed to fixing the password errors and improving the app's functionality. Please provide us with more info at https://survey.walmart.com/app",
      "version": "24.1",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "4d56364c-50db-4abc-a44c-8bb70a30c156",
      "userName": "Z",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWFh551VWYDTBEijgksm-Sp1mWCu09RiMx20T1J2ybvDwQ",
      "date": "2024-01-20T17:09:37.333Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4d56364c-50db-4abc-a44c-8bb70a30c156",
      "title": null,
      "text": "I like shopping in the app vs in store but for some reason it's always incredibly difficult for me to see or edit my order once I've placed it. It goes away from the screen completely and find myself tapping around everywhere to find it again to update replacements. I feel there should just be a \"my orders\" or to show somewhere in the cart that there's an active order already.",
      "replyDate": "2024-01-20T21:35:10.911Z",
      "replyText": "Thank you for sharing your experience with us. If you have any specific suggestions please feel free to share your thoughts in our survey https://survey.walmart.com/app",
      "version": "24.1",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "da977ca6-79c0-4270-915f-a433504d7a14",
      "userName": "Heather H",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJU7yvhj7Y8Ky7_thd5abAwilQdqM3gVxkkBu92T297=mo",
      "date": "2024-02-14T19:23:31.808Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=da977ca6-79c0-4270-915f-a433504d7a14",
      "title": null,
      "text": "I like almost everything about the app except the final shopping list when you place a pickup or delivery order. I used to live in a state that had Kroger grocery stores and on their app you could type notes and instructions about substitutions, sizes, other flavors, etc. It's SO FRUSTRATING to only get one substitution choice and the shopper NEVER picks one you want. Just give us a couple of lines for optional notes on our shopping list!!!!!!",
      "replyDate": null,
      "replyText": null,
      "version": "24.5",
      "thumbsUp": 20,
      "criterias": []
    },
    {
      "id": "c516e2d2-a235-4318-9dd2-68b632ac4891",
      "userName": "Bryon C",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJKEwkq1th1X0Dcd6nAn4QZQVbZTKv_MEjMs6NTZA1O=mo",
      "date": "2024-01-23T17:58:32.917Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=c516e2d2-a235-4318-9dd2-68b632ac4891",
      "title": null,
      "text": "Still unable to check in at pickup with a second device. My wife orders groceries in her phone, no way for me to say I'm here to pickup. The phone number on the sign goes to VM does not go to pickup as it says. .Best feature is finding where they hide things in the store. They contacted me shortly after this review and updated the app locations. Thank you.",
      "replyDate": "2023-06-14T10:58:46.688Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues while using the Walmart app. We’ve shared your issue with our App Development Team. Please provide with more info at https://survey.walmart.com/app",
      "version": "24.1",
      "thumbsUp": 44,
      "criterias": [
        {
          "criteria": "vaf_phase1_good_coupons",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_recommendations",
          "rating": 3
        }
      ]
    },
    {
      "id": "597869e2-e884-4d71-83af-6d621eb21a0a",
      "userName": "Susan Slater",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocInP_S_BwzGVJoh_Wa3IlXSmtADIW-20PYsOzjGFaXI=mo",
      "date": "2024-02-08T14:54:57.246Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=597869e2-e884-4d71-83af-6d621eb21a0a",
      "title": null,
      "text": "The website can be hard to navigate. Can't just type in a product to find it, you have to wade through all the products. Has a tendency to freeze and wastes your shopping time. That is another issue- why can't walmart give you 2hrs hours to shop, especially when website crashes. Shoprite gives you 3. The good thing was that it saved my order. Walmart please fix these issues, my time is precious",
      "replyDate": "2024-02-08T15:31:54.193Z",
      "replyText": "Thanks for sharing your experience with us. We regret you’ve had issues with website not responding properly. Please contact us at walmart.com/help.",
      "version": "24.3",
      "thumbsUp": 60,
      "criterias": []
    },
    {
      "id": "a63bfef8-8aab-41a3-8273-d5228a363283",
      "userName": "Del Jones",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXceziIilrmvLO3tqnSqoHI1FJKCbE1rFr-vrc7J-Jcv7k",
      "date": "2024-01-03T19:00:42.335Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=a63bfef8-8aab-41a3-8273-d5228a363283",
      "title": null,
      "text": "I've received many items that were either spoiled, smashed bread, mashed up boxes for my chicken pies, and things that were very close to expiration (milk) that I didn't use. Bad fruit and vegetables. I just want whoever prepares my order to fix it like they were going to eat it. Have some integrity when you do your job. I'm unable to come in the store and walk, but I'm always very nervous about what condition my order will be in. It's just something all buyers should think about.",
      "replyDate": "2024-01-03T19:26:06.667Z",
      "replyText": "We understand that your experience was not satisfactory, and we want to ensure that our users don't encounter such experiences. We request that you get in touch with our customer support at https://walmart.com/help for better assistance.",
      "version": "23.49.2",
      "thumbsUp": 25,
      "criterias": []
    },
    {
      "id": "a819c069-1e3f-4b3b-83a8-a442e75d6aa1",
      "userName": "Alyssa M",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVDs-DR_bi57ZGxHiP6mS1HIaNFuoOpCkNwqoqK9pfK1vQ",
      "date": "2024-02-26T04:40:34.991Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=a819c069-1e3f-4b3b-83a8-a442e75d6aa1",
      "title": null,
      "text": "I miss in previous versions of the app when you could search around at other stores for availability. and now it doesn't always update where I am to the correct store either. like it'll show that I'm at the store I was at a couple stores ago and getting that to update is near impossible without clearing the storage on the app. at least that I have found and that's really freaking annoying. and availability is quite often wrong which is super annoying as well. other than that I like the app!",
      "replyDate": "2024-02-26T04:56:29.148Z",
      "replyText": "We appreciate you telling us about your experience. We regret that you experienced problems with the Walmart app. Please visit https://survey.walmart.com/app to supply us with further information.",
      "version": "24.6.2",
      "thumbsUp": 43,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "4323f631-e4ea-4aab-bc41-9757fbb3ea46",
      "userName": "Vann (V)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWpgWUEps2hP7S32mABIs8T1rFvQFo2himjQ44CQyRH3G0",
      "date": "2024-01-26T04:30:33.785Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=4323f631-e4ea-4aab-bc41-9757fbb3ea46",
      "title": null,
      "text": "I have been logged out 12 times in the last 5 minutes now because \"session has expired\" this has literally never happened. I uninstalled and reinstalled and literally right after I signed in I was signed back out with the same \"your session has expired\" message. what is it with the developers that they constantly are making the app somehow even worse? Figure it out already. This is ridiculous.",
      "replyDate": "2024-01-26T04:49:00.143Z",
      "replyText": "Regret for the app issue. Please reach out to us at https://survey.walmart.com/app.",
      "version": "24.3",
      "thumbsUp": 24,
      "criterias": [
        {
          "criteria": "vaf_apps_attribute_delivery_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 2
        }
      ]
    },
    {
      "id": "b2251709-9a6d-4975-8821-3a0368cd7865",
      "userName": "Elena",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVpVzHf3bHn80QBOGM6HaUgXO3u9DIcYXKNy00WhbXFQ_w",
      "date": "2023-12-31T15:20:30.364Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=b2251709-9a6d-4975-8821-3a0368cd7865",
      "title": null,
      "text": "I have done all 3 tasks to be eligible for Walmart+'s $10 walmart cash bonus, but even while I am IN THE APP it says I have not completed that one, so no Walmart cash for me. I completed all troubleshooting tasks given to me by customer support and it still isn't working. This is ridiculous. The app should be able to detect that I'm literally actively using it. I've reinstalled it 5 times to no avail and cleared cache and data repeatedly, even restarting my phone. Won't be renewing Walmart+.",
      "replyDate": "2023-12-31T16:38:24.460Z",
      "replyText": "We're here to assist you. Confirm that you have met all the eligibility criteria for the $10 Walmart cash bonus, as outlined in the promotion details. Reach out to https://www.walmart.com/help, providing us with specific details about your completion of the tasks and the challenges you've faced. We will be better equipped to assist you further.",
      "version": "23.49.2",
      "thumbsUp": 27,
      "criterias": [
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        }
      ]
    },
    {
      "id": "876c0c61-9f20-4355-914e-ad110c036fe4",
      "userName": "Mister Messenger",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX25zcnyoCR-IQBgkQq3s-Hm2bSHBsXFWpT4H866srP78c",
      "date": "2024-02-06T08:08:31.137Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=876c0c61-9f20-4355-914e-ad110c036fe4",
      "title": null,
      "text": "This app always crashes while I'm using it. I have to type what I'm searching for 10× before it finally brings up the search instead of a list of departments. I'm on the most recent update and this issue has been present for the past 2 or 3 updates. It's frustrating trying to even navigate the app without it crashing. Whoever Walmart pays to develop and update these apps needs to fix this problem or else many will switch retailers. This is ridiculous, not even Amazon crashes this much.",
      "replyDate": null,
      "replyText": null,
      "version": "24.3",
      "thumbsUp": 22,
      "criterias": []
    },
    {
      "id": "cead2e3a-6b98-4fc4-ab5c-e7e6ac587ae5",
      "userName": "Zachary Evergray",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW3hyJlKDYCkWjfXwALwaWDSls1ShzevEc8kQ5r6cR82w4",
      "date": "2024-02-06T22:46:59.402Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=cead2e3a-6b98-4fc4-ab5c-e7e6ac587ae5",
      "title": null,
      "text": "The good - Aisle locator, price checker (since Walmart can't be bothered to staff their stores beyond a bare-bones overworked minimum any more). Nice to keep receipts without having to physically keep them. The bad - The CONSTANT Walmart+ popups (and additional popups for 'events') EVERY time you open the app. The in-stock is usually incorrect, but that's more due to Walmart's understaffing issues. Lack of clarity whether an item is from a third-party seller or not. I hate this app tbh.",
      "replyDate": "2024-02-07T03:30:27.169Z",
      "replyText": "We'd like to know more details you mentioned regarding our app, Zachary. Please reach us at https://survey.walmart.com/app",
      "version": "24.3",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "e601460f-6e74-4de1-bcbd-8e8e3a592dbc",
      "userName": "Jessica Quint",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJUnY2cJqc0TPgwbaLICLifygtjGAzANndwFBYXQLii=mo",
      "date": "2024-01-02T22:30:46.609Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.walmart.android&reviewId=e601460f-6e74-4de1-bcbd-8e8e3a592dbc",
      "title": null,
      "text": "My last review was to ask for a no bags option and thankfully they have a no bags option now. However, every time I use the app to do a grocery pickup it bugs out. I go from being registered in my spot with my car color on it and then suddenly I'm not registered at all. So something which should have taken 5 minutes to pick up and stop taking 20 minutes because the bloody app doesn't work. Not only that, staff are marking things is delivered before we even receive them, which is really awful.",
      "replyDate": "2023-01-26T16:52:30.718Z",
      "replyText": "Thanks for sharing your experience with us. We’re sorry you’ve had issues while using the Walmart app. We’ve shared your experience with our App Development Team. They release new app features each week based on customer feedback like yours. Make sure you check for app updates regularly.",
      "version": "23.49.2",
      "thumbsUp": 19,
      "criterias": [
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_in_store_navigation",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_gift_cards",
          "rating": 3
        }
      ]
    }
  ],
  "nextPaginationToken": "CmsKaTAsMTAwMTAwMC43Mzc3NDMxMzkzLDk0MTI2MjEwNDE5MiwiaHR0cDovL21hcmtldC5hbmRyb2lkLmNvbS9kZXRhaWxzP2lkPXYyOmNvbS53YWxtYXJ0LmFuZHJvaWQ6MSIsMSxmYWxzZQ"
}