{
  "data": [
    {
      "id": "0f4a6f17-368c-4596-916d-7dd4afd6519f",
      "userName": "Josh Rehm",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLVuNm5_bBKY0lOh8KjeJZuXqRjYFw3Hq11e1iNe436=mo",
      "date": "2024-03-10T21:40:53.191Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=0f4a6f17-368c-4596-916d-7dd4afd6519f",
      "title": null,
      "text": "Down to one star. VPN usually works when it connects. However, the number of times network access slows or stops working for a few minutes is only increasing. Connecting is sometimes very slow, as well. And the ads they push through the notification bar to refer a friend can't be disabled in app. Support told me they would disable them on their end, but apparently they either didn't, or they have since re-enabled them. I'll be keeping an eye out for an alternative. Proton seems promising.",
      "replyDate": "2023-06-14T21:41:15.530Z",
      "replyText": "Hello, Josh. We can turn off the ads for you. Please reach out to our support team via live chat at support.nordvpn.com -D.I",
      "version": "6.30.1",
      "thumbsUp": 142,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_visually_good",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 3
        }
      ]
    },
    {
      "id": "a04660d5-6f4f-47a4-8c70-104001f93c36",
      "userName": "- EHC",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWfxCi_39ECvIKWvuR0Z6skiIqvKTE4ghrhw88qKNKslns",
      "date": "2024-03-03T23:17:00.900Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=a04660d5-6f4f-47a4-8c70-104001f93c36",
      "title": null,
      "text": "Update: Do yourself a favor and try any other VPN. Very disappointed in Nords service and support. I'm not the only one; it's a very common issue. Constantly disconnects, and takes forever or times out, then won't re-connect. Very often times or when trying to connect to any server. Tried all of Nords suggestions to no avail. Often, when it does connect, throughput is slow, maybe 30% slower than without.",
      "replyDate": "2024-01-20T19:55:38.476Z",
      "replyText": "Hello. We're sorry to hear that your issue is still unresolved. Could you please update your review with the Ticket ID you’ve received from our customer support? We’ll check your inquiry and provide you with further assistance. -D.I",
      "version": "6.29.1",
      "thumbsUp": 157,
      "criterias": []
    },
    {
      "id": "47e8decb-a29c-46d5-9a05-35f3932ce103",
      "userName": "Ichabod Van Dam -Wu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUSbumRtQVrsJveMOfuFpVK39nGcCTDDOVHyjGIcTD0eNk",
      "date": "2024-03-15T07:21:45.694Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=47e8decb-a29c-46d5-9a05-35f3932ce103",
      "title": null,
      "text": "VPN will not connect! Let me be more clear.. when I hit the quick connect button, the button does not respond. It does not do anything. Even if I try connecting directly to a particular city, I get the same reaction. It's the craziest thing I've ever seen. I have used NordVPN in the past and haven't had this issue. The only thing I've changed since then and now is I went from an Apple device to a Pixel. Other VPN's do not obfiscate ip on Google pixel when using Google to search.",
      "replyDate": "2024-03-15T04:32:47.937Z",
      "replyText": "Hello. Please try changing the VPN protocols within our app settings and checking if the issues persist. If you need any further assistance, do not hesitate to contact us via live chat at support.nordvpn.com. Our team is active 24/7. -K.T",
      "version": "6.30.1",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "ec6eec36-8080-475a-a25c-cc13dfbc1d4e",
      "userName": "Jack Neson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX5fJi0y1wwkcAZhcDkAN8CghWpWV53cbAPcw2auILfEks",
      "date": "2024-03-04T16:13:07.421Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=ec6eec36-8080-475a-a25c-cc13dfbc1d4e",
      "title": null,
      "text": "These guys provide one of the best vpn services out there. They also provide a secure place for passwords and a secure way to transfer small files between devices. the only significant problem I have is when running the vpn 247 all day all night it will either lose connection or disconnect. Which when it does it won't reconnect unless I restart the app pr my phone.",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 43,
      "criterias": []
    },
    {
      "id": "6bd7a169-8e82-4b57-bb83-0769a87643bf",
      "userName": "scott olson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJD05J9ZrMGT8Wjh7vioJ4vggmKPBtaWBwIFxp8QdOe9A=mo",
      "date": "2024-02-19T18:50:49.530Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=6bd7a169-8e82-4b57-bb83-0769a87643bf",
      "title": null,
      "text": "Connection keeps dropping when phone goes to sleep. All settings are set to unrestricted data and battery. EDITED 2/17: Found app blocker in settings to be the culprit. Turn off all blocks. But the key is to restart the phone after making the changes. It won't take effect until a restart occurs. So far no drops in either battery saver or regular modes. Overnight the connection seems to stay as well.",
      "replyDate": "2024-02-17T21:55:11.790Z",
      "replyText": "Hello there. We’d be happy to help and take a closer look into your case. Please make sure to contact our support team at support.nordvpn.com, they are available 24/7. -G.M.",
      "version": "6.28.3",
      "thumbsUp": 189,
      "criterias": []
    },
    {
      "id": "23d16516-0448-4e85-a016-3f02d672280c",
      "userName": "Joel C",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXwWsKTlKZPH8laLTpHpAuPdMAfQugScE_ljap9QeD5Pg",
      "date": "2024-02-13T01:14:22.849Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=23d16516-0448-4e85-a016-3f02d672280c",
      "title": null,
      "text": "Not as good as the desktop version, there are things I simply cannot do like select a specific server from certain countries. I can only do \"Auto\" mode for them which often fails to connect. Especially after closing a connection and attempting to connect to a different one I am often unable to connect at all, it just keeps spinning. I also wish it displayed server load as a percentage.",
      "replyDate": "2024-02-13T01:33:10.900Z",
      "replyText": "Hello, Joel. You can connect to a specific server using the search bar of our application, there you should also see server's load. As for connection issues, try switching your connection protocol to UDP and check if the issue persists. Feel free to contact us at support.nordvpn.com if it still does not work. -A.Z",
      "version": "6.27.3",
      "thumbsUp": 77,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 2
        }
      ]
    },
    {
      "id": "2d457cbf-bab6-441e-8e17-04c5ca48e568",
      "userName": "John Montana",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWpoXhDCi9WwTLwXuWfzux9vo_1pdk2KIwUhoA5R5geXoOn",
      "date": "2024-03-10T20:46:08.910Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=2d457cbf-bab6-441e-8e17-04c5ca48e568",
      "title": null,
      "text": "Recent updates are absolutely terrible! More often then not my phone will not connect to VPN or meshnet. Have similar issues with PC version as well after recent updates. At this point this has become almost useless. Probably not going to renew subscription. Really disappointed. This used to be an excellent VPN.",
      "replyDate": "2024-03-10T21:25:07.850Z",
      "replyText": "Hello! We’re sorry to hear about the experience you had with our VPN service. Please contact our customer support team at support.nordvpn.com, and they will help you out in this situation. Let us know how it went afterward! -D.I",
      "version": "6.30.1",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "4387781a-9008-42e4-8b49-91532efe6c00",
      "userName": "Joshua Rinne",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVd58u7W0NGamzf2W9zX0sOYIa5eZ8chwNoh28bh9EGTwo",
      "date": "2024-02-08T23:39:14.677Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=4387781a-9008-42e4-8b49-91532efe6c00",
      "title": null,
      "text": "SCAM ALERT! I wanted to try this for 7 days, selected the 1 year subscription, just in case I liked it in order to save money, and ended up canceling my subscription after less than 10 minutes. I still got charged, even though the \"sign-up\" said there was a 7 day trial period. I want a refund! Using the VPN did NOT work for what I was wanting it for. I would've rated this a ZERO if that were an option.",
      "replyDate": "2024-02-09T01:25:12.722Z",
      "replyText": "Hello! We would be more than happy to check your situation and help you out. For assistance, please contact our team live chat at support.nordvpn.com or via X.com and we will help you immediately! Our team is accessible 24/7. - K.S",
      "version": "6.27.3",
      "thumbsUp": 237,
      "criterias": []
    },
    {
      "id": "d3398e89-3cf5-4ae9-8e28-74fe66d72b3a",
      "userName": "grinnin moon",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK3JOfqxMpcADFc2CihnUW48n5SIbj_6-vH14bJ3kfa=mo",
      "date": "2024-03-02T20:51:45.411Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d3398e89-3cf5-4ae9-8e28-74fe66d72b3a",
      "title": null,
      "text": "The app is great. I had to disable notifications though. I pay for the service and should not be getting solicitations through notifications. The ads are the ONLY notifications I receive. Nord says it's important that I allow notifications for important info. The info, to buy more Nord and refer friends are not important notices. Instead, it's annoying solicitations. It's pathetic that I am forced to pay for a service that strong arms me with ads or go without \"important notifications\".",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "73359b75-7113-4990-bd16-1d78eff51758",
      "userName": "Alex Reguera",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUOtXqax1tHWmcp436EdwpYPdDmxEIE0fNnJ4-skM3Nrss",
      "date": "2023-12-30T14:29:52.551Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=73359b75-7113-4990-bd16-1d78eff51758",
      "title": null,
      "text": "The app on the phone makes your Internet browsing REALLY slow and sometimes many sites don't load at all, the only workaround is disconnect from the app! In the PC it's the same and sometimes you can even connect to the VPN server and you have to restart the PC. I paid for a 1 year subscription that I'm not planning to use. Totally disappointed.",
      "replyDate": "2023-12-30T14:50:56.119Z",
      "replyText": "Hello. Please note that there are various factors affecting your connection speeds. For starters, you may try switching between UDP, and NordLynx connection protocols in the settings of our VPN app. If it doesn't help, drop us a line at support.nordvpn.com and we'll help you out in more detail. -L.L.",
      "version": "6.25.2",
      "thumbsUp": 188,
      "criterias": []
    },
    {
      "id": "984e4b51-440b-4516-9105-c3b3e586e25c",
      "userName": "Andrew Miller",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIv_8FY9HExvQFsmor18ELCTXQAc7j5FFh3yzkEiwac=mo",
      "date": "2024-02-28T10:03:15.880Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=984e4b51-440b-4516-9105-c3b3e586e25c",
      "title": null,
      "text": "Updating on 2/28/23 to emphasize what an absolute horror show this software is. It does *nothing* well. The only thing it does sporadically well is block all internet. Constantly interrupting and shutting down WhatsApp calls, web site access, etc. The main reason it fails sometimes to prevent me from accessing the internet at all is because the software just drops without any warning, providing no protection, as if I had no VPN at all. Avoid this software like the plague. *Run* from it.",
      "replyDate": "2024-02-28T11:34:17.979Z",
      "replyText": "Hi there! You may consider configuring your VPN app's settings to use either TCP or NordLynx connection protocols to see if it enhances your connection. If you don't observe any improvement, don't hesitate to reach out to us at support.nordvpn.com for additional assistance. -L.L.",
      "version": "6.29.1",
      "thumbsUp": 36,
      "criterias": []
    },
    {
      "id": "96ce4459-7297-4215-bfb2-2200c1eed655",
      "userName": "Dave Hoppe",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXJuvD1GDztA_H-3YnpECyM_GAvj1TRYRkCpXMMA5vXdcAy",
      "date": "2024-02-09T19:36:44.509Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=96ce4459-7297-4215-bfb2-2200c1eed655",
      "title": null,
      "text": "Continuously getting worse on a pixel 8 pro. Set to no battery / bandwidth limiting and excluded from focus mode it tries to reconnects each time I wake the phone. Tries is the key word as it never does. Dropping from my previous 5 start review. The service connection used to be consistent and functional on mobile devices, but has decreased over the years I've used this. I am constantly having to manually reconnect while in an auto connect mode as all app connectivity just stops.",
      "replyDate": "2024-02-09T23:28:55.588Z",
      "replyText": "Hello. Sorry to hear that you had issues while using NordVPN. However, do not hesitate to contact our customer support team whenever you have any issues with our apps. The fastest way to reach them is via live chat at support.nordvpn.com. -G.M.",
      "version": "6.27.3",
      "thumbsUp": 114,
      "criterias": [
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 2
        }
      ]
    },
    {
      "id": "a4ea1766-78f0-4165-90f2-418b3c2df35f",
      "userName": "steve shields",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW9GlijtBBGaXyIZv5z19xc3lv41H-Kizj2dm6nZJpFn3I",
      "date": "2024-01-15T21:08:44.720Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=a4ea1766-78f0-4165-90f2-418b3c2df35f",
      "title": null,
      "text": "Good when it connects... 90% of the time, this is a great app. But frequently, especially when you're on a public Wi-Fi, it can't figure out how to connect. This is the case on the Android and even more on a PC. The tech support used to be fast. But it's slow to respond. Usually, by the time they have it resolved, you're ready to move on from that public Wi-Fi spot. A VPN should not connect to 90% of the time. And it should connect easily on public Wi-Fi - where it's needed most",
      "replyDate": "2024-01-15T22:26:41.481Z",
      "replyText": "Hello. We’re sorry to hear you have issues with our app. If you give our customer support team another chance, they will do their best to resolve the issue you’re having. Feel free to contact them at support.nordvpn.com — they are online 24/7. -D.I",
      "version": "6.26.2",
      "thumbsUp": 159,
      "criterias": []
    },
    {
      "id": "e3476df9-79ae-4218-baee-61be73e00a27",
      "userName": "A",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJmLKEQb-9PRHzwL97mai9NO_zO77neSPD2JEnvQLL9=mo",
      "date": "2024-02-22T00:24:22.834Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=e3476df9-79ae-4218-baee-61be73e00a27",
      "title": null,
      "text": "The worst VPN service and app I've ever used. Constant disconnects that take forever to reconnect. Inconsistent speeds. Pages are slow or don't load. Apps need split tunneling when I didn't need to do this with other VPN services. In-app ads. No standard servers and always use P2P servers. Same with their Windows app but with DNS leaks. How much worse could a service be. As I'm writing this review, the VPN disconnects. Had enough of this BS VPN. Regret switching from Mullvad. DO NOT RECOMMEND!!!",
      "replyDate": "2024-02-22T02:41:11.104Z",
      "replyText": "Hello. We are sorry to hear about the issues. We would recommend switching the VPN protocol within our app settings to OpenVPN UDP and checking if the situation improves. If you experience any further issues, our team is always ready to help you out via live chat at support.nordvpn.com. -K.T",
      "version": "6.28.3",
      "thumbsUp": 30,
      "criterias": []
    },
    {
      "id": "5b7cd6a5-6855-4f83-ae4b-7983e3977d5d",
      "userName": "Loni Q",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXUjUxhQTGEXPPjz1rw9GX5quzA0QZEN3VJKMQ0JSzjsA",
      "date": "2024-02-11T19:41:38.737Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=5b7cd6a5-6855-4f83-ae4b-7983e3977d5d",
      "title": null,
      "text": "Worked great at first but recently it is blocking almost every website that I visit. I am having to manually add websites to the excluded list but even when I do, some get blocked again. I uninstalled it from my laptop and everything worked fine. I added it back and I have the problem again so I know it's the VPN. I am so frustrated at this point and will not be able to renew my membership.",
      "replyDate": "2024-02-11T20:58:10.685Z",
      "replyText": "Hello. Various services tend to block VPN connections. However, there is a workaround to access such services regardless. Hence, it would be best to contact our customers’ support team, for them to provide you assistance on their accessibility. Our team is available 24/7 at support.nordvpn.com -D.I",
      "version": "6.27.3",
      "thumbsUp": 30,
      "criterias": []
    },
    {
      "id": "6885460a-7b3d-4656-9fdc-8b444b26c84b",
      "userName": "William Zimmerman",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX4yxFcHmZtL6DWetnBPWvVJGb7HQOhBvYao3ucVHBZZDI",
      "date": "2024-01-02T18:28:15.390Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=6885460a-7b3d-4656-9fdc-8b444b26c84b",
      "title": null,
      "text": "Very solid VPN. NordLynx is excellent, adding very little in the way of overhead while maintaining solid speeds. MeshNet is excellent, and easily my favorite feature, Allowing me to connect to and use local devices while away from home. I've been a Nord Security customer for many years and I'm always very happy with the rate of innovation. That's what you get with NordVPN.",
      "replyDate": null,
      "replyText": null,
      "version": "6.25.2",
      "thumbsUp": 83,
      "criterias": []
    },
    {
      "id": "77dd6447-c00d-4a87-8ee2-296bda1b4657",
      "userName": "C Coleman",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLM5eaMwKcIMPkfGC44fy-KqttIvgHfItzAhi8zSlep=mo",
      "date": "2024-01-14T05:19:00.920Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=77dd6447-c00d-4a87-8ee2-296bda1b4657",
      "title": null,
      "text": "New customer and very unimpressed - it's so bad I'm canceling. App frequently throws up switching between countries to the point where it totally kills your connection. You either have to go in and out of airplane mode or change the auto connect settings (sometimes several times per day) to force it to disconnect. Don't waste your time.",
      "replyDate": "2024-01-14T06:47:09.519Z",
      "replyText": "Hello. We are sorry to hear that. Please try altering between connection protocols in the settings of your NordVPN application. Feel free to reach out to our support team at support.nordvpn.com if the situation remains the same. -A.Z",
      "version": "6.26.2",
      "thumbsUp": 97,
      "criterias": []
    },
    {
      "id": "4620da4f-5963-4e6c-91f4-8eaa20ee8982",
      "userName": "Smitty J",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL-I2mNIrs7QrLy7jb03p9wzPiClfkbWGwXXD3CLU9n=mo",
      "date": "2024-03-05T10:18:25.310Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=4620da4f-5963-4e6c-91f4-8eaa20ee8982",
      "title": null,
      "text": "App won't update after it notifies an update is available. This kicks you offline, until you figure out that is the problem. SPECS: I should note that I'm running Android 11 OS. This could be the problem, but other apps, such as Chase, ping you when an update is available, AND takes you to the Google Play store to update.",
      "replyDate": "2024-02-19T19:08:41.651Z",
      "replyText": "Hello. Do not hesitate to contact our customer support team agents at support.nordvpn.com. They will take a look at the whole situation and provide you with further assistance. Our team is available 24/7. -N.L.",
      "version": "6.28.3",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "1c5ecda7-d969-4c81-9da4-cd86ea80192d",
      "userName": "TB Slim",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX49r97dVwibqLlbiXdqmHOFtsfx-n-UeYdbIrKabwpLko",
      "date": "2024-01-23T14:28:09.360Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=1c5ecda7-d969-4c81-9da4-cd86ea80192d",
      "title": null,
      "text": "I have always wanted to like this app. It was a bummer when they removed trusted networks from the mobile app but left it in the windows version. Now today when I need it in a coffee shop, it requested a log in. I had to shut off wifi and open my password manager with cell data. Then it didn't recognize my password and I had to create a new one. I seriously doubt I will renew my subscription.",
      "replyDate": "2024-01-23T14:50:56.971Z",
      "replyText": "Hello. It would be great if you contact our customer support team at support.nordvpn.com. Our team is ready to check on the situation in more detail right away. -L.L.",
      "version": "6.27.2",
      "thumbsUp": 71,
      "criterias": []
    },
    {
      "id": "d51147d2-8093-42ba-80e5-b11c47c7e30c",
      "userName": "Scott C",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWdjDLYnibQWIdNo0SKFT0iZz3tENKfiYLOJY50ycrUfz4",
      "date": "2024-01-12T18:44:55.693Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d51147d2-8093-42ba-80e5-b11c47c7e30c",
      "title": null,
      "text": "It's set as always on, and pretends to be using VPN. One look at data usage can see the data isn't reported as being from by Nord VPN in Android data usage, isn't being tunneled at all! Switched from another major VPN, data usage when on was always through the VPN app. I've used 35Gb mobile data, Nord is 2.41Gb of it. I can't pause it, set as always on, but worthless it seems. Great popups, ads, extra unwanted intrusive features I have no interest in not network related.",
      "replyDate": "2024-01-12T21:54:46.111Z",
      "replyText": "Hello! It would be great if you could reach out to our customer support team at support.nordvpn.com. Our agents will check on your inquiry in more detail at any time as they are available 24/7. -D.I",
      "version": "6.26.2",
      "thumbsUp": 49,
      "criterias": []
    },
    {
      "id": "d2c5424f-9a03-409f-bd5c-26bc9d6520e2",
      "userName": "Daniel Cox",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLoFY9nqrAYL8rRN9ryryEQFwv_dek8YNOv5xAeqmj_=mo",
      "date": "2024-01-27T00:18:21.509Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d2c5424f-9a03-409f-bd5c-26bc9d6520e2",
      "title": null,
      "text": "This is the 583rd VPN I have tried I think. And it's the first one ever that is actually usable. I finally realized all free unlimited vpns are worthless. So I subscribed to Nord and have been connected ever since with no problems. If anything it feels faster now. It has more settings than others which I love, and multiple kinds of special servers. I put it on all my devices including my fire stick. I preciate it!",
      "replyDate": null,
      "replyText": null,
      "version": "6.27.2",
      "thumbsUp": 81,
      "criterias": []
    },
    {
      "id": "6dd8e335-0385-4ca5-93d6-a4cb68a0eb28",
      "userName": "Brad McKnight",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUQoL2GjJXeDjW_duCjZFFcny7sI5RcN4buheA3w3QFQu8",
      "date": "2024-01-18T02:47:34.501Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=6dd8e335-0385-4ca5-93d6-a4cb68a0eb28",
      "title": null,
      "text": "I've dropped my review from 5 to 2. I do not appreciate paying a premium price for a product to be shown ads. If this is still a thing when my renewal is up, I'll be switching to a different VPN provider. Edit: 17 Jan 2024 I'm still getting ads and referral notifications. I'll be switching VPN providers on renewal this is ridiculous!",
      "replyDate": "2024-01-18T03:28:45.488Z",
      "replyText": "Hello there. We would strongly suggest contacting our support team at support.nordvpn.com and they will be able to disable notifications. Our team is accessible 24/7. - K.S",
      "version": "6.26.2",
      "thumbsUp": 39,
      "criterias": [
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "b5242256-aa98-4163-9397-7f413f4c5f63",
      "userName": "Mark Bratton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIhCtMzumSdRpOIhQdvQgB2exXZP5I_yVUTWTLhdwg=mo",
      "date": "2024-02-02T21:37:38.659Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=b5242256-aa98-4163-9397-7f413f4c5f63",
      "title": null,
      "text": "Nor arbitrarily disconnects WITHOUT any notification of that occurring. On its own, it randomly gets \"stuck\" in these \"Connecting...\" attempts, leaving my device unprotected until I HAPPEN to notce that it's had a Disconnection/attempt RE-connectiin cycle, and then RE-connect it myself, manually. Being stuck in that cycle prevents other aps from functioning because they can't access the Internet.",
      "replyDate": "2024-02-02T22:10:57.273Z",
      "replyText": "Hello. We’re sorry to hear about the issue you’re having. You may try switching between TCP, UDP, and NordLynx connection protocols in the settings of our VPN app and then check if the issue persists. If it does, contact us at support.nordvpn.com, and we’ll help you out further. -D.I",
      "version": "6.27.2",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "bb19773b-0c5a-43a7-b99f-e73c7c299233",
      "userName": "pink candy",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXtUnNFRgLQxO9ZIQiDsNiUtJgJryump5dK9RDDMiku0A",
      "date": "2024-02-02T00:56:58.960Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=bb19773b-0c5a-43a7-b99f-e73c7c299233",
      "title": null,
      "text": "Now that I'm near the end of my 2 year subscription, the only option is a 1 year auto renewal at twice the price. Emailed CS to inquire; only option is cancel both, repurchase 2 year Plus Plan for discount, but only after they both expire. Way to NOT retain customers. Not happy. P.S.: no export passwords option on Nord Pass for mobile app per CS; only on PC version. Going with Bitdefender VPN and Password manager.☹️",
      "replyDate": "2024-01-26T14:52:13.137Z",
      "replyText": "Hello. Thank you for the feedback, it will be transferred directly to the responsible team. If you have any further inquiries, do not hesitate to contact our customer support team at support.nordvpn.com anytime! -L.L.",
      "version": "6.27.2",
      "thumbsUp": 166,
      "criterias": [
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "a3943a7a-e031-469d-8753-a096410add30",
      "userName": "Axel Lopez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJPJTthuyzOm5kCdLmkOeYauWGCHHfCnckiGCn5VH9O=mo",
      "date": "2023-12-26T23:40:06.733Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=a3943a7a-e031-469d-8753-a096410add30",
      "title": null,
      "text": "When it, it works, but it is very inconsistent. My wifi is not the issue because when I disconnect the VPN, everything works well again. I have to try reconnecting or changing protocols at least 20 times a day because something won't load at all (youtube, browser, etc.). These outages are a pain in the butt but again, when it works, speed is never an issue.",
      "replyDate": "2023-12-27T01:11:17.863Z",
      "replyText": "Hello! We would love to check your situation more closely! For troubleshooting, please contact our team live chat at support.nordvpn.com. - K.S",
      "version": "6.24.1",
      "thumbsUp": 271,
      "criterias": []
    },
    {
      "id": "67cb8879-5053-4e3b-98ee-3f2396701534",
      "userName": "Bea Njokki",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVteGNdJVhC88eoZI19gaNp7SM-XcVjOwtaBENERJBrjo0",
      "date": "2023-12-28T06:39:40.299Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=67cb8879-5053-4e3b-98ee-3f2396701534",
      "title": null,
      "text": "Best VPN ever. I've sampled other VPNs out there basically due to this one being very expensive and the customer support not being very supportive, but I still hang around. Been 5 years, and the phone app works quite well. Four stars because it never really worked for me on the laptop, it disconnects and disconnects you from the internet. Or something like that. And like I said, customer support could do with some improvement.",
      "replyDate": null,
      "replyText": null,
      "version": "6.24.1",
      "thumbsUp": 177,
      "criterias": []
    },
    {
      "id": "b42eed71-cc02-4d26-81a8-21e81003ec22",
      "userName": "Lana Franklin",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJQee7TgSO0x8GXYUo0pQTTUJ_d0v-P4wI2d4ALrQVH=mo",
      "date": "2023-12-14T20:43:27.951Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=b42eed71-cc02-4d26-81a8-21e81003ec22",
      "title": null,
      "text": "only used it a short time, but I like how easily it handles things for you after you make sure your settings are correct. The only thing I don't like is when I upgraded to windows 11, the shield icon doesn't change colors anymore indicating you are connected or not. Before I could look at theshield and I knew without having to open it. Still, nice easy use.",
      "replyDate": null,
      "replyText": null,
      "version": "6.23.1",
      "thumbsUp": 45,
      "criterias": []
    },
    {
      "id": "c45c84c9-322e-4dc2-9873-6c25d56d360d",
      "userName": "Douglas Hall",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUmXNx4EP7j_Dcv77BHtty-WoOuivTxguFBFAvlGgcxERk",
      "date": "2023-10-28T21:36:48.673Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=c45c84c9-322e-4dc2-9873-6c25d56d360d",
      "title": null,
      "text": "On my Fire stick, it continually drops my connection when using cinema app. It's done this on 2-3 of my devices so it's not isolated. I will not renew even though I used them for years. I also advise you to use a different VPN. Edit: I alternated between the three protocols. At first I thought it was working on Nordlynx, but no, same thing. Also, the auto connect does not work once the VPN is kicked off, you have to open the nord app to reconnect, it's ridiculous!",
      "replyDate": "2023-10-28T21:56:05.546Z",
      "replyText": "Hello. Have you contacted our customer support regarding this issue with the VPN app? We're sure it can be resolved by a quick chat with our customer support team at support.nordvpn.com. NordVPN’s team is ready to help you 24/7. -G.M.",
      "version": "6.20.1",
      "thumbsUp": 250,
      "criterias": []
    },
    {
      "id": "5141bdee-aeee-4f1c-b674-359b4bebafa1",
      "userName": "Noah Spencer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWktuZyLdG63JWUXZ9iVar7XHu6ea5mAqnk5vu4ioN0wbo",
      "date": "2023-11-15T15:38:37.350Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=5141bdee-aeee-4f1c-b674-359b4bebafa1",
      "title": null,
      "text": "I used to be much more impressed with this app than I am now.... the connection is spotty at best while CONSISTENTLY dropping signal and keeps me from getting a constant update on anything I'm using that should be connected to the internet. I feel like I shouldn't have to manually connect to a different server every time I actually want to get a message to come through for example. I have no problem with Nord overall as the app on PC seems to work fine, but the mobile app is garbage.",
      "replyDate": "2023-11-15T18:58:03.887Z",
      "replyText": "Hello. Thank you for taking the time to leave us a review. However, may we ask if you have ever tried contacting our customer support agents at support.nordvpn.com regarding the mobile application? If that is not the case, we'd highly recommend doing so, our team is available for a chat 24/7. -N.L.",
      "version": "6.21.1",
      "thumbsUp": 195,
      "criterias": []
    },
    {
      "id": "cf245334-087d-4e98-8341-15ad3e3f28fb",
      "userName": "Curtis “RAW” Pitts",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKxWerSuqh9I2ajzUlL3p9ZAcO4H6b1mvCjR7fDjc2_=mo",
      "date": "2023-12-11T10:40:18.271Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=cf245334-087d-4e98-8341-15ad3e3f28fb",
      "title": null,
      "text": "Total bloatware. I only use it when I travel since the auto start bogs down the computer. I timed it today and it took 3.7 minutes for the app to start fully on my PC. What's worse, it's an app that opens a website where you're required to login before being sent back to the app so you can actually connect. The service is great but the app is terrible. Hopefully the new update will help.",
      "replyDate": "2023-12-11T11:06:15.897Z",
      "replyText": "Hello. It would be great if you contact our customer support team at support.nordvpn.com. Our team is ready to check on the situation in more detail right away. -L.L.",
      "version": "6.23.1",
      "thumbsUp": 182,
      "criterias": []
    },
    {
      "id": "1844988a-8d68-4129-9f5f-73ff841e03db",
      "userName": "Sean",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIbq7MehDY2pYSlScYw6jQvYNYEvAY5o_N6qhaCFAyXAw=mo",
      "date": "2023-12-07T15:06:40.810Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=1844988a-8d68-4129-9f5f-73ff841e03db",
      "title": null,
      "text": "Used to work great for me which is why I paid for 3 years, but not so good recently. Specifically, the auto connect and disconnect. One of the big reasons I got nord was because you can set it to connect on WiFi, and disconnect for mobile, that feature seems to be completely broken now and I have to manually disconnect it when I leave a WiFi connection. It either doesn't disconnect, or goes to \"attempting to connect\" and kills your mobile connection or the performance of it.",
      "replyDate": "2023-12-07T16:42:00.589Z",
      "replyText": "Hello. Thank you for taking the time to leave us a review. However, may we ask if you have ever tried contacting our customer support agents at support.nordvpn.com regarding the mentioned issue? If that is not the case, we'd highly recommend doing so, our team is available for a chat 24/7. -N.L.",
      "version": "6.23.1",
      "thumbsUp": 223,
      "criterias": []
    },
    {
      "id": "cf43f961-7197-4ee2-b98d-bbdc26a50c3e",
      "userName": "D H",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIrZ-ydniTynhkXzqbDo6JNtEG8CO6hXGDyteD1PZJG0A=mo",
      "date": "2023-12-30T00:30:51.631Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=cf43f961-7197-4ee2-b98d-bbdc26a50c3e",
      "title": null,
      "text": "Edit: turns out if default browser is urlcheck, it never opens right. Kind of annoying if you're kicked out and forget. This is the only app that has that problem. Latest update is terrible. Can't log in, can't do anything. Update, almost two months later, support is not helpful. It's still not working.",
      "replyDate": "2023-04-26T00:43:53.115Z",
      "replyText": "Hello! Could you update your review with a Ticket ID so we could check the communication with our team? Looking forward to your reply! - K.S",
      "version": "6.24.1",
      "thumbsUp": 54,
      "criterias": []
    },
    {
      "id": "56c933b1-20d0-466d-878c-13f50a2119dc",
      "userName": "T M (Erik Roede)",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKvP62_mimxEfmtstUPmV4vBCp8m33Qjc9E6i_YCa90=mo",
      "date": "2024-01-24T12:03:18.160Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=56c933b1-20d0-466d-878c-13f50a2119dc",
      "title": null,
      "text": "They will re activate auto renewal, then you'll not be anle to cancel, as it will not show you any buton \"manage subscription\" etc. They will still try for ages to take money from your account. Paid 132 pounds for two years, now they want 130 pounds for one year (and they say it's 67 percent off deal). Absolutely shocking. In your account you can't even modify a card, just notification, email or password. No transparency, feels like they want your money at all costs. Blocked them from my bank.",
      "replyDate": "2024-01-24T15:05:40.936Z",
      "replyText": "Hello. Please note that all of our plans are subscription-based and renew automatically, as mentioned in our Terms Of Service and the checkout page. You may cancel your subscription at any time on your Nord Account console or by contacting our customer support team at support.nordvpn.com. -L.L.",
      "version": "6.24.1",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "004ca9f3-5089-42db-a760-0d307dfd1853",
      "userName": "Ann Anemas",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIZ9oaiZxYYOk_JCwISe_OG13CXYsMWgsE4sgWEH0Wc=mo",
      "date": "2023-10-21T16:13:26.738Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=004ca9f3-5089-42db-a760-0d307dfd1853",
      "title": null,
      "text": "Google TV/Chromecast App needs to add choice of servers. When the United Kingdom server had a month-long problem with disconnecting, I had no other option. My customer service inquiries resulted in nothing but a bunch of generic how-to articles. The problem eventually resolved itself but there is still no way for me to address this if it happens again.",
      "replyDate": "2023-10-21T22:48:10.470Z",
      "replyText": "Hello. Our apologies for the inconvenience you had with our customer support team. Could you please update your review with the Ticket ID you received so we could double-check the situation? -G.M.",
      "version": "6.20.1",
      "thumbsUp": 61,
      "criterias": []
    },
    {
      "id": "7d5c1e1b-f544-48df-8410-c1e095b91db2",
      "userName": "KeyQu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWe_JK7u1BCpSwLQ1BU0LC2h3HBIGeUeMWCcYL9DOD46Q",
      "date": "2024-02-12T19:29:52.883Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=7d5c1e1b-f544-48df-8410-c1e095b91db2",
      "title": null,
      "text": "Totally horrible experience.Most all users complaining about the same problem. It doesn't stay connected more than a minute or two. Are everyone who has this issue wrong? No! Problem is real. Different servers/protocols Doesn't fix the problem.Cache clean, uninstall, reinstall,delete data doesn't fix anything.Same problem on both my Samsung smart tv and my Hisense Google tv. I will NOT be RENEWING my subscription. Looking for a VPN that will stay connected. Be smart and look for other great VPN options. Reply to Nord: Consider fixing this common problem that most users are complaining.I tried all options already period.Offering phone help to each and every user is NOT helping solving this common problem",
      "replyDate": "2024-02-12T22:09:58.281Z",
      "replyText": "Hello. We are sorry to hear about the unpleasant experience you had with our service. However, may we ask if you have tried reaching out to our customer support agents at support.nordvpn.com? If so, it'd be great if you could update your review with the Ticket ID you've received after contacting our team. Thank you. -N.L.",
      "version": "6.23.1-tv",
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "0339c283-7ceb-4d64-9615-af961c3eb00e",
      "userName": "Justin Here",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIVBKDa5VlghDkTyHIuVBHssoVM0J0u3hPZed2Nzcty=mo",
      "date": "2024-01-24T01:05:05.725Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=0339c283-7ceb-4d64-9615-af961c3eb00e",
      "title": null,
      "text": "NordVPN is the only company i've EVER seen that preys on its paying customers. It's a bother! Companies use their users, who use Free versions, which is unpleasant enough without being marketed to, because we gave money to a company. That's WAY OFF & way out of bounds! Seems like the connection is OK; it works most of the time as far as I can tell. It would be nice if it automatically connected after restarting phone. Have to manually start it after each restart. Maybe there's a setting?",
      "replyDate": "2024-01-24T01:29:56.880Z",
      "replyText": "Hello! Please note, that you can use the auto-connect feature to be always connected to the VPN servers. If you need any assistance with our application, please do not hesitate to contact our team at support.nordvpn.com and we will gladly help you out. Our team is ready to help 24/7. - K.S",
      "version": "6.19.2",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "c1e04de0-8bf9-4e1d-a352-6191b597cda7",
      "userName": "- EHC",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWfxCi_39ECvIKWvuR0Z6skiIqvKTE4ghrhw88qKNKslns",
      "date": "2023-12-27T14:15:11.970Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=c1e04de0-8bf9-4e1d-a352-6191b597cda7",
      "title": null,
      "text": "Pro: price and ability to install on many devices. Con: Unreliable service. Often takes up to 15 minutes to connect to a server. Once connected, it often, but not always, slows speed down by as much as 70%. Frequently disconnects, then has to take a long time to reconnect. Customer service is lacking.",
      "replyDate": "2023-11-07T15:03:08.511Z",
      "replyText": "Hello. Please note that there are various factors affecting your connection speeds. For starters, you may try switching between UDP, and NordLynx connection protocols in the settings of our VPN app. If it doesn't help, drop us a line at support.nordvpn.com and we'll help you out in more detail. -L.L.",
      "version": "6.24.1",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "d467d8d1-29b1-4406-8e99-f27078cc1e14",
      "userName": "Erey _",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXOTZrXCUSNIq8NxNrp3_BuzSWqFzWxpE5h_XZRY7Rx5AM",
      "date": "2023-12-03T15:03:18.133Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d467d8d1-29b1-4406-8e99-f27078cc1e14",
      "title": null,
      "text": "it's ok for a vpn service, could be better though. When leaving a wifi area and switching to mobile data the VPN needs refreshed manually or it will just keep \"attempting to connect\" this can also happen if your phone is attempting to connect to a wifi network that you do not have access to. This creates a lot of poorly timed dead zones especially when you're attempting to do something on the go.",
      "replyDate": "2023-12-03T14:36:13.200Z",
      "replyText": "Hello, Erey. Thank you for your feedback. Is there any chance you could expand on where we could improve? Your input is greatly appreciated! -Drea",
      "version": "6.23.1",
      "thumbsUp": 113,
      "criterias": []
    },
    {
      "id": "66414906-d520-4c36-a869-3b378e2d7a6d",
      "userName": "Kay",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXUTL_JY5MDXORe-zfO2GXLVh-sWCt2LBJh1OCUO3BUmIc",
      "date": "2023-12-17T21:31:06.910Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=66414906-d520-4c36-a869-3b378e2d7a6d",
      "title": null,
      "text": "its a scam that uses fear mongering to lure you into buying an expensive subscription and barely works most of the time. when using it even with its premium subscription fee bs the connection is sketchy at best and will disconnect breifly every minute or so and makes watching livestreams difficult. you can only connect to one area every few hours and if you try to switch to another area and find its worse you can't switch back without it breaking. on the computer version it sometimes won't open",
      "replyDate": "2023-12-17T23:14:03.610Z",
      "replyText": "Hello. We are sorry to hear about the issues you faced with our service. However, may we ask if you have tried reaching out to our customer support agents at support.nordvpn.com? They would be happy to help you. -N.L.",
      "version": "6.24.1",
      "thumbsUp": 79,
      "criterias": []
    },
    {
      "id": "4bb93208-a6f5-474f-87d6-3b32c6c91f47",
      "userName": "Anshul Rai",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV3bt68O_U4cj5ElD9fClk2w-PWocW_rZ3fuOQVQkOpBA",
      "date": "2023-11-24T07:53:47.100Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=4bb93208-a6f5-474f-87d6-3b32c6c91f47",
      "title": null,
      "text": "Been using this app since 2020 on 4 devices and have left a five star review in the past, but I am disappointed with how this app performs in 2023. The app CONSTANTLY disconnects on ALL non laptop/desktop devices and requires me to manually go connect to a server every time rather than auto connecting on its own. I reached out to support and their instructions didn't change a thing. Seeing other recent reviews, it's clear I'm not the only one experiencing this. Please address this ASAP.",
      "replyDate": "2023-11-24T10:48:05.692Z",
      "replyText": "Hello. Could you please update your review with the ticket ID you received from our customer support team? We would love to check on the situation in more detail. -L.L.",
      "version": "6.22.2",
      "thumbsUp": 38,
      "criterias": []
    },
    {
      "id": "4482ffd3-fbfa-48ec-b9a5-4d36578f0e32",
      "userName": "m.m",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXcM-17LjiSx-vVXkJB-J3YmdovUYEBcPle-dF8Ek7eVA",
      "date": "2023-10-17T20:53:48.556Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=4482ffd3-fbfa-48ec-b9a5-4d36578f0e32",
      "title": null,
      "text": "From 3 stars, now down to 1. I regret spending $90 on the special that they advertised. What they don't mention is that it doesn't work all the time. So you're paying for a premium VPN that doesn't always work? That defeats the purpose of paying for a VPN. I've already spoken to support. I don't think I should have to call support constantly due it not working as that's not mentioned in the advertisements. Fix your connection issues and I will change my review.",
      "replyDate": "2023-07-27T21:53:45.451Z",
      "replyText": "Hello. We are sorry to hear about your recent experience with our service. Could you try switching the connection protocol in the NordVPN application settings? If the issue would persist regardless, please contact us at support.nordvpn.com. Our team is available 24/7 and would be glad to help you out. -N.L.",
      "version": "6.19.2",
      "thumbsUp": 72,
      "criterias": []
    },
    {
      "id": "f934260a-8909-4ab0-8879-1c93698b681e",
      "userName": "S N",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWJemgQWmUXxiJvg55cb-55U7HVOeZV3ooAX4PoD6Ir2Y4",
      "date": "2023-11-23T03:56:55.458Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=f934260a-8909-4ab0-8879-1c93698b681e",
      "title": null,
      "text": "Google apps, Amazon Prime apps, Netflix, Disney+ don't work while connected to this VPN, regardless of which protocol their support team tells you to try. 2023 update: this has been working superbly for the past several years...until the past few days. My games keep freezing, or Facebook stops working, and I look at Nord and it says \"Connecting...\" Please stop updating it, if it's just gonna break it",
      "replyDate": "2022-06-18T20:00:32.936Z",
      "replyText": "Hello. We’re sorry to hear you have issues with our app. If you give our customer support team another chance, they will do their best to resolve the issue you’re having. Feel free to contact them at support.nordvpn.com — they are online 24/7. -D.I",
      "version": "6.22.2",
      "thumbsUp": 67,
      "criterias": []
    },
    {
      "id": "488112d6-e117-4de8-a81f-a1daa20b0c36",
      "userName": "Pete L'Orange",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVQq-8tFjx061iOtkMB3QD_yLR8ATgW3QcNZYCBYxOzaA",
      "date": "2023-11-10T03:24:40.563Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=488112d6-e117-4de8-a81f-a1daa20b0c36",
      "title": null,
      "text": "Used to be great, but in the last couple months, it will keep dropping the connection. It's not my connection, and I've tried switching between the various VPN protocols, still drops every 15 - 20 minutes without warning. Hopefully they can find and fix whatever big it is, because it's really annoying!",
      "replyDate": "2023-11-10T06:30:49.696Z",
      "replyText": "Hello. We are sorry to hear that. Try flushing your network settings and check if the issue persists. In case it does, do not hesitate to contact our customer support team via live chats at support.nordvpn.com. -A.Z",
      "version": "6.21.1",
      "thumbsUp": 55,
      "criterias": []
    },
    {
      "id": "341522a0-48f6-4f3d-aaa9-a4a594d46947",
      "userName": "Lars Fuglsang",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXdO10ZXr0ISBxtBy38SclDlOEZ4T9bxmAGYKeB5zgAffUg",
      "date": "2023-11-26T04:09:00.898Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=341522a0-48f6-4f3d-aaa9-a4a594d46947",
      "title": null,
      "text": "Android + Desktop Apps.. I appreciate the current setup, room for enhancement. 1. A visible list of servers, eliminating the need to type the entire country’s name and #. 2. The ability to view server speeds directly in the list, perhaps through integrated speed tests to identify the quickest option. 3. A sorting feature for the servers, allowing organization by speed, name, or proximity. 4. An option to add servers to a favorites list. These features are already available in PIA / SurfShark",
      "replyDate": "2023-11-26T06:28:40.176Z",
      "replyText": "Hello. There is a list of countries that we have servers in, you have to open our app and scroll down a little bit and it should be visible there. As for speed, you can use the Quick-Connect option option which connects you to the fastest and least loaded server. As for other suggestions, we will pass them to our technicians. -A.Z",
      "version": "6.22.2",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "5e3be53b-da1a-4925-85f7-dcbe6fe39240",
      "userName": "Vegeta Breigh",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV-kkJwJ8JDQ84P_t9oVw7wrvGG_tMQkQnz-hOLUTj8zaA",
      "date": "2023-10-30T21:41:49.610Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=5e3be53b-da1a-4925-85f7-dcbe6fe39240",
      "title": null,
      "text": "Every app from APS to COX to even certain streaming site don't work at all as long as I have my VPN connected. I can't even check my Verizon Voicemail as it doesn't even load the voicemails until I turn off my VPN and reload the app. What's the point of protecting myself from outside threats if I can't use the apps and sites I typically would need protection for.",
      "replyDate": "2023-10-30T22:48:41.240Z",
      "replyText": "Hello. Thank you for taking the time to leave us a review. However, may we ask if you have ever tried contacting our customer support agents at support.nordvpn.com regarding the mentioned services? If that is not the case, we'd highly recommend doing so, our team is available for a chat 24/7. -N.L.",
      "version": "6.20.1",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "407accba-2af0-4bcc-8aa6-009f480cc351",
      "userName": "Morganna Taylor",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVmEncUUY1t6dtDC-GvoSt_sSIL7_pB64DjSIKZJ2YU5w",
      "date": "2024-03-09T00:50:02.748Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=407accba-2af0-4bcc-8aa6-009f480cc351",
      "title": null,
      "text": "I applied for a free trial of this app and was charged £96.99 for an annual subscription. They takke money from you first and give it back if you cancel in time. This could leave people I'm overdrafts or unauthorised overdrafts and seriously affect your credit score and charge you a hefty cost on top of them taking your money. You have to go to a separate Web page to find out that this is what they do. Thankfully, I used Google pay and got a refund issued but that could have worked out badly.",
      "replyDate": "2024-03-09T03:51:27.495Z",
      "replyText": "Hello. You are being charged for a yearly subscription upon your free trial's expiration, unless you cancel it within 7 days. Moreover, we always provide refunds for payments that are not older than 30 days. If you need any further assistance, you can always reach us via live chat at support.nordvpn.com. -K.T",
      "version": "6.30.1",
      "thumbsUp": 111,
      "criterias": []
    },
    {
      "id": "65a8a07c-101f-4511-9567-300c36abc0f6",
      "userName": "George MacDonald",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU_TPr4ocyTle0tAIMt5pOsFQxEYLVT7q2eV6CRHTQFCNo",
      "date": "2024-03-17T07:34:17.759Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=65a8a07c-101f-4511-9567-300c36abc0f6",
      "title": null,
      "text": "Latest update really tries to make you turn on notifications and if you don't, it does not remember your choice and does not work. If not on, when the app starts, you're taken to a modal pop-up with Continue on it. If you then press Continue and decline the notifications the app does not start. If you press the back arrow top on that modal pop-up, on the top left it does but that is not obvious in the slightest, the UI/UX is designed to bully you into setting them. Unacceptable.",
      "replyDate": "2024-03-16T13:20:46.340Z",
      "replyText": "Hello. You certainly do not need to have notifications enabled and the application will continue working as intended without them. -Neo",
      "version": "6.30.1",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "c7c3b84e-450c-4172-bf57-2ee9dd7ac39b",
      "userName": "River s",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLvOWkbetU9-IH-twmyE7vavnacwWHfJhCohE3hdCoV=mo",
      "date": "2024-03-13T18:03:26.930Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=c7c3b84e-450c-4172-bf57-2ee9dd7ac39b",
      "title": null,
      "text": "I have a yearly sub, and get great service. Often though, the app will get stuck on connecting. This will prevent me from accessing the internet. To solve this, I need to connect to a different location then connect back or hit pause. Very annoying big, would rate 5 stars if this wasn't happening every day.",
      "replyDate": "2024-03-13T19:46:33.751Z",
      "replyText": "Hello. That should not be the case. Could you please try switching between different connection protocols (NordLynx, UDP, TCP) in our app settings to check if the matter persists? If it does, make sure to contact our customer support at support.nordvpn.com for further troubleshooting. We’d be happy to help on the matter resolve! -G.M.",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "94d0112f-7274-4235-89b2-f92e795c58e4",
      "userName": "Leanne Lake",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocICkYJGKZksQv1cYm_LPkk9kU1w2foBKevXamcBuKfe=mo",
      "date": "2024-03-02T19:24:41.303Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=94d0112f-7274-4235-89b2-f92e795c58e4",
      "title": null,
      "text": "Signed up for a 7 day free trial so I could see if the app was efficient for what I need it for, and they have automatically taken the yearly subscription payment after no more than 5 minutes. Tried contacting them through their customer service email and have received no response. The app struggles to connect and is so inconsistent, which was why I did the trial in the first place as all VPN sites I have tried are like this. Don't fall for free trial scam, that's how they're making their money!",
      "replyDate": "2024-03-02T22:13:45.770Z",
      "replyText": "Hello! It would be great if you could reach out to our customer support team at support.nordvpn.com. Our agents will check on your inquiry in more detail at any time as they are available 24/7. -D.I",
      "version": "6.29.1",
      "thumbsUp": 61,
      "criterias": []
    },
    {
      "id": "2b30ed88-1691-4691-a08f-5b6325c32cbf",
      "userName": "Marnie Wellar",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKGFPcDdCLpBGMfftwfWppUwnk4EtCJhKrr_7wmd6_D=mo",
      "date": "2024-02-29T03:11:40.698Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=2b30ed88-1691-4691-a08f-5b6325c32cbf",
      "title": null,
      "text": "Incredibly frustrating and useless. The steps for me to use our account with my Android are not clear or intuitive. It was so irritating going through all the options to find the correct path, which ultimately didn't work anyway. I finally figured out the illogical process to get to the connect button, but it still will not connect; it just hangs and hangs until I get the \"timed out because Nordvpn took too long\" screen. Truly the worst, most disappointing app I have ever tried to use.",
      "replyDate": "2024-02-29T03:29:58.843Z",
      "replyText": "Hello. Please accept our apologies. It would be best if you could contact our team live chat at support.nordvpn.com and we will be more than happy to help with any problem you might have. Our team is always accessible 24/7. - K.S",
      "version": "6.29.1",
      "thumbsUp": 56,
      "criterias": []
    },
    {
      "id": "572977a8-c89b-4c93-bc2b-66325061fc9a",
      "userName": "Digi Dex",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUNoWVSoICO7xuNFUqz3BV36y2VEKz_CcvPWQvoOvuUd_k",
      "date": "2024-03-14T12:38:03.275Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=572977a8-c89b-4c93-bc2b-66325061fc9a",
      "title": null,
      "text": "Most things I wanted to use this for, no longer work with a VPN. I basically have to disable it in order to do anything I would normally want a VPN for, such as Netflix, visiting many different shopping sites, etc... Most major shopping sites will just refuse to load with VPN enabled. But alas, there is hope! Now I can pay EXTRA for this feature that was supposed to already be baked in to any VPN service...",
      "replyDate": "2024-03-14T15:03:38.926Z",
      "replyText": "Hello. We'd love to look into your issue in more detail if you could contact our support team via live chat or email at https://nordvpn.com/contact-us/. Alternatively you may reach out to us via social media platforms @NordVPN such as Twitter, Facebook or Instagram. Thank you! -Neo",
      "version": "6.30.1",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "b4e0f926-caef-490a-a0ef-700dd3b38089",
      "userName": "Indra Pandu Prasetyo",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI8aa1oTmv_WN4w5oJM-KEh-dwsnDKsgFK3XwiHtNP73g=mo",
      "date": "2024-03-14T10:56:33.834Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=b4e0f926-caef-490a-a0ef-700dd3b38089",
      "title": null,
      "text": "I applied for a 7-day trial through the mobile app during its advertised promotion. However, instead of the trial, it charged my credit card for an annual subscription of IDR 1.6 million! Despite canceling the subscription and requesting a refund through Google, my request was rejected. The trial system failed to function altogether. Needless to say, I'm extremely disappointed with this experience.",
      "replyDate": "2024-03-14T15:08:35.627Z",
      "replyText": "Hello. Please contact our customers’ support team, for them to check what could have caused an early charge for the subscription and issue a refund of the transaction. Our team is available 24/7 at support.nord-help.com. Apologies for any inconveniences. -Neo",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "5d326f16-200b-420f-838f-4e556fdebbc7",
      "userName": "Dmitry Nevozhay",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVWtJwVP4YF1_k1MKKtVG0zrdHXxNiUDjI5J_MMqV080a7W",
      "date": "2024-02-24T08:34:14.525Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=5d326f16-200b-420f-838f-4e556fdebbc7",
      "title": null,
      "text": "Very unstable and disappointing. In the country with government censorship, where only obfuscated option is working to acess restricted hosts, this works randomly - long unsuccessful attempts to connect, stuck connections which require manual reconnection, etc. Useless ineffective support that only can copy/paste FAQs from their site, and not to resolve your specific issue.",
      "replyDate": "2024-02-24T11:01:19.852Z",
      "replyText": "Hello. Could you please update your review with the ticket ID you received from our customer support team? We would love to check on the situation in more detail. -L.L.",
      "version": "6.29.1",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "994d0b0e-9ade-4c88-993b-622d6322fbbd",
      "userName": "Andy",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUbDuUhEq2aPHX2TpqfJcE0BIgTQtpjXUoZt60hprH1GSor",
      "date": "2024-01-21T23:37:06.880Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=994d0b0e-9ade-4c88-993b-622d6322fbbd",
      "title": null,
      "text": "I'm using the free trial and if it worked 100% of the time I would definitely pay rather than cancel. But I'm quite shocked at how unreliable it is. On my phone, if I click the refresh button, Nord tells me it's finding the best server but 9 out of 10 times it will NOT connect to one. Eventually it tells me it's \"taking longer than usual\" but won't connect. If I cancel and try a few more times it usually connects. But to do that, I must disable auto connect. Very poor and not what I expected",
      "replyDate": "2024-01-22T02:10:28.396Z",
      "replyText": "Hello. We would recommend switching between the VPN protocols in our app settings and checking if the issues persist. If you need any further assistance, do not hesitate to contact us via live chat at support.nordvpn.com. -K.T",
      "version": "6.26.2",
      "thumbsUp": 87,
      "criterias": []
    },
    {
      "id": "e7383c90-c3e2-408e-93a9-38b3ba051ef5",
      "userName": "Peter",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIJaSM64sAPtI0CHq_gNJbAXGsGUn7dFVKH8XfNd69l=mo",
      "date": "2024-01-13T15:25:24.611Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=e7383c90-c3e2-408e-93a9-38b3ba051ef5",
      "title": null,
      "text": "App is fine but some aspects (on FireTV version) are very frustrating, and could so easily be fixed. First is that you can't disconnect if auto-connect is selected. Why ever not? Second is that sometimes you need to change servers. Selecting a different country you (obviously) get a new server, so why not let you get a new server for the country you're currently connected to? Instead, you have to select some random other country and then go back to the first. Don't they check these use cases?",
      "replyDate": null,
      "replyText": null,
      "version": "6.26.2",
      "thumbsUp": 171,
      "criterias": []
    },
    {
      "id": "187971f4-fd50-4f9c-ba7f-505617c930b9",
      "userName": "Anya Allison",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUL0PX9jYTDrNQtQ-LH0D116WQyd1uZXwQ6CV-iKwJrBg",
      "date": "2024-01-25T08:59:25.564Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=187971f4-fd50-4f9c-ba7f-505617c930b9",
      "title": null,
      "text": "Fantastic app and 90% perfect. The only annoying thing is that sometimes it struggles connecting, which must be a bug because once you log out of the app and log back in, it connects just fine again. My phone is fully updated, along with the app, so it's definitely a problem with the app. It's not a big deal, it's just annoying doing this every day. But you can live with it.",
      "replyDate": null,
      "replyText": null,
      "version": "6.27.2",
      "thumbsUp": 221,
      "criterias": []
    },
    {
      "id": "89d18ac4-0f71-48b4-bc8e-6efa966cbf14",
      "userName": "Run To Ruin",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVwA_uxO07U-hg13fnR3_-LNZ29CqS7db3S2d4ue352djk",
      "date": "2024-01-13T01:18:00.667Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=89d18ac4-0f71-48b4-bc8e-6efa966cbf14",
      "title": null,
      "text": "Review after 6 months of use: It works well in the beginning. However, errors occur frequently. Not only does it cause VPN connection errors, but it also causes proxy errors, making Internet access itself impossible. As a result, there are many cases where I almost lose my work while working on important projects using Google Drive. I'm not going to renew my contract because it's not that good.",
      "replyDate": "2024-01-13T06:34:36.611Z",
      "replyText": "Hello. We are sorry to hear that. Please try altering between connection protocols in the settings of your NordVPN application and check if the issue persists. In case it does - do not hesitate to reach out to our support team for further assistance at support.nordvpn.com. -A.Z",
      "version": "6.26.2",
      "thumbsUp": 68,
      "criterias": []
    },
    {
      "id": "d92fcdb9-4716-4425-b9de-bfc405ac83ee",
      "userName": "Joey Deo",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ1Xlqa6vlB9XTiigMVHw8XGvGZfBGje1_0g_-VLHTgGw=mo",
      "date": "2024-02-28T02:24:47.399Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d92fcdb9-4716-4425-b9de-bfc405ac83ee",
      "title": null,
      "text": "If I can attach pics I definitely will. My subscription until 2026, and this VPN is the most uesless and worthless. It takes forever to connect. They say it ca be used in China, but no, it can't. I never connet successfully on my iPad, and it takes about half an hour on my Android phone. Please don't download this, it's totally not worth.",
      "replyDate": "2024-02-28T04:06:57.470Z",
      "replyText": "Hello. Due to the heavy internet restrictions in China, accessing our servers requires additional setup. You can find the instructions in this article: https://support.nord-help.com/hc/en-us/articles/19572011021457-Connecting-from-a-country-with-internet-restrictions. If you need any further assistance, feel free to contact us via live chat. -K.T",
      "version": "6.29.1",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "1794329c-c142-41a7-88b6-ffe4b5dcda99",
      "userName": "Johnny",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI7FOuf1yvwdvj2jacPygQNFffXKcQkFkKrVyqPQJHy=mo",
      "date": "2024-03-11T13:39:27.310Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=1794329c-c142-41a7-88b6-ffe4b5dcda99",
      "title": null,
      "text": "Please fix the connection and speed issues that people are complaining about and stop sending constant messages to buy extra stuff I don't need. Get the basics right first. I'm tired of spending ages changing from one server to the next. Most don't work or they just throttle the speed to something I experienced in the 80s on dial up. I remember years ago nord was one of the best vpn's. Now nothing but bad reviews and complaints. Same response, sorry to hear that, can you reach to our support.",
      "replyDate": "2023-03-15T21:05:43.760Z",
      "replyText": "Hello there. We’re sorry to hear that! If you’re experiencing issues with our service, make sure to contact our customer support team. We’re ready to help you 24/7 at support.nordvpn.com. -G.M.",
      "version": "6.30.1",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "f28555ad-8c15-4f0e-9218-133cc107cf61",
      "userName": "Sam G",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIa-p-Qf3tRzysqSUbV5oo54RWKT_lEKf5n8LJsQTcw=mo",
      "date": "2024-01-31T07:11:12.670Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=f28555ad-8c15-4f0e-9218-133cc107cf61",
      "title": null,
      "text": "paid version doesn't connect in normal mode or obfuscated mode. getting filtered out. Update: I've been a paid member for 4 years. When in Europe it works fine. But it's mostly needed in places with restrictions. That's where there seems to be ongoing issues. What used to work before isn't working after few months. If using obfuscated mode, then how come network security is picking up Nord vpn split tunnel and filtering it out. So obviously network security flags up this. Fix needed please.",
      "replyDate": "2024-01-31T10:19:45.595Z",
      "replyText": "Thank you for the update. It's usual and normal for different institutions and governments to change the game up in terms of restrictions if they're imposed at all, and it's expected that old methods may stop working in the long run. We'd be happy to assist you with such issues at support.nordvpn.com or at support@nordvpn.com. -Drea",
      "version": "6.27.2",
      "thumbsUp": 85,
      "criterias": []
    },
    {
      "id": "9dcff6af-044d-4107-bf63-8e52eaae428a",
      "userName": "O dadoun",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWHfFe36qQsoV2EJi7w-JFzwzLIAI_3SeU9fnyKlVC7pJw",
      "date": "2024-01-23T05:13:54.230Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=9dcff6af-044d-4107-bf63-8e52eaae428a",
      "title": null,
      "text": "I deeply regret renewing my subscription for another 2 years. Recently, the app shows that I am connected to VPN, but I actually I'm not. I tried their support center, but they didn't offer a better solution than the one you can find on the internet. One of the most annoying problems their apps keep logging me out from my account for no reason, and recently, I sould use another vpn to log in to my nord account since their service is blocked where I live. I didn't face this problem before.",
      "replyDate": null,
      "replyText": null,
      "version": "6.26.2",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "c58de5e2-ee84-4153-bb79-49715e5699fb",
      "userName": "Paul Harsley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK7-J57fxIcoXQQ5Ist-09lrs_a5vfFb8DrZ5Ad4jTT=mo",
      "date": "2024-01-06T11:54:47.625Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=c58de5e2-ee84-4153-bb79-49715e5699fb",
      "title": null,
      "text": "Update: Slow. I hate this VPN and apps (on all my devices and windows). I constantly have to disconnect and reconnect to get any traffic through. Which usually means through settings, because the app doesnt load until the always on setting is turned off. Then when the app has loaded, turn it back on before reconnecting the VPN. I have tried everything support have suggested and its all just a delay tactic. The VPN and this app are useless. I bought 3 years and it was a mistake. Avoid.",
      "replyDate": "2022-01-13T14:50:51.214Z",
      "replyText": "Hello, Paul. We are sorry to hear about your experience with our service. Could you please update the Ticket ID for us to check what our support team provided you with? - M.M.",
      "version": "6.25.2",
      "thumbsUp": 64,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "b6f0721c-a559-4597-a7ad-f823f1abd64c",
      "userName": "Stephanie",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUK1lC2ltJKACU_CqlIKxRgsvfEp7eINwh9h4KsMnycrDg",
      "date": "2024-03-08T21:20:39.200Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=b6f0721c-a559-4597-a7ad-f823f1abd64c",
      "title": null,
      "text": "Edit: Back to working after an update. I don't know what's going on lately but anytime I have on NordVPN, it won't connect to the internet. And that's across the board with all devices: phone, PC, and laptop. Everything is updated, had no issues with that, it's just like Nord just decided to stop working. I've tried all the troubleshoots. I don't know what happened.",
      "replyDate": "2024-02-05T19:25:13.817Z",
      "replyText": "Hello there. We’d suggest switching between different connection protocols (NordLynx, UDP, TCP) available in our app settings. If the issue persists afterwards, make sure to contact our customer support at support.nordvpn.com. Our team is available 24/7. -G.M.",
      "version": "6.30.1",
      "thumbsUp": 12,
      "criterias": []
    },
    {
      "id": "384430d1-8575-4d88-86f8-f2f9b3a7442b",
      "userName": "Philip Feng",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVfd1V9oBuZ74ShK3m5ZN_xgdvTrJnUDtEG028J8-KmcEQk",
      "date": "2024-03-07T18:15:59.691Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=384430d1-8575-4d88-86f8-f2f9b3a7442b",
      "title": null,
      "text": "When the app works, it works. But when it doesn't, it's frustrating trying to fix it. Right now the app just won't connect to any server all of a sudden. Changing protocols didn't fix the issue either. I thought signing out and signing back in again would fix it. But now it won't even take me to the sign in page. When I clicked sign in nothing happens. On that note, why does the app need to take me to a browser to sign in? Why can't I just sign in within the app like I would on any other app?",
      "replyDate": "2024-03-07T18:29:56.160Z",
      "replyText": "Hello! We’re sorry to hear about the experience you had with our VPN service. Please contact our customer support team at support.nordvpn.com, and they will help you out in this situation. Let us know how it went afterward! -D.I",
      "version": "6.30.1",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "5bddfab7-781b-4ce4-8814-91bcd948fa3f",
      "userName": "Patrick Socia",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKVFTg7G_o0pTHozodDLJZVKlIE6Nz4CuTKilx1Rucz=mo",
      "date": "2024-01-11T06:11:59.515Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=5bddfab7-781b-4ce4-8814-91bcd948fa3f",
      "title": null,
      "text": "runs very smoothly in the background, does not slow down my connection and so far has been very reliable. I have not had any problems connecting to any websites. Microsoft came up with a suspect activity first time I used it but I verified it was me and have had no further problems with them. I had a different VPN prior to this and this program is much more desirable. Updated 1-11-2024 been using NordVPN for around a year now. Excellent program. I've had zero problems. Love it.",
      "replyDate": null,
      "replyText": null,
      "version": "6.25.2",
      "thumbsUp": 390,
      "criterias": [
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_difficult_to_use",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 2
        }
      ]
    },
    {
      "id": "d96a0829-be8f-41a8-984e-debb91395c54",
      "userName": "Sara Mai Chitty",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXuIXp5gFoJVKnZJu6Yk0YlABuijBYocps_gDW1nx0zm_Bm",
      "date": "2024-03-11T00:15:29.825Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d96a0829-be8f-41a8-984e-debb91395c54",
      "title": null,
      "text": "It works great enough, but I somehow got directed to the website and didn't realize the site doesn't offer a 30 day trial - only Google Play does...so now I have a $260 CAD charge on my credit card (also doesn't advertise the \"sale\" for $167 was in USD and that there are taxes 🥴). For the false advertising and non-intiitive confusion around 30 day free trial, I am giving one star !",
      "replyDate": "2024-03-11T01:11:07.469Z",
      "replyText": "Hello! All our subscriptions have a 30-day money-back guarantee for your initial payment. With that said, we would love to investigate your situation. For assistance, please contact our support team at support.nordvpn.com and we will help you right away! - K.S",
      "version": "6.30.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "ede0fb5e-8cef-4d8b-989b-d09c9e79e290",
      "userName": "Trevor Stines",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWf5GpJVyPFyn_zwlBmKAXveiHZVdkcsIv2ItbbGXvq9uo",
      "date": "2024-03-17T04:30:50.390Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=ede0fb5e-8cef-4d8b-989b-d09c9e79e290",
      "title": null,
      "text": "Only works on my android phone. For the life of me can't get it functioning on my PCs. Express works fine with HIGH SPEEDS but nord is a flop. Very unfortunate because UI / features seemed good. I don't have time to try to make something work when I know something else does with ease.",
      "replyDate": "2024-03-17T05:51:37.375Z",
      "replyText": "Hello, Trevor. Apologies for the inconvenience. Feel free to contact our customer support team at support.nordvpn.com so we could check what is the cause of this issue and provide you with a solution. -A.Z",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "cfd7dcc0-6e76-4ad4-902a-99710bdce0bb",
      "userName": "Laurentiu Veliscu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV3p4pNIJyS9YhVXvUAcK8oQzx090euGSuhPpRRMJ--CYoV",
      "date": "2024-02-26T12:13:35.708Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=cfd7dcc0-6e76-4ad4-902a-99710bdce0bb",
      "title": null,
      "text": "I've got a refund from Google but the experience was bad. I bought a 1 year subscription with 1 week trial first. When I made the payment was mentioned that I will be charged for a full subscription if I don't cancel it within 1 week. The surprise was that I have been charged full subscription even if I cancelled it within 1 week and I was waiting for the refund. Later I found that I used the trial last year so there was no trial😬 Modern legal scam",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "ba60394a-b03d-4268-b556-f1344be6207c",
      "userName": "Dave Woods",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI4VlDLmggbp9ts3lhri0Z-g_S6x0AnlxYFAs6k1Ikk=mo",
      "date": "2024-02-05T20:59:45.192Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=ba60394a-b03d-4268-b556-f1344be6207c",
      "title": null,
      "text": "I've been using the app for a couple of months now. Unfortunately Android Auto doesn't work with it and so I keep getting in the car and forget I've left the VPN on. Really annoying.... And then I get a popup from nord saying that it's noticed AA doesn't work so how about I enable split access so it doesn't block AA on the future. Proactively solved a problem for me I didn't know how do fix. Very happy",
      "replyDate": null,
      "replyText": null,
      "version": "6.27.2",
      "thumbsUp": 27,
      "criterias": []
    },
    {
      "id": "a336ab1c-19ef-4cf7-b473-3631c0e506a7",
      "userName": "E Hall (Missxc36)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXid_Kkh0o3z96z8uM__dfjBdo0VUYN_P04UpJJXrzfOuE",
      "date": "2024-03-02T18:46:26.834Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=a336ab1c-19ef-4cf7-b473-3631c0e506a7",
      "title": null,
      "text": "Hi there, I had many many issues BEFORE I bought a sub for 1 year. Now, it works like a charm. In fact the connections that I have stored for continued use follow the protocol. If I may, have any of you folks turned on 'MeshNet and set it up for your device? After many a Google search, and forum hopping, I was asked if MeshNet was on and if I followed the set up. I didn't know what they were talking about until I popped into my Nord Vpn and just for sh*ts and giggles, I turned it on.",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "01fea7b3-d776-46c8-956c-e9bc5ce09a6b",
      "userName": "Bruno Ambrozio",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXci9Rsc6RuCw0OJNxjkXSUEO1wjfDSerf1n4Q6lJtLrm6p",
      "date": "2024-03-18T01:13:26.606Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=01fea7b3-d776-46c8-956c-e9bc5ce09a6b",
      "title": null,
      "text": "I'm not sure if this is useful at all. When in most of the public Wi-Fis, the VPN never connects. Besides, most of my banking apps don't work when the VPN is up. What is the point of a VPN service if you can only use it when navigating through your home WI-FI or your phone data plan? I signed up for a 2 years plan, but since I'm within the 30 days trial, I might ask for a refund. I will give a few more days to see if I get any value from it. So far, I'm a bit disappointed.",
      "replyDate": "2024-03-18T06:36:58.667Z",
      "replyText": "Hello. Apologies for the inconvenience. Some public networks tend to restrict access to VPNs, however you should be able to bypass these restrictions using our Obfuscated servers that are visible under the specialty servers section. As for other issues, feel free to reach out to our customer support team via live chats at support.nordvpn.com. -A.Z",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "c5bdf1f9-47a3-4ecb-9cdc-27fff274e46c",
      "userName": "Fadi Nasereddin",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIZJ_dL-vRZjbCx-jCwhJyOkl-8qykE2wICAtVLsyDW=mo",
      "date": "2024-03-03T06:27:22.437Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=c5bdf1f9-47a3-4ecb-9cdc-27fff274e46c",
      "title": null,
      "text": "False advertising. They promise a free 7 days trial then to charge, but charge you a full year subscription as soon a s you enter your card details. Anyway, I'm not the only one saying this on the reviews. Be careful and only sign up if you want the full version and don't want a trial. I tried to refund it with the playstore but no luck and they referred me to the developer. I spent more than an hour trying to find the refund process on NORDVPN website, but couldn't.",
      "replyDate": "2024-03-03T06:47:28.655Z",
      "replyText": "Hello, Fadi. We are really sorry to hear that. Please contact our customer support team via live chats at support.nordvpn.com and they will check what caused this charge. -A.Z",
      "version": "6.29.1",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "2d5609f5-4061-4202-91bf-ea6ed3ad6e36",
      "userName": "Joshua Withers",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUb5BFfT3LtJcqCk0AZzIFkIaqcNz2dixNHltW_YUHwy5Q",
      "date": "2024-03-07T21:47:45.105Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=2d5609f5-4061-4202-91bf-ea6ed3ad6e36",
      "title": null,
      "text": "First time getting into personal online protection, and I recognize a few of the terms used in the menus. I wish there was a link or something, maybe on desktop version only, that allows you to read up on how that process specifically works. It would help me satisfy the curiosity a little faster lol.",
      "replyDate": null,
      "replyText": null,
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "0d1945d1-7c21-4e4f-81a9-47f323d69932",
      "userName": "Tim Pool",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWQ2LxRel7mvZQud3RMIM5qHUG3Xt0XpBb3i5QiSbZh_cZC",
      "date": "2024-03-08T03:40:45.212Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=0d1945d1-7c21-4e4f-81a9-47f323d69932",
      "title": null,
      "text": "Has some issues here and there, you'll occasionally have to change protocols or switch servers. That typically will resolve the issues. Some issues I have encountered. Extremely slow speeds. Sites/apps recognizing that I'm using a VPN or thinking I'm a bot. Specific IPs being banned from some sites.",
      "replyDate": "2024-03-08T03:31:05.762Z",
      "replyText": "Hello. Please accept our apologies. To investigate what might be causing it, please reach out to our support team via live chat at support.nordvpn.com. Our team is always accessible for assistance 24/7! - K.S",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "f8683bc5-4a8d-4511-9f07-f21a4fb0b331",
      "userName": "Alexis Rose",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJZuQWq14JCrQc8lutHnkNuCbQNBeomR_nuO8aVMm_s=mo",
      "date": "2024-02-26T00:07:45.190Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=f8683bc5-4a8d-4511-9f07-f21a4fb0b331",
      "title": null,
      "text": "I do not allow notifications just so I can get woken up at midnight with you trying to sell me stuff. I cannot see a way of stopping these kind of notifications. Not impressed considering I've had the product less than 24 hours Happened for a second night in a row at 5 past midnight, despite turning off marketing notifications in my account. This seems to be seperate from marketing notifications in the app. Stop bombarding your customers and have some respect for people in different time zones",
      "replyDate": "2024-02-25T01:29:27.595Z",
      "replyText": "Hello! Please contact our support team at support.nordvpn.com and we will help you with notifications. Our team is always accessible 24/7. - K.S",
      "version": "6.29.1",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "f36a7896-6d65-4370-8875-807bc9e83f31",
      "userName": "yatharth rai",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIk1kTy6FpmRllV788RjUkMXhYrez9Uum7hydVyjCAI=mo",
      "date": "2024-03-09T09:06:35.768Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=f36a7896-6d65-4370-8875-807bc9e83f31",
      "title": null,
      "text": "After using NordVPN for a year, I've encountered a significant issue. Often, when attempting to connect to the VPN, it gets stuck on 'connecting' without any progress. Even after clearing the app data and logging back in, the problem persists. It's frustrating and needs to be addressed by the NordVPN team.",
      "replyDate": "2024-03-09T14:57:51.869Z",
      "replyText": "Hello. You may try setting up TCP or NordLynx connection protocols in the settings of our VPN app and then check if your connection improves. If not, feel free to drop us a line at support.nordvpn.com for further investigation. -L.L.",
      "version": "6.30.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "95edb8eb-c8c9-446d-8985-4729268e91fb",
      "userName": "Christopher Burgess",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJoJEG57xryeK3wrtT9WTuZ1ikQhXXsuMMplssx3ORo=mo",
      "date": "2024-02-11T13:12:57.971Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=95edb8eb-c8c9-446d-8985-4729268e91fb",
      "title": null,
      "text": "Would give it 5* but as in other reviews there's definitely an issue with the app. I keep getting 'VPN Connection Lost' notifications and going into the app shows it trying to reconnect but failing to do so. Force stopping the app or logging out and back in immediately fixes it but it keeps happening regularly. The usual advice of 'try to change the protocol to NordLynx, etc' doesn't work. I use NordVPN on my desktop PC as well and the occasional blocked website aside, this issue doesn't occur.",
      "replyDate": null,
      "replyText": null,
      "version": "6.27.3",
      "thumbsUp": 28,
      "criterias": []
    },
    {
      "id": "951a9328-faad-4696-bae9-df7925f9b2c0",
      "userName": "Brian C",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU6riwbOH5U1HhQXESb0zr9qeydMqKS3UjDyACEqKz9LgVC",
      "date": "2024-02-07T02:29:51.792Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=951a9328-faad-4696-bae9-df7925f9b2c0",
      "title": null,
      "text": "Does not stay connected. Must constantly reconnect everytime you use the device. This problem does not occur on desktop. EDIT: Have tried all other protocols available, still must reconnect after each time the device is inactive. Useless VPN app. Go with another company is my opinion, I'm stuck since I paid for a long time. It's truly a garbage experience with Nord VPN.",
      "replyDate": "2024-02-06T18:11:46.328Z",
      "replyText": "Hello. Thank you for taking the time to leave us a review. Could you try switching the connection protocol in the NordVPN application settings? If the issue persists regardless, please get in touch with us at support.nordvpn.com. Our team is available 24/7 and would be glad to help you out. -N.L.",
      "version": "6.27.3",
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "d95b698d-6c3a-4de4-b334-1719ba2bf4d6",
      "userName": "Smiley “smileybox888” Box",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXW-7x0kMhST9bS5n-x8Vs48cVgvVeFk17p1vbckOTYwPA",
      "date": "2024-02-12T00:27:14.403Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=d95b698d-6c3a-4de4-b334-1719ba2bf4d6",
      "title": null,
      "text": "The desktop version works on Windows 10. However, there's a significant issue with the phone version, which is my primary device. I've tried switching protocols, installing, reinstalling, and checking app permissions, but nothing has resolved the issue. There's no connection. It's disappointing to see such poor performance.",
      "replyDate": "2024-02-12T00:37:15.239Z",
      "replyText": "Hello! We are sorry to hear about your problems. To troubleshoot these issues, please reach out to our team live chat at support.nordvpn.com and we will help you immediately! For your convenience, our team is accessible 24/7. - K.S",
      "version": "6.27.3",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "5f2a0d25-04f7-4b1e-962b-dbe1f4eb93a7",
      "userName": "Dylan Tolhurst",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLwDcWuJUxITqlc7c1isqvsWERe7uAFwyedx3GK_sWE=mo",
      "date": "2024-02-21T20:48:55.222Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=5f2a0d25-04f7-4b1e-962b-dbe1f4eb93a7",
      "title": null,
      "text": "You need a VPN then NORD VPN is your best choice because they have all you needs covered. If this is your first vpn get NORD because it is easy to use. It installs in seconds and with one or two clicks you are done. The user interface is unique because it's a map. You click anywhere on Earth and youre automatically connected. Their customer support is outstanding and they will get back to you instantly if you have any problems.",
      "replyDate": null,
      "replyText": null,
      "version": "6.28.3",
      "thumbsUp": 20,
      "criterias": []
    },
    {
      "id": "b07dea60-a1a2-4127-bd69-c00673ce266c",
      "userName": "Lisa Mccann",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ6_T9fjjuoBlVeLjd8dcAYw8H8Z96Lk57cX0cDPRUX=mo",
      "date": "2024-01-17T22:51:11.613Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=b07dea60-a1a2-4127-bd69-c00673ce266c",
      "title": null,
      "text": "It's good for it's purpose but it randomly disconnects from the vpn and you don't realise straight away which isn't very secure if it disconnects multiple times a day and makes your IP detectable again. I downloaded it for security purposes (nothing illegal) but even with auto connect turned on it turns off multiple times and have to open the app to connect to a vpn again. Edit: tried what was suggested in the reply and still the same issue so have cancelled my subscription",
      "replyDate": "2024-01-13T06:34:04.200Z",
      "replyText": "Hello, Lisa. We are sorry to hear that. Please try altering between connection protocols in the settings of your NordVPN application and check if the issue persists. In case it does - do not hesitate to reach out to our support team for further assistance at support.nordvpn.com. -A.Z",
      "version": "6.26.2",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "8092849d-a99f-4ffb-8f80-f0ab88dc1505",
      "userName": "Landon Harding",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocILpdo9XjOZ1ekwKASS-R8vUcRE1qrCaWkLMn0ZoKdb=mo",
      "date": "2024-03-01T10:50:03.499Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=8092849d-a99f-4ffb-8f80-f0ab88dc1505",
      "title": null,
      "text": "Ridiculously hard to cancel and even after receiving confirmation of canceling they STILL charged me for services unused , it literally took me an hour to figure out how to even cancel ith them just to have them charge me again.... AVOID. Oh AND they told me tough luck when I brought it up thats fine doesn't mean I won't debate the charges or leave bad reviews. 🤷‍♂️",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "79dfdd97-1d93-48d9-8c9f-ffd7be33b431",
      "userName": "Jeremy Andrew",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKBWsNPOnzoWNGR4qGlcRospdtFLM2W5bM_E1PDPghJ=mo",
      "date": "2024-01-26T23:09:06.240Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=79dfdd97-1d93-48d9-8c9f-ffd7be33b431",
      "title": null,
      "text": "I am not impressed. I wouldn't waste money on this App again. They promised the world, but very poor service delivery. It used to work initially, then suddenly went downhill. The speciality servers don't work most of the time. There's constant updates, which do not improve anything. I am in a restricted country. I took this out so that I could make WhatsApp calls. Can't do that anymore as it's not supported by my network carrier which This VPN was supposed to be able to intervene.",
      "replyDate": "2024-01-27T01:17:33.430Z",
      "replyText": "Hello. We have a specific connection method for our users in restricted countries: support.nord-help.net/1047408742. If it does not work for you, do not hesitate to contact us at support.nord-help.net and investigate the issue further. - K.S",
      "version": "6.27.2",
      "thumbsUp": 28,
      "criterias": []
    },
    {
      "id": "033bc419-087f-44df-8253-353dcc40d12d",
      "userName": "Cameron Peet",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVfCY2C1xutR95-V6KqmeJmzNiDZU_9np0MQILHPKYN-C4",
      "date": "2024-03-02T23:24:07.612Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=033bc419-087f-44df-8253-353dcc40d12d",
      "title": null,
      "text": "Was happy until recently. New marketing via push violates T&Cs. Must offer ability to disable marketing notifications, and I have never accepted any in app UI to allow for them to market to me via push notifocations. Am blocking notifications till can be disabled from in app. Will not be renewing a near $100 subscription because of incessant deal notifications you are attempting to sell.",
      "replyDate": "2024-03-03T02:48:59.379Z",
      "replyText": "Hello. We are sorry to hear of your displeasure. Please contact us via live chat at support.nordvpn.com and our team will assist you promptly. We are active 24/7. -K.T",
      "version": "6.29.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "2c7629db-e873-46e6-946b-d5edb536a7a0",
      "userName": "Eric M.",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV2lXSjcs5xG4Df2jfx5suNHxEPBbuQ4tx7U4zpMt7pdA",
      "date": "2024-02-27T00:24:07.108Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=2c7629db-e873-46e6-946b-d5edb536a7a0",
      "title": null,
      "text": "with all that is happening in the world of technology. I decided this kind of \"protection\" is necessary for everyone to be safe. NordVPN has an excellent reputation and the cost was not too extreme. I'm a disabled veteran on fixed income so making purchases of \"intangible\" products is rare for me. So far, I think this program/app is doing its job. however, I'm in an ongoing self education process about VPN's... I would like to return later, with more useful and informed review.",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "bd600fe0-1125-4381-a27c-7012d8650218",
      "userName": "JOSE A SEGUI",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJR8KzfJjJ1Pa5YAuNzxFJ403kG_Qd_VRXNToX0Z9vC=mo",
      "date": "2024-03-02T15:56:20.846Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=bd600fe0-1125-4381-a27c-7012d8650218",
      "title": null,
      "text": "so far so good the only thing is that you said you can unlock website like Hulu, Netflix and others but that's is true everything is false can't not unlock anything but is no only you because I also have surfshark and express VPN and they been liar about that too the only thing different is that NordVPN is a little bit faster and that's is no a big deal about unblock websites for free movies or tv ,Thank you !!",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "cdc3534b-061b-42b9-8e97-040a28d62b41",
      "userName": "Alan B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVfT3YzoGE4ASC-2ehkrySbTKOyQzE02euJbp6lnaaAaQ",
      "date": "2024-02-27T13:30:14.806Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=cdc3534b-061b-42b9-8e97-040a28d62b41",
      "title": null,
      "text": "Any app that sends promotional ad notifications that you can't turn off will always get one star. The choice is turn off all notifications, including the important security ones, or deal with promo ads all day from the app and email. No thanks.",
      "replyDate": "2024-02-27T15:06:40.418Z",
      "replyText": "Hello. We do appreciate your feedback and will definitely share it with the team. In the meantime, if you have any questions or requests, feel free to contact us at support.nordvpn.com or Twitter @NordVPN. -Neo",
      "version": "6.29.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "218012e7-5669-4ff8-a1f4-6ab1414214a2",
      "userName": "Arash Mehdizadeh",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVr54J-c8apqPRn66ThBo_i1gdtklAFh_czMVdKi_op9Ds",
      "date": "2024-02-13T07:27:57.964Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=218012e7-5669-4ff8-a1f4-6ab1414214a2",
      "title": null,
      "text": "I would have given it zero stars if I could. Jus t a few days ago, they must have made some changes to their authentican policy so whenever you close and re-open the app, you have to re-log into your account. If you access the internet through a restricted connection, the login process will never finish successfully. Their refund policy is a scam and their support is horrible. Their support is just a bunch of scripted responses thrown at you randomly. Stay away at all costs.",
      "replyDate": "2024-02-13T11:56:42.534Z",
      "replyText": "Hello, Arash. We're sorry about the poor experience you've had with us. Would you be able to update your review with a ticket ID# referencing your conversation with our support team? We'd be happy to investigate. -Drea",
      "version": "6.27.3",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "00d1c6ac-3bc8-466c-b726-1f62b3b731e1",
      "userName": "Eagle Lion",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW92_Lu8oRKjfXqYQMg3A0gRn4c1haeczFZ-uMYtluMsHU",
      "date": "2024-03-18T13:16:27.375Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=00d1c6ac-3bc8-466c-b726-1f62b3b731e1",
      "title": null,
      "text": "Prevents my phone from connecting to IOT devices in my home. Won't allow my homepage to display correctly when opening chrome on my PC. Slows my internet connection down for more than I'd like. Also experienced a few occasions where the software is just out of commission.",
      "replyDate": "2024-03-18T15:19:36.582Z",
      "replyText": "Hello. We apologize for the inconvenience. Please try disabling Invisibility on LAN and switching between different VPN protocols (UDP, TCP and NordLynx) in the settings of the NordVPN app. If the issues persist, kindly reach out to us at support.nordvpn.com. -Drea",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "fe1522ee-d66d-4e97-9294-5a73b887e534",
      "userName": "Darren Fenley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI0eHKX0vq5hEcLAuzb2UOKE6dfe-nDSWfDklhxKu5P=mo",
      "date": "2024-03-12T01:00:28.751Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=fe1522ee-d66d-4e97-9294-5a73b887e534",
      "title": null,
      "text": "Extremely slow and 50% of the time does not connect at all- on top of that it is nearly impossible to cancel your subscription as they don't give you ANY option to do so in the app. This is an extremely fraudulent business practice and I'm wondering if how they can legally get away with that",
      "replyDate": "2024-03-12T06:23:41.201Z",
      "replyText": "Hello. Please try switching between UDP and NordLynx connection protocols in our VPN app settings, then check if your connection speed gets better. As for subscription cancelation, get in touch with us at support.nordvpn.com, and our team will cancel it for you. -A.Z",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "27eb8ecd-2183-4467-b140-d79795fdf1d0",
      "userName": "Bob Dod",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVxt5ffMAwV1g3b1axF8keeYpFw6zRO3YtUX0mR3plDHSs",
      "date": "2024-03-05T22:57:31.608Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=27eb8ecd-2183-4467-b140-d79795fdf1d0",
      "title": null,
      "text": "We rely on NordVPN for security at home in the states, but it's doubly valuable when we're in the Caribbean. It will occasionally switch from a US network to a Costa Rica or Columbia network, but that's not really a problem for us. No complaints here!",
      "replyDate": null,
      "replyText": null,
      "version": "6.29.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "210e305d-b35b-496f-86f0-e573700ebef1",
      "userName": "Alvian Wisudawan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXstznX5RBS6oxg_hHZIL0s9oy_Rza8GfcD-s2lcJ95sMAE",
      "date": "2024-03-09T18:33:55.821Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=210e305d-b35b-496f-86f0-e573700ebef1",
      "title": null,
      "text": "#ANOTHER EDIT 1 STARS AGAIN AS THE ISSUES GET WORSE. **** It. Delete the app and probably never come back. You ruin my work. I would rate 0 star if there is available. Connecting, reconnecting here and there. It truly kills me #edit After i enable TCP protocol in app settings, the issue seem fixed. Fair play though.",
      "replyDate": "2024-03-08T19:37:42.403Z",
      "replyText": "Hi! If you’re experiencing connectivity issues, please try enabling TCP protocol in our app settings and connecting to Obfuscated servers. If the matter persists, do not hesitate to contact our support team at support.nordvpn.com for further assistance. -G.M.",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "2b2d4379-0999-47d9-b680-ed275bb6bfeb",
      "userName": "Eamonn Horan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUdlgaloFeUOPhMZ5-htpBNOOhp315YasB_cLZS0Qt-oBw",
      "date": "2024-03-07T01:21:16.739Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=2b2d4379-0999-47d9-b680-ed275bb6bfeb",
      "title": null,
      "text": "You guys are obviously an effective app. I wasn't even able to log into applications that I had. I had to actually pause nordvin to be able to access it. And it was so easy just to turn it back on My phone was acting funny on the day I decided to download this app. It is no longer acting awkwardly like my screen would shine bright and dim and shine bright and Dim, it no longer does that... You guys help me sleep easier. Twelve stars thank you...🎆",
      "replyDate": null,
      "replyText": null,
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "3fe51748-3c45-4e0e-b14c-055fca1d0725",
      "userName": "Paul Childress",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXfkoY6jZclQc8Ind5F31LUcbf7m7ugDZI7MJjG695aDE4",
      "date": "2024-03-14T18:57:20.302Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=3fe51748-3c45-4e0e-b14c-055fca1d0725",
      "title": null,
      "text": "I already had McAfee VPN. I was overseas trying to watch The super bowl. Iwas hoping this one might be better. I canceled before the end of the trial and they charged me anyway. After asking for several attempts that they refund my money. Now they want a screenshot of when I canceled it. I don't think that's even possible now...",
      "replyDate": "2024-03-14T23:42:22.548Z",
      "replyText": "Hello. Our apologies for the inconvenience you had with our customer support team. Could you please update your review with the Ticket ID you received so we could double-check the situation? -G.M.",
      "version": "6.29.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "1255dbd0-ab13-43a2-8645-27bca121c2c4",
      "userName": "Lance Walesh",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK5Yr_NtZuCRJELfNSLB9DKqgjpy7CmsbM186wFfmX-=mo",
      "date": "2024-03-08T14:26:51.970Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=1255dbd0-ab13-43a2-8645-27bca121c2c4",
      "title": null,
      "text": "When it works it's fine but all the random disconnects and the random having to switch which server im connected over amd over just for it to work are annoying. Lots of ppl in the reviews seem to have this issue too. Also look for the AI generated reply underneath this review telling me to put in a support ticket lol fix your app",
      "replyDate": "2024-03-08T15:01:54.580Z",
      "replyText": "Hello, Lance. We don't use AI to respond to our customers. The connection shouldn't be this intermittent. Please try switching between different VPN protocols (UDP, TCP and NordLynx) in the settings of the NordVPN app. If the issue persists, kindly reach out to us at support.nordvpn.com. -Drea",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "f1950433-cf59-49ce-94f0-d247373b1db5",
      "userName": "Brad Ley",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXOqMuNwNY9kZF4HMB7YZ0jgESGDFsEsqMoXxc3YoVTCQ",
      "date": "2024-02-28T20:09:48.446Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=f1950433-cf59-49ce-94f0-d247373b1db5",
      "title": null,
      "text": "I have on both PC/Android. It works fine as a VPN. The problem is, if you want 24/7 protection, NordVPN won't work. It randomly pauses protection on both my PC/Android device, on average every 3 days. It will not tell you it turned off the VPN. on top of that it requires you to manually log in ALL THE TIME, turning off your protection. You need the internet to log into NordVPN, so if you have it set to \"killswitch mode\" on PC, you're out of luck, and must uninstall and reinstall to log in",
      "replyDate": "2024-02-28T21:21:07.155Z",
      "replyText": "Hello! We’re sorry to hear about the experience you had with our VPN service. Please contact our customer support team at support.nordvpn.com, and they will help you out in this situation. Let us know how it went afterward! -D.I",
      "version": "6.29.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "72ed66ea-f9ee-4090-8c5b-ac5ff6aa7a70",
      "userName": "Indy Navarro Vidal",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXXf5innvCWIPQzn9A7gmzknKw_qXLO9tZ4tDFW9xzUicc",
      "date": "2024-03-02T08:36:25.832Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=72ed66ea-f9ee-4090-8c5b-ac5ff6aa7a70",
      "title": null,
      "text": "I just changed to proton vpn and I wanted to stop using this service. unfortunately I didn't correctly do the operation for cancelling the auto renewal subscription and I received the billing anyway. I contacted this company just a couple of days later to see if they could cancel this renewal and give me back my money and they just replay is not possible because the terms. so now I am been charged for a service I would not use. I recommend to anyone just use proton vpn.",
      "replyDate": "2024-03-02T05:51:42.445Z",
      "replyText": "Hello. Our refund policy only applies to your initial purchase, thus we are unable to refund recurring payments. As for the renewal, we always sent email reminders to our customers informing them that their subscription will be renewed. Feel free to contact our customer support team at support.nordpass.com if you have any further questions. -A.Z",
      "version": "6.29.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "817b54a5-2a79-47ce-9bac-398af178148e",
      "userName": "Stanis Zhorin",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUZhZ7E0Zv70E1_dL-bQkjujXjppMhIEe3WXNql64MkiUM",
      "date": "2024-03-07T11:44:45.695Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=817b54a5-2a79-47ce-9bac-398af178148e",
      "title": null,
      "text": "EDIT: Reached out to the support channel, excellent communication, get subscription cancelled and got a refund. Thanks! Original review: Email about end of trial period didn't had option to cancel subscripton. Now I've paid £60 for service I do not need.",
      "replyDate": "2024-03-07T11:17:31.715Z",
      "replyText": "Hello, Stanis. Would you be able to contact us at support.nordvpn.com? We'd be happy to help you. -Drea",
      "version": "6.30.1",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "7ed026dd-4ee5-45ec-ac92-2bb8e2d24661",
      "userName": "Jeff Baldwin",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW6SS5QjFd2FwKVTJjKrIuk5273FrWSxbLM2hZymmri2R4",
      "date": "2024-03-04T03:02:46.433Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=7ed026dd-4ee5-45ec-ac92-2bb8e2d24661",
      "title": null,
      "text": "Canadian in Florida wanting to stream canadian sports from my satellite company, which has decided to aim their service north of the border. I find the servers in Toronto to be very overcrowded, and it drops the VPN constantly. All of my equipment is up to date and new. My internet measures 500mbps download. I can't even get 3-4 mbps then 0 (zero) from this VPN. Edit: I switched setting to Open Vpn UDP as suggested, and I'm watching the Brier, and slightly less irate. Let see tomorrow.",
      "replyDate": "2024-03-04T02:37:22.260Z",
      "replyText": "Hello. We would recommend switching the VPN protocol within our app settings to OpenVPN UDP and checking if the situation improves. If you need any further assistance, we are always ready to help you out via live chat at support.nordvpn.com. -K.T",
      "version": "6.29.1",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "88817908-30d4-4bb9-b09c-fa3d54171f7b",
      "userName": "T J",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW_qdH4H4XcqP9Bdir2f0XUPmTJInicDoSTES5eOm_PMrc",
      "date": "2024-03-17T21:17:49.825Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.nordvpn.android&reviewId=88817908-30d4-4bb9-b09c-fa3d54171f7b",
      "title": null,
      "text": "Stop with the incessant ads on the notification panel. I have already paid a subscription and I'm not f'n interested in referrals etc. I have to disable the notifications, really frustrating!! At least provide an opt out so I can at least enable the VPN controls on the notification panel.",
      "replyDate": "2024-03-17T22:32:47.110Z",
      "replyText": "Hello. Apologies for the inconvenience. Please contact our customer support team at support.nordvpn.com for them to provide you assistance on these notification disabling. -G.M.",
      "version": "6.30.1",
      "thumbsUp": 0,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CmoKaDAsMTAwMDAwMC42ODk1MzM2NTA5LDQ2OTM2NzM0MzcwLCJodHRwOi8vbWFya2V0LmFuZHJvaWQuY29tL2RldGFpbHM_aWQ9djI6Y29tLm5vcmR2cG4uYW5kcm9pZDoxIiwxLGZhbHNl"
}