{
  "data": [
    {
      "id": "3073b46d-2011-49bf-9aa7-8759be7590a0",
      "userName": "babieyoonii ᴖᴥᴖ",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX1m97itQLveu24kbBjDX56-SwtKVCoOvp6zhGi6FqD0OTb",
      "date": "2024-03-09T16:48:02.482Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=3073b46d-2011-49bf-9aa7-8759be7590a0",
      "title": null,
      "text": "I used to love this app. Now, it's mostly useless to me (I use Route instead). I went to check it today, and at least 10 non-Amazon orders that were all delivered over a week ago were still marked as in transit! Even with packages that are still in transit, it shows days behind the tracking on the carrier's site and my other tracking app. Plus, Amazon NEVER works! Every time I open the app, I have to reconnect Amazon. Even after reconnecting, the orders still won't load properly or at all.",
      "replyDate": "2024-03-09T16:52:34.802Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. As I can completely understand the impact of this, I've gone ahead and shared your feedback with our developers. This will allow us to consider this in future updates. - Blair, Shop Support",
      "version": "2.146.0",
      "thumbsUp": 108,
      "criterias": []
    },
    {
      "id": "dc7a7ced-d439-47bf-b4d0-4e4c9e1e7d7e",
      "userName": "Erik Kruse",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUA6ajXWSBWFUWQbLYtJUlzliH72BIfLCGKinDHrbK1FpYJ",
      "date": "2024-03-15T19:54:53.310Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=dc7a7ced-d439-47bf-b4d0-4e4c9e1e7d7e",
      "title": null,
      "text": "This app has great connectivity to all of my orders confirmed through email, as well as amazon. It's nice to have all the info in a centralized place. HOWEVER, the \"Shop Cash\" you earn while using the app has very short expiration and I've lost out on too many of the benefits in just the last year or so I've been using this app. Rakuten is definitely my preferred app over this because it's far less stressful to use and there are no deadlines on utilizing the benefits. Hope this changes!",
      "replyDate": "2023-02-27T18:54:36.353Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We would love to understand the issues you're experiencing with downloading the Shop app. If you're open to it, please reach out to us: https://bit.ly/3GOrqoN We'd be happy to take a closer look at this issue to find a resolution!",
      "version": "2.147.0",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "c19a625d-36c4-4835-9a7e-6224826c10da",
      "userName": "Leigh Chang",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVnYs7p2gmm8sW2YXNtk5L6GFjKSU4I1an4xqvjA8WLMiAq",
      "date": "2024-03-12T16:36:29.855Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=c19a625d-36c4-4835-9a7e-6224826c10da",
      "title": null,
      "text": "The app works much better lately, however, I've been having trouble with something. Sometimes one of my orders will ship in 2 shipments, with one being delivered before the other, marking the entire order as delivered in my list. I try to manually track the second order, but it says I'm already tracking it. I recently figured out where to see both tracking numbers, however, there is no way to mark the order as only partially delivered. It's so complicated to track the 2nd shipment.",
      "replyDate": null,
      "replyText": null,
      "version": "2.146.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "75f51c87-b7fc-4672-b031-5aed3e6a1435",
      "userName": "Marissa E.",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWan93-Vr2b2CQBclOHuGiLmN6WH217ODcyhEtwp6DnXq2e",
      "date": "2024-03-10T14:36:46.204Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=75f51c87-b7fc-4672-b031-5aed3e6a1435",
      "title": null,
      "text": "It was very organized and helpful. Now my payment plans don't show up. I don't like that there is not a specific spot for them anymore. There are literally no recent dates when I make purchases for payment plans, or when I pay it off. It makes me not want to use it for payment plans anymore. Just shipping updates Update: emailed customer service, other than telling me how to use the app. The way to fix the updates is to click the link myself from my email. This doesn't fix the problem w/the app",
      "replyDate": "2024-03-10T14:43:21.890Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. As I can completely understand the impact of this, I've gone ahead and shared your feedback with our developers. This will allow us to consider this in future updates. - Blair, Shop Support",
      "version": "2.146.0",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "41bdec67-7bb6-4f40-ad01-92a997dae2fb",
      "userName": "Edgar Garcia",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJve1tKMScw4VlyE7ajdzlnib8b8hUZpRSUFWCevCmu=mo",
      "date": "2024-03-17T05:42:38.749Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=41bdec67-7bb6-4f40-ad01-92a997dae2fb",
      "title": null,
      "text": "App is fine except for one thing. The number one thing about the app is when a package is going to be delivered, the picture goes from the product you ordered to a package and won't tell you what it who the seller is and becomes a pain when you have multiple packages and you get notified something was delivered but you don't know what. The notifications are super delayed, so it makes keeping track harder than need be. Just don't change the image, and that fix it",
      "replyDate": "2024-03-17T14:23:29.629Z",
      "replyText": "Hi, there. Thank you for your review and suggestion! I've passed your feedback on. I also wanted to let you know that we are aware there can sometimes be a delay in tracking updates. We get our tracking updates directly from the carrier delivering your order and are working on ways to ensure this is as accurate as possible. -Erin, Shop Support",
      "version": "2.147.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "07b24ff6-ddaf-4631-a1bf-e6d586177a1f",
      "userName": "Carly Kimont",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXD7mmV1sP2DSJ1qmcI6rDyk-YxU0WVpEb59jFTBDojyxob",
      "date": "2024-03-14T18:58:49.279Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=07b24ff6-ddaf-4631-a1bf-e6d586177a1f",
      "title": null,
      "text": "The app used to be wonderful at tracking, especially importing order details from my email. Now, it NEVER connects my Amazon, never tells me when things are actually delivered, and I have to manually push just about every single order that wasn't purchased through the app itself. I truly feel like the main goal of this app was always to make money off our purchases, not necessarily for tracking. So unfortunately it has become an afterthought.",
      "replyDate": "2024-03-14T19:15:08.952Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We're sorry to hear you didn't have a great experience with our app and we would love to understand the issues you experienced. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution! - Dirk, Shop Support",
      "version": "2.147.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "ca083a24-0a9e-4f4e-9328-1a6948605a57",
      "userName": "BJ Jongejan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWixMgZdG_aCoGuLgVnbXKXVN3FV80gp76lHy_br6CSaAc",
      "date": "2024-03-11T16:57:29.306Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=ca083a24-0a9e-4f4e-9328-1a6948605a57",
      "title": null,
      "text": "This app has become much worse for keeping track of orders over the years. It rarely ever actually imports my orders from emails and my accounts, and usually takes forever for them to load all of the information, when I can find it instantly by just looking at it on the apps I ordered from. Not to mention, the map view of where the packages were located relative to me, is now not showing anymore, which was the primary reason I chose shop over other tracking apps.",
      "replyDate": "2024-03-11T17:05:36.591Z",
      "replyText": "Thank you for taking the time and sharing this feedback. If you're experiencing these issues on the latest version of our app, then you can report the bugs and/or share improvement suggestions. Please get in touch with us here: https://shopify.link/bP6A. Cheers. -Elias, Shop Support",
      "version": "2.146.0",
      "thumbsUp": 42,
      "criterias": []
    },
    {
      "id": "0d5d7bb7-03d2-4eb1-9729-b244b70c68d8",
      "userName": "Maranda White",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWf0EWpVUDfuBW9U5yD8GoIFo6DIaVQ0q8oU0ZYQxkM5O4",
      "date": "2024-03-03T03:42:56.237Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=0d5d7bb7-03d2-4eb1-9729-b244b70c68d8",
      "title": null,
      "text": "It used to be better. I liked it a lot more in the beginning it was alot more simplified. Now there is a lot going on when you open the app and orders are vanishing. You try to enter the tracking manually and it tells you the order already exists yet doesn't show up anywhere. I hope they fix this and bring back a simpler look that is about the orders and not all the businesses they try to advertise.",
      "replyDate": null,
      "replyText": null,
      "version": "2.145.0",
      "thumbsUp": 29,
      "criterias": []
    },
    {
      "id": "8b419183-8944-4fe7-8404-3833dc6de459",
      "userName": "Acenaia Fall (Ace)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWdOnWhgjzzfL7RYatxHXUdBB1ndPDJ5Sa3O0ixNOuHkzJd",
      "date": "2024-02-28T08:22:36.859Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=8b419183-8944-4fe7-8404-3833dc6de459",
      "title": null,
      "text": "Generally I like this app, but it's become insufferable with Amazon orders. I've had to change email addresses on Amazon to avoid the app attempting to track every time I change/add a subscribe and save or preorder. I'm now stuck attempting to clean up the mess one by one because there is no way that I could find to mass archive/delete orders (please implement this if it isn't an option!) It's just a bit of a headache with that.",
      "replyDate": "2024-02-28T08:55:36.304Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We would love to understand the issues you're experiencing with using the Shop app. If you're open to it, please reach out to us here: https://bit.ly/3FAFUbg. We'd be happy to take a closer look at this issue to find a resolution! -Iris, Shop Support",
      "version": "2.144.0",
      "thumbsUp": 224,
      "criterias": []
    },
    {
      "id": "d08179b7-3edc-4fea-9e15-54718c88cc29",
      "userName": "Rebecca Rubright",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUn4Qge4xeIwiZ7vzGD06ty06Z61MNN7VzWNeN5B2vqXA",
      "date": "2024-03-05T12:38:18.693Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=d08179b7-3edc-4fea-9e15-54718c88cc29",
      "title": null,
      "text": "I actually really like this app, I don't love when apps have access to everything in my life for data privacy reasons HOWEVER when they're actually providing a valuable/useful service, it's worth it and the shop app is that. I like that I can get rewards and multiply them in the app, and it's super convenient to tract all orders in one spot-- especially around the holidays! I wish the rewards didn't expire so quickly but honestly it's better than not getting them at all!",
      "replyDate": null,
      "replyText": null,
      "version": "2.145.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "7275cfcc-655b-4d5c-90fa-57c8068344ae",
      "userName": "Sarah Kizer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV63cy4f2ZHHC5dvAt0OnpvKOh3wQcW_ClGJmzgGexgJnFZ",
      "date": "2024-02-17T01:13:50.670Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=7275cfcc-655b-4d5c-90fa-57c8068344ae",
      "title": null,
      "text": "I hate this app. Tracking is not updated in a timely manner. It is 2-3 days behind what shows with the carrier tracking site. Amazon doesn't work at ALL! You connect Amazon, and a browser window opens to your Amazon orders that keeps flashing/resetting. And even when it did work, It didn't update the tracking at all. To the point where the package never updated to say what the order was, never said when/if it would be delivered, or both.",
      "replyDate": "2024-02-17T01:31:46.994Z",
      "replyText": "Hi there, Sarah! Thank you for your review of the Shop App! Tracking information is fed into the Shop App based on updates from the business and from the shipping carrier. We're also working hard to resolve these Amazon account issues. Please make sure your app is updated to it's latest version as this should resolve things! -Imogen, Shop Support",
      "version": "2.143.0",
      "thumbsUp": 448,
      "criterias": []
    },
    {
      "id": "59cb1526-b714-4285-a041-39cd42456f8f",
      "userName": "San-Seo Chu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWGdKt-tbyowjXY2tlsuFYxkVaPnaIRugrAoKtea7FGdTp_",
      "date": "2024-02-12T15:43:06.764Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=59cb1526-b714-4285-a041-39cd42456f8f",
      "title": null,
      "text": "Loved this app in the beginning, used to track all my deliveries in one spot without having to hunt. Love that you can manually add in shipping info. I love that it searches through your email for shipping info, too. Even loved that it tracked down Amazon purchases too, but lately, it will not connect to Amazon. When I go to reconnect the account, it lets me log in, but the browser flashes violently and doesn't reconnect the account to track deliveries.",
      "replyDate": "2024-02-12T15:55:48.339Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We're glad to hear that you have been enjoying the app. Please ensure that the app and your device are fully up-to-date. If you still have issues, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a closer look at this issue to find a resolution! -Mac, Shop Support",
      "version": "2.142.1",
      "thumbsUp": 209,
      "criterias": []
    },
    {
      "id": "cd3b326a-1167-4dc3-8d55-dcf25fb1fcff",
      "userName": "Steve Breiner",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV9V66S4jstb6xuHeoE_anLilfjbH0h970YGGLEfZrhD9w",
      "date": "2024-02-20T17:04:09.960Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=cd3b326a-1167-4dc3-8d55-dcf25fb1fcff",
      "title": null,
      "text": "Originally a great order tracker, morphed mostly into a shopping ad platform. I originally downloaded this app and loved its order tracking focus - one that aggregated orders in a clean, easy to find list. Over time, ads have taken over some tabs and the real estate on the home page has been mostly consumed by images (ad- and order-related) so large that only one entry time fits comfortably on the screen... it has become little better than scrolling through email for tracking updates.",
      "replyDate": "2024-02-20T17:16:22.562Z",
      "replyText": "Thank you for your feedback and review. -Emily",
      "version": "2.143.0",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "016a058c-287c-4959-bd22-d2232633a5a5",
      "userName": "Kousei Argento",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVDQTunRXO7plUOimjYalKEaBIzlR3IOiE5WS8GZARk0Tw",
      "date": "2024-02-19T10:50:57.419Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=016a058c-287c-4959-bd22-d2232633a5a5",
      "title": null,
      "text": "This app has prevented me from ordering quite a few items due to its faulty two factor authentication you cannot disable. Even worse, all items on the application are increased in price anywhere of 10%-100%. Half the time, it's rewards don't even work as advertised, as you would need to purchase a certain amount of items for the full reward",
      "replyDate": "2024-02-19T11:01:56.383Z",
      "replyText": "Hello! We appreciate you for checking out Shop. We regret to learn that your experience with our app wasn't satisfactory! If you're willing, please contact us at this link: https://shopify.link/bmyj. We are more than willing to investigate this matter further to provide a solution! -Maz, Shop Support",
      "version": "2.143.0",
      "thumbsUp": 72,
      "criterias": []
    },
    {
      "id": "c9372e9a-6708-4b63-aa25-4443df2a63f5",
      "userName": "Kelsey Hucker",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWI1xbGJ5O9-cIffZh3cqhIjYq9u8909a_YVWy50op2K7c",
      "date": "2024-02-28T19:11:11.697Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=c9372e9a-6708-4b63-aa25-4443df2a63f5",
      "title": null,
      "text": "It used to be a lot better than it is. I've loved using this app to keep track of everything but I don't know if it was the last update or what, but recently orders have been vanishing from the tracking, and it's not updating what it is tracking recently even if the tracking # itself shows updates on the courier website. Amazon also just disconnects constantly have completely given up on that front. When it works it's good, when it doesn't it's a pain.",
      "replyDate": null,
      "replyText": null,
      "version": "2.144.0",
      "thumbsUp": 42,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "e10960f4-0995-47ca-ab8e-af1c329fde15",
      "userName": "The Unseen Girl",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWyZtKgPwcRvKMkQyH76vHJ-u_wQ0RvGMrOFYqlrcT4Zq8",
      "date": "2024-02-29T19:03:40.822Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=e10960f4-0995-47ca-ab8e-af1c329fde15",
      "title": null,
      "text": "Is anyone else having issues with it doing absolutely nothing when you click on the app just to open it? It keeps buffering. It hasn't taken me to a loaded screen yet. I've tried uninstalling the app and reinstalling it but still nothing.. I really need to track my order and get reassurance that i wasn't just scammed. Please fix this like ASAP?! Also, is there an alternative app for me to use in the mean time to track my package until the issue is resolved? Thanks",
      "replyDate": "2024-02-29T19:12:38.145Z",
      "replyText": "Thanks for the review. I would suggest checking to see if you have an available update for your iOS or Android device. Additionally, if you have received a tracking number for your package/order - you can navigate to the shipping carrier website to track your order. -Ollie, Shop Support",
      "version": "2.145.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "2e97d8a6-f0fa-42aa-8bff-69017a55f451",
      "userName": "Dominick Aven",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKiMZzo_FjFgdjFwIafHbab9PGCABAmjo8nqmrZixx3=mo",
      "date": "2024-02-26T21:13:39.149Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=2e97d8a6-f0fa-42aa-8bff-69017a55f451",
      "title": null,
      "text": "STAY AWAY! STAY AWAY! STAY AWAY! This app has the worst customer service to date. No way to contact them with problems with orders. They take your money but leave you in a lurch if there is a problem. I believe it is time to cancel the app and uninstall. I ordered from one of their stores and now the store is not responding. Email undeliverable! Tracking read delivered, but nothing showed up. Total ripoff! will not trust them again. Out my $. Customer service is a worthless FAQ page.",
      "replyDate": "2024-02-26T21:25:09.719Z",
      "replyText": "Hi! Shop is a shopping destination and tracking app for online orders and deliveries. We do not manage the day-to-day operations of the merchants. You can use this portal to report stores that you suspect are using our platform fraudulently: https://shopify.link/VdZx. You can also contact your bank to trigger an investigation -Mac, Shop Support",
      "version": "2.144.0",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "f68bfde0-cbc7-4919-b59f-7e51c5efe075",
      "userName": "Mrs Files",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKsGtpMouQw2uA8BGpWt9fAoqfD6YyO9eHbNGjC-sZW=mo",
      "date": "2024-01-29T18:01:10.362Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=f68bfde0-cbc7-4919-b59f-7e51c5efe075",
      "title": null,
      "text": "I used to love this app. Now it's having problems tracking things. And as far as using their \"points\" to buy things, buyer beware! I ordered using their points, never received the order, and they have no way of getting ahold of the seller or refunding the purchase!!! I'm uninstalling. As for your response, the purchase was made through your app. Emails to the seller bounce back as undeliverable. And the only way to contact you is through AI Chat which was of no help either!",
      "replyDate": "2024-01-29T17:22:03.632Z",
      "replyText": "We're sorry to hear you haven't received your order. Our app helps customers coordinate deliveries and online orders in one easy place, but we don't play any role in the fulfillment process. We recommend reaching out to your bank if the business you purchased from has become unresponsive. Hopefully they can assist further! -Shay, Shop Support",
      "version": "2.140.0",
      "thumbsUp": 378,
      "criterias": []
    },
    {
      "id": "8e464c89-89c9-4f37-ab76-c0dce9b30d6a",
      "userName": "Andrea Bustamante",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVCRv_5iv7UgIfLj5kGUM_SNXrHVjKfCxo9lA2_RX2Q4Q",
      "date": "2024-03-05T05:11:50.175Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=8e464c89-89c9-4f37-ab76-c0dce9b30d6a",
      "title": null,
      "text": "Apps sucks. Downloaded it and I still can't find my tracking info because it doesn't give me the option to add my email. It only accepts emails from Gmail, Outlook, and Amazon. Edit: I never got a tracking number from the store either. Why doesn't this app automatically give us OUR tracking numbers? It's because you want us to download your app so you have access to our phones. 2nd Edit: then what good are you if no tracking?",
      "replyDate": "2024-03-05T00:23:38.157Z",
      "replyText": "Thanks for your edited review! The Shop App provides you tracking information based on what is provided to it by the business you ordered from, and from the Shipper Carrier they use. We're unable to automatically generate a tracking number as the shipping carrier is the entity that assigns a tracking number to your order. -Imogen, Shop Support",
      "version": "2.145.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "cd0422e3-8fc0-4777-beb2-4da07aa46b6a",
      "userName": "Leslie Witherspoon",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWwMHxyfnH4Uvbk8eDqiCiNLKeotewsMqDQpvTN6gFhpCA",
      "date": "2024-03-08T21:58:26.541Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=cd0422e3-8fc0-4777-beb2-4da07aa46b6a",
      "title": null,
      "text": "Well the first thing that's good about Shopify is the fact that all of my orders can be aggregated into one app. But the second thing that's really great about Shopify is that I get to know step by step where my items are. So I'm able to schedule my day in such a way that I'm always available to pick up my items when they are delivered. I don't have to worry about porch thieves or things that got lost in shipping. It's also convenient that I can repurchase things through the app",
      "replyDate": null,
      "replyText": null,
      "version": "2.146.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "2af2139e-ff84-48ff-9778-33679ee02121",
      "userName": "Ken Briggs",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJU0FvtjVCK0cZkc78QXjznx-XTuEMVjLCwNcySxW8X=mo",
      "date": "2024-02-07T21:03:10.812Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=2af2139e-ff84-48ff-9778-33679ee02121",
      "title": null,
      "text": "This app was good when I first installed it. I wanted to be able to track packages to be delivered to me. Lately, I have had very little information on shipping and carrier. Also, not all of the retailers I have been receiving packages from are showing up anymore in the app. I realize the need to generate revenue through advertising but I am strongly opposed to it showing upon opening the app. I am more interested in my deliveries than the ads.",
      "replyDate": "2024-02-07T21:14:55.863Z",
      "replyText": "Hi, Ken. Thanks for your review. The info shared regarding your orders in Shop is provided by the business you've ordered from. When the business has new information regarding the shipment to provide, that data will populate. If you have feedback you'd like to share, please do so through this link: https://shopify.link/bmyj. -Imogen, Shop Support",
      "version": "2.141.0",
      "thumbsUp": 92,
      "criterias": []
    },
    {
      "id": "cf119b95-7c05-4526-a6e1-83473916c881",
      "userName": "Aura",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW6t0cEvrx-BEzNbOPdzBC4HZMp4zsWI5EqAQuT2oGoTw4",
      "date": "2024-03-10T06:51:51.330Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=cf119b95-7c05-4526-a6e1-83473916c881",
      "title": null,
      "text": "Its pretty useful for third-party shopping websites, thats the plus. Maybe im uneducated, but it wants access to your google account. Not just data, not just your address to send notifications, ACCESS to your google account. I cant trust an app that wants so much control over your account to such a degree. Having the address and related data alone should be enough. Seems pretty sketchy.",
      "replyDate": "2024-03-10T07:03:18.260Z",
      "replyText": "Hi there! Shop uses software to automatically identify emails with keywords to track orders but by sharing your email with Shop, no humans will have access to your content. We’ve worked with Google to ensure your information is secure. You can check out our Privacy Policy here https://shopify.link/lLl1. -Victoria, Shop Support",
      "version": "2.146.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "25534327-1391-4db9-a4e0-3f33cc297686",
      "userName": "Cody Newberry",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVLPkykNVpuRVhohL9mr_ftjXYS8DtC196o5NND-0W3YsQ",
      "date": "2024-02-01T18:21:21.233Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=25534327-1391-4db9-a4e0-3f33cc297686",
      "title": null,
      "text": "Terrible app. I can understand keeping all your orders in one app, but I can't even get the tracking numbers out of the app. So I just get to look at a little bar, which I can do from the ambiguous email from the companies. Like every shipper has an app and I can just blindly enter the tracking into Google and get redirected automatically. It offers nothing for me and I don't like that I'm forced to use it by companies.",
      "replyDate": "2024-02-01T18:40:19.938Z",
      "replyText": "Hi! Thanks for your review. Shop is an optional service that businesses offer their customers at no charge. You can use it to coordinate deliveries and orders in one easy place, as well as connecting and shopping with your favorite stores. You can also use the tracking numbers provided by the retailers instead of the app! - Greta, Shop Support",
      "version": "2.141.0",
      "thumbsUp": 135,
      "criterias": []
    },
    {
      "id": "968da424-5854-4386-86da-3e8951712713",
      "userName": "Judi Boyle",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKJJ6QTS5cONNQ7hVyTrDmIopCj8toSnegRBF-6cSvF=mo",
      "date": "2024-02-09T17:59:11.360Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=968da424-5854-4386-86da-3e8951712713",
      "title": null,
      "text": "App gives rewards for purchases. I tried to use the rewards toward a purchase and it wouldn't process my credit card. Card had more than ample funds. There was a glitch with processing the payment then my rewards disappeared. I contacted customer service and got many automated responses. Finally a person answered and wanted a screenshot of the error message. Impossible to recreate without ordering. Why would I order again when it took away my reward money. Not worth the hassle.",
      "replyDate": null,
      "replyText": null,
      "version": "2.141.0",
      "thumbsUp": 52,
      "criterias": []
    },
    {
      "id": "d1411e11-f264-40e3-bf2e-608d71ece99d",
      "userName": "Sam Shipwash",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKqqPv0K5pFpvmcRhwq4_rJsNjgKw9ML1b5Uc3BDb53=mo",
      "date": "2024-02-06T02:40:36.425Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=d1411e11-f264-40e3-bf2e-608d71ece99d",
      "title": null,
      "text": "I used to love this app, but nothing is tracked correctly anymore. All I have is a ton of orders, \"Waiting for Details,\" (all of these orders are past Amazon orders that have already been delivered), so it literally tracks nothing anymore. Deleting and re-downloading doesn't fix the issue either, so the app is now pointless. Very disappointing.",
      "replyDate": "2024-02-06T02:51:46.477Z",
      "replyText": "If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution. -Victoria, Shop Support.",
      "version": "2.141.0",
      "thumbsUp": 120,
      "criterias": []
    },
    {
      "id": "1edd160e-4537-4a05-9391-8523e39e8874",
      "userName": "Domonique Ellis",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW3Dud-r2UJ7eKBR9GKwRoqAIyhW0iTAF5TRsX2gXyl5A",
      "date": "2024-01-17T20:16:26.942Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=1edd160e-4537-4a05-9391-8523e39e8874",
      "title": null,
      "text": "Great app but when you have issues, their in app support feature does not work. I've been trying to get a refund from one of their merchants for an order I paid for but never received. I contacted the seller and they've not responded (Clarissy). Upon reading other reviews, made by other customers, many people have experienced the same issue. This merchant should be removed from the app so that more people don't continue to get scammed.",
      "replyDate": "2024-01-17T20:24:03.567Z",
      "replyText": "Thank you for your feedback. If you can not contact the store directly, please contact your bank for possible refund options. -Emily, Shop Support",
      "version": "2.138.0",
      "thumbsUp": 260,
      "criterias": []
    },
    {
      "id": "a3953864-e69d-4693-b96f-17f92ebfc3d5",
      "userName": "Nicole Vande Berg",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJUg2--RB2zWznOPOw-llYWikAGEDL9KzdcCQLSL0kP=mo",
      "date": "2024-02-22T21:18:36.153Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=a3953864-e69d-4693-b96f-17f92ebfc3d5",
      "title": null,
      "text": "With the updates the app is starting to feel easier to use. Easier to track orders and payments right from the home screen but I noticed there's still orders missing. It can still be difficult to navigate to actually review your order history. Feels like it's heading in a better direction but still buggy and missing information.",
      "replyDate": "2023-12-09T18:32:23.318Z",
      "replyText": "Hi, there! I'm sorry to hear you're having trouble with the Shop app. Feel free to get in touch with us here (https://bit.ly/3FAFUbg) and we'd be happy to answer any questions you have. - Greta, Shop Support",
      "version": "2.144.0",
      "thumbsUp": 40,
      "criterias": []
    },
    {
      "id": "4c11a496-ae86-4ada-926a-b0a7e35ede9e",
      "userName": "Paul Budlong",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVmM1Xm1BKcfaSC3lZruUx3ITiMI90PZm0pSl2AjQCZuGwd",
      "date": "2024-01-12T19:29:17.300Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=4c11a496-ae86-4ada-926a-b0a7e35ede9e",
      "title": null,
      "text": "Edit: Uninstalled and reinstalled, 50 orders are still 'waiting for details' and have to manually delete each one. 95% of my new orders do not appear in order tracking, and I have my email linked. I just track things from where I ordered it from now. The app is useless. A helpful feature would be to reset your orders. App went from 5 starts to 1 star overnight. I'm not even sure what the point of the app is anymore now that the order tracking, its main feature, doesn't work anymore.",
      "replyDate": "2024-01-12T19:32:22.982Z",
      "replyText": "Hi there, thank you for your review. I am sorry to hear that you've experienced these issues and would recommend reaching out to our support team directly so we can troubleshoot these problems for you: https://shopify.link/bmyj. -Victor, Shop Support",
      "version": "2.138.0",
      "thumbsUp": 237,
      "criterias": []
    },
    {
      "id": "5e6c2f3a-ce56-42d9-a68d-969d80065990",
      "userName": "Dan F",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUI-F5I5lDahJWjPMWx4tfIAbdYUVWqJj4NfqEje1O48fjI",
      "date": "2024-01-12T16:56:32.753Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=5e6c2f3a-ce56-42d9-a68d-969d80065990",
      "title": null,
      "text": "Horrible app. Shipment tracking is very inaccurate. Shows tracking for shipments that weren't even mine. The tracking of my packages never showed updated details, and even 6-month-old shipments we're still listed as in route. Also, many of the vendors on this app are scams that want your payment information but don't actually have products to sell, just fake listings.",
      "replyDate": "2024-01-12T17:06:43.857Z",
      "replyText": "Thanks for your feedback! We know the importance of accurate tracking information. While Shop's package updates come directly from the carrier, there can sometimes be a delay. We are looking at improving this and would love to have a closer look at this tracker - you can always reach out to us here: https://shopify.link/bmyj. - Dirk, Shop Support",
      "version": "2.138.0",
      "thumbsUp": 109,
      "criterias": []
    },
    {
      "id": "62f9628f-f390-49c2-9060-86c7a15ef993",
      "userName": "myprivatewasteland",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWiWReDwyIbogseEGKxab5kKn1_Q13NefJG3sxHjBt9kA",
      "date": "2024-02-23T01:33:06.379Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=62f9628f-f390-49c2-9060-86c7a15ef993",
      "title": null,
      "text": "Super easy to use. I have a few orders that don't update accurately but it seems that I have that problem with the same retailers often. Occasionally I have to mark something as delivered. I like that it gives me ads for similar things I've bought but from other companies where as most media platforms and search engines just give me ads for other products from the same retailer I bought from.",
      "replyDate": null,
      "replyText": null,
      "version": "2.144.0",
      "thumbsUp": 30,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "86d1d0b9-6f09-4a37-af26-8287f47f71f2",
      "userName": "Kole Hotzel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV-nmtXv9L0U_3PG0BK-IH_MaQUrCnzMIwwYJwSznGvZ3E",
      "date": "2024-01-13T18:44:20.461Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=86d1d0b9-6f09-4a37-af26-8287f47f71f2",
      "title": null,
      "text": "Shop is really good for helping me purchase stuff quickly, and I love the tracking. That's why I didn't rate it any lower because the earned cash option is BROKEN. Each time I try redeeming my cash that id earned for stuff, it keeps on saying, \"Offer ended for the day, check back later!\" Even though it's not an offer, it's what I've earned. Please fix!",
      "replyDate": "2024-01-13T18:52:23.341Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. If you haven't done so already, I'd encourage you to connect with our Live Support so we can take a closer look into this: https://bit.ly/2AWw5VA. - Blair, Shop Support",
      "version": "2.138.0",
      "thumbsUp": 54,
      "criterias": []
    },
    {
      "id": "6560f811-8cb9-43e9-bf2c-9da06711ed9a",
      "userName": "Suzanne Brignone",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXo_Iz0GQT_hGqpTpo8DHmkOg4lGU8Ug96CXJAntuvHRVQ",
      "date": "2024-01-24T21:11:34.661Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=6560f811-8cb9-43e9-bf2c-9da06711ed9a",
      "title": null,
      "text": "Fixed some issues, have a while new round with Amazon. Will add some orders automatically but not others, frequently show up as soon as I order but then never update with tracking info when it ships or creates a nameless/ pictureless duplicate with the tracking portion. I've had it create duplicates of items after they've been delivered and archived. Super clunky!",
      "replyDate": "2024-01-24T21:21:48.518Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. As I can completely understand the impact of this, I've gone ahead and shared your feedback with our developers. This will allow us to consider this in future updates. - Blair, Shop Support",
      "version": "2.140.0",
      "thumbsUp": 334,
      "criterias": [
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "311222da-0068-42c3-9214-6b013d5de238",
      "userName": "LeShawn Taylor",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXRXnJphTFdfjEDesupkd98wZO58UGE0slTOwbyfp9MWA",
      "date": "2024-02-15T06:49:19.401Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=311222da-0068-42c3-9214-6b013d5de238",
      "title": null,
      "text": "App is terrible. Most every website utilizing shop will tell you to \"track via the shop app.\" This is typically a dead end, with no tracking information offered whatsoever. I have items that are delivered that still show as an un-updated \"order placed\" because there's no tracking. There's an option to \"mark as delivered.\" You can expect to do this for most of your items, if you even receive them without the ability to investigate their handling.",
      "replyDate": "2024-02-15T06:56:21.908Z",
      "replyText": "Hi, LeShawn! If these are orders placed using Shop Pay or through the app, please report incorrect info so we can investigate: https://shopify.link/wNB6. -Sophia, Shop Support",
      "version": "2.142.1",
      "thumbsUp": 59,
      "criterias": []
    },
    {
      "id": "0d08ca09-5c2f-4514-84af-443cc24e7f47",
      "userName": "Delores Prichard",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLfbYl-1HVjANFDsiM4nTIY_OrcR3snClCWgbIKNV4u=mo",
      "date": "2024-02-25T14:11:27.448Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=0d08ca09-5c2f-4514-84af-443cc24e7f47",
      "title": null,
      "text": "Utterly useless if you don't use Gmail or Outlook. They don't support any other email options, so you can't get tracking for your packages. I use Yahoo. I use the Yahoo app for email. They don't provide package tracking on the website. They force you into the app. And then, they refuse tacking service unless you have Gmail or Outlook. Pisses me off.",
      "replyDate": "2024-02-25T13:59:37.320Z",
      "replyText": "Hi, there! Thank you for your feedback. I'm sorry to hear that you've had an unpleasant experience using the app. Shop is an optional service that businesses offer to their customers. You can always use a tracking code provided by the store and track your order on the carrier's website directly. - Dirk, Shop Support",
      "version": "2.144.0",
      "thumbsUp": 22,
      "criterias": []
    },
    {
      "id": "010297fb-938f-4bf3-b370-f36bd9d215b1",
      "userName": "Kookie Star",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXfr-jOMUopDr4p_llHffniiTxsTkgeMdXLt8iwju_hqRM",
      "date": "2024-01-27T05:25:06.462Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=010297fb-938f-4bf3-b370-f36bd9d215b1",
      "title": null,
      "text": "It could be a great app if it wasn't for the fact that it keeps disconnecting from my Amazon account so many times. Plus, I keep getting either duplicated product information and images (which absolutely confuses me) and also wrong product images and information. A good example of that problem is that yesterday, my mom was absolutely confused with the perfume she got from Amazon, and instead, the information showed her two lotion creams instead of the current thing. Also, wrong date information.",
      "replyDate": "2024-01-27T05:32:31.100Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We're sorry to hear you didn't have a great experience with our app and we would love to understand the issues you experienced. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution. -Victoria, Shop Support.",
      "version": "2.140.0",
      "thumbsUp": 66,
      "criterias": []
    },
    {
      "id": "dd910eb3-d978-4002-b9c3-b67507a67ab9",
      "userName": "Craig Foss",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjULivwrXFtLebME3jXFVqUGtbNA788i-DfUdXD1xwQliRVw",
      "date": "2024-02-15T21:52:23.575Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=dd910eb3-d978-4002-b9c3-b67507a67ab9",
      "title": null,
      "text": "Used to be all about tracking packages, now a lot more shopping oriented. It is nice to be able to track your package all the way from origin point to my front door. And to be honest, most of the shopping apps are applicable to me except for the one where they gave me, a 64-year-old male options for shopping for bras. Didn't understand that one, I have never shopped for bras. I have never looked in the Sunday section at the Macy's lingerie section, so there...",
      "replyDate": null,
      "replyText": null,
      "version": "2.143.0",
      "thumbsUp": 33,
      "criterias": []
    },
    {
      "id": "8428ef46-f782-4722-958c-f8e8b6e7a50b",
      "userName": "Daniel Sifer",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLX7xMeZD4yVpdwtOAmwai6ei8q6JnHIqeI8Yj_ZUgAVw=mo",
      "date": "2024-02-25T20:58:50.322Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=8428ef46-f782-4722-958c-f8e8b6e7a50b",
      "title": null,
      "text": "1. Way to much focus on advertising to you. 2. Email/Amazon integration is terrible!! 3. So very disappointing how the above makes, what seems to be an amazing concept and app, into useless garbage. What shop should be doing is making a UI that serves the users and organizing details about the good they buy online with flawless integrations into online shopping venues everywhere. Using that spending data to generate revenue and where the user can access at wil advertisement( or not at all)",
      "replyDate": "2024-01-27T04:12:47.800Z",
      "replyText": "Hey there! Thank you for taking the time to provide feedback about the Shop app. Our goal is to provide the best mobile tracking app on the market, while also helping you reconnect with some of your favorite stores. We're a tight knit team, so we'll make sure to channel this to the product team for their consideration! -Summer, Shop Support",
      "version": "2.144.0",
      "thumbsUp": 42,
      "criterias": []
    },
    {
      "id": "5bf0d1ce-6913-4e16-9c92-8ce6be95e33f",
      "userName": "HolyJIEbus (Jie Chung)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgu_j-3LjSaby-ZEODgzbP0IlIdWVy9yM3jBqigqcxkN4",
      "date": "2024-01-16T19:39:49.302Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=5bf0d1ce-6913-4e16-9c92-8ce6be95e33f",
      "title": null,
      "text": "Things I like: it aggregates all orders you place at different vendors and allows you to follow status of order in one screen. The app also gives you chances to save more money by reminding you which stores will multiply the shop cash you've collected. Things I wish they will fix: the filtering option of the app is very limited. For example, no option to filter based on available sizes for clothing and shoes. Sometimes what's listed on a vendor site WON'T be available on the app.",
      "replyDate": null,
      "replyText": null,
      "version": "2.138.0",
      "thumbsUp": 58,
      "criterias": []
    },
    {
      "id": "d9d2bf5d-90e0-4492-8841-f1560d1fbf9e",
      "userName": "Jay Rich",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJVAm-T3UbC4bAMYOl8XxvXLDdPFtPhK_BUvoDwsySxaTQ=mo",
      "date": "2024-02-21T17:50:41.423Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=d9d2bf5d-90e0-4492-8841-f1560d1fbf9e",
      "title": null,
      "text": "The Shop app tracks my package and also gives suggestions based off the product that I purchased or have viewed. The tracking isn't always as accurate as I would desire, and also, some of the suggestions are of the opposite gender. Updated review: they have gotten better with more accurate delivery times. I appreciate the improvement.",
      "replyDate": "2023-02-21T11:46:41.477Z",
      "replyText": "Hi, thanks for the feedback! We know how important it is to have accurate tracking info. While Shop's package updates & location come directly from the carrier, there can sometimes be a delay. We’re looking at improving this & can have a closer look at this tracker (& the gender recommendations) - please reach out to us here https://bit.ly/3Fzy1Tl",
      "version": "2.143.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "61503005-53dd-49dd-ae7b-83ea2afff1cc",
      "userName": "Jose Luis Ruiz",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXTpE1qVY_A2MiFRL6_iNT69pcDgwyOkZh1hwqqa8Zdy4o",
      "date": "2024-02-26T21:55:38.433Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=61503005-53dd-49dd-ae7b-83ea2afff1cc",
      "title": null,
      "text": "I really dislike this app. 1. You can't delete multiple old delivery notifications at the same time. It has to be done one at a time. 2. I have to keep signing into my Amazon account daily if i want to get tracking information, which is annoying to be doing. 3. I get error messages when trying to check the status of my other packages. What is the point of having this app if it can't do what it is designed to do? Please fix these issues. Otherwise, im going to uninstall this app, Thank you.",
      "replyDate": "2024-02-26T22:08:01.816Z",
      "replyText": "Thank you for your review and feedback. Our team is working on improving the Amazon account connection. If you are receiving errors, I recommend uninstalling and resinstalling the app. -Emily, Shop Support",
      "version": "2.144.0",
      "thumbsUp": 21,
      "criterias": []
    },
    {
      "id": "9665e0f5-eab0-4bfc-8b76-ba80328e307c",
      "userName": "Angelisse",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWzrT0h_MjiD-OYqkwXKe-3bjw9911PHcdtRt3yw8xxXu8",
      "date": "2024-01-25T12:49:29.486Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=9665e0f5-eab0-4bfc-8b76-ba80328e307c",
      "title": null,
      "text": "It seems like it's a good idea to use this app and it's cutesy with confetti and all, but when it comes to Shop refunding a purchase, it's a nightmare. They tell you to go on the app and update your physical address because they're going to MAIL the refund... Seriously? I paid electronically, refund same way!!!!! And they want to track my Amazon purchases too, which have nothing to do with Shop. China database?? Don't use this app.",
      "replyDate": "2024-01-25T12:52:24.344Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We're sorry to hear you didn't have a great experience with our app and we would love to understand the issues you experienced. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution! -Don, Shop Support",
      "version": "2.140.0",
      "thumbsUp": 32,
      "criterias": []
    },
    {
      "id": "b9fc8404-d796-4fc0-a016-c2e3aadf6977",
      "userName": "Ashley H",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLKsPCgEg_MG1kBJmV3XOkjYSAQpj5JbScftzLBk-kS=mo",
      "date": "2024-01-29T17:28:11.245Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=b9fc8404-d796-4fc0-a016-c2e3aadf6977",
      "title": null,
      "text": "This app has an amazing idea, that is executed poorly. Amazon and Gmail accounts are linked, but don't show up; when they do, the Amazon orders are blanked, or duplicated, or never updated. As for my Gmail, doesn't effing matter--it might as well be connected to fish for personal details, because it sure as hell doesn't record ANY of my orders into the app, regardless of whom I purchase from. All those orders **must** be manually added. Please tell me there is a patch coming up to fix this.",
      "replyDate": "2024-01-29T17:36:32.948Z",
      "replyText": "Hi Ashley, thank you for your feedback. I'd recommend that you contact our Shop support team directly so that we can check these issues for you and see if we can help at all: https://shopify.link/bmyj. -Victor, Shop Support",
      "version": "2.140.0",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "4694d633-dac3-4b73-83f6-8756b4d430d6",
      "userName": "Rama Shunn",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIWtqFTKUexSrWsNf5tLovhEn7BsQUlmOZPKCms2Deo=mo",
      "date": "2024-02-02T05:26:46.766Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=4694d633-dac3-4b73-83f6-8756b4d430d6",
      "title": null,
      "text": "Tracking does not provide you the actual tracking number. Gating order tracking through this app does not provide you with the information required to directly follow up with the shipping company. It doesn't provide you with the detailed tracking view which is generally more useful than the high level view. Basically, it's a gateway that removes purchaser capabilities.",
      "replyDate": "2024-02-02T05:37:34.893Z",
      "replyText": "Hi, Rama! To clarify, tracking will appear in the app If the store you ordered from provides tracking numbers, in which case you will see the number and the carrier. You should receive this information via email or text from the store, so the Shop app is totally optional—you are not required to use the app to track orders. -Sophia, Shop Support",
      "version": "2.141.0",
      "thumbsUp": 43,
      "criterias": []
    },
    {
      "id": "e4a83064-41a1-4f0e-b334-347dd08d6a85",
      "userName": "JJ",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIJ6-FnfSU--4fv78ZirAAnJ9Y2WHy6zyM2ncmQ_K6EKA=mo",
      "date": "2024-01-23T03:30:58.815Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=e4a83064-41a1-4f0e-b334-347dd08d6a85",
      "title": null,
      "text": "The 'Connect with Gmail' popup that constantly displays on the main screen has an x to close it but it's just there for decoration evidently. If you're gonna force that there it's as bad as an ad, at least take the facade away and remove the x if you're not gonna make it work. I've already cleared app cache and data and reinstalled the app, problem still exists.",
      "replyDate": null,
      "replyText": null,
      "version": "2.139.0",
      "thumbsUp": 72,
      "criterias": []
    },
    {
      "id": "4eb65f44-1547-479d-acdc-8b8b58b67690",
      "userName": "Nichole Golden",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWCxJoK8Yc8uXKkIxgIdnmbF4eq5MS9xizINiW1sTOKPQ",
      "date": "2024-01-23T11:18:48.667Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=4eb65f44-1547-479d-acdc-8b8b58b67690",
      "title": null,
      "text": "So, I went to check on a delivery and it shows me items that I have absolutely not purchased!! They were items I had looked at on Amazon but never even had in my cart... It even showed a receipt!! Actually there were a few orders for things I haven't bought but did look for in Amazon... This makes me wonder what they're doing with my info if they can see what I've actually shopped for... And where are these receipts coming from?? Very odd...",
      "replyDate": "2024-01-23T11:31:53.726Z",
      "replyText": "Hey there, thanks for taking the time to review Shop! We're sorry to hear you didn't have a great experience with our app. We would love to understand the issues you experienced - if you're open to it, please reach out to us here: https://bit.ly/3FAFUbg.. We'd be happy to help further! -Lana, Shopify Support",
      "version": "2.139.0",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "9d1788b0-1669-4a97-b129-6bac4e52f24a",
      "userName": "Heather Darnell-Jonker",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXP_a5slw2ZPHaZcCAgRe__65OVW75nM77d4ZpL2cGGXoE",
      "date": "2024-02-28T13:16:08.824Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=9d1788b0-1669-4a97-b129-6bac4e52f24a",
      "title": null,
      "text": "I am extrem disappointed with this app. GREAT for tracking purchases. But do NOT recommend buying anything from any of their vendors, as their customer support is nonexistent. I ordered a product through the app, the app tracked it to Alaska, said it was delivered there. I live in Michigan. Contacted the store several times, with no reply. Sent a couple of \"report problems with order\" reports to SHOP. Again, no reply. Learn from my mistake; don't order through the app; use it for tracking only.",
      "replyDate": "2024-02-28T13:22:19.172Z",
      "replyText": "Hi there, thanks for reviewing Shop! We're sorry to hear that you had a negative experience online shopping. For context, Shop does not actively work with any online stores. We do not sell products or process transactions. We hope that you can get the issue resolved with the online store. -Don",
      "version": "2.144.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "ec14088d-fc62-4712-8bb4-8e6f1a3e4679",
      "userName": "Rachel Moilanen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXe1zBrPcSoJk40G3m4CMvGl8kOCE4rqjm10bONggxsG-k",
      "date": "2024-01-24T21:36:17.568Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=ec14088d-fc62-4712-8bb4-8e6f1a3e4679",
      "title": null,
      "text": "Shop gave me a notification that a package I ordered was delivered. It was not delivered. It also tells you something has been delivered hours or a day after I already got the package, so in terms of tracking my delivery, it is not the most reliable. In terms of being user friendly, it is very easy to navigate and figure out, but please give accurate shipping and delivery. With that fix, it will be 5 stars.",
      "replyDate": "2024-01-24T21:42:47.516Z",
      "replyText": "Thank you for your review. It can sometimes communicate delayed or inacurate information due to the shipping carriers. -Emily, Shop Support",
      "version": "2.139.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "75b539bd-91ed-415b-b7f1-1c560cb4dda2",
      "userName": "Kaydence Bellerive",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVXvh59uA1b0jO4f6ouEeOaUyjZRhZwI7YxMfNj-BOoe1o",
      "date": "2024-01-26T02:49:35.337Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=75b539bd-91ed-415b-b7f1-1c560cb4dda2",
      "title": null,
      "text": "A few months ago, I first downloaded the app, pressed the very first button to get started, and then got stuck on a white screen. No matter how many times I shut down and reopened the app, nothing happened, so I uninstalled it. I then re-downloaded it today, months later, and the same exact thing is happening. I can't use the app at all.",
      "replyDate": "2024-01-26T02:52:39.993Z",
      "replyText": "Hi, Kaydence! We're sorry to hear you didn't have a great experience with our app and we would love to understand the issues you experienced. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution. -Victoria, Shop Support.",
      "version": "2.140.0",
      "thumbsUp": 27,
      "criterias": []
    },
    {
      "id": "ebc9a111-44a7-49d3-a90b-c2812529ae1b",
      "userName": "Derick Martines",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUVmvceT7YO_QpyB-h1RnotXc1gIchDT40OzLNSORWr95w",
      "date": "2024-02-08T18:39:28.146Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=ebc9a111-44a7-49d3-a90b-c2812529ae1b",
      "title": null,
      "text": "This app is really unstable. 1) Add something to my cart and when I look at it, it's empty. 2) Going into any sellers page and it is incredibly laggy, everywhere it is fine but there. 3) When I want to look at all my payments for the pay 4 it won't let me, I press the \"view all payments\" button and it never opens.",
      "replyDate": "2024-02-08T18:41:22.237Z",
      "replyText": "Hey there, thanks for taking the time to review Shop! We're sorry to hear you didn't have a great experience with our app. We would love to understand the issues you experienced - if you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to help further! - Dirk, Shop Support",
      "version": "2.141.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "94f83648-381e-40e1-ab91-abed922eeca6",
      "userName": "Russell",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVY4r6wBpuVwxAheyWZRP6DO9T8wHSvqFUKxaxk_iZZICc",
      "date": "2024-01-18T16:39:10.204Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=94f83648-381e-40e1-ab91-abed922eeca6",
      "title": null,
      "text": "This app used to work very well. Now I have items that I have looked at on Amazon showing up as purchases and deliveries in my Shop app. It's frightening because it looks like someone has hacked me or gained access to my credit card. Although these purchases are not showing up in my bank account they are frightening nonetheless. I have uninstalled the app until it is fixed.",
      "replyDate": "2024-01-18T16:38:18.995Z",
      "replyText": "Hi there Russell. Shop takes user data very seriously; how your data is managed and used is outlined here: https://shopify.link/vRmr. -Victor, Shop Support",
      "version": "2.139.0",
      "thumbsUp": 25,
      "criterias": []
    },
    {
      "id": "38cf8546-2489-4b49-8196-bb967980db7d",
      "userName": "LexTheWerewolf",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWM_JP16mpgvduIvD0mRxPKSsxlt2fPqK963Ka_enULgQ",
      "date": "2023-12-28T11:21:37.611Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=38cf8546-2489-4b49-8196-bb967980db7d",
      "title": null,
      "text": "It can be a little cumbersome to use sometimes, but overall, the app works great. It really just needs some filters and sorting options. My biggest gripe and the reason for the 2 stars, is the videos. For God's sake, please give me the option to turn off autoplay. I HATE autoplay. It completely breaks the experience for me if I have music or something playing, cause it will stop Spotify. With that option, it's a four star app all day",
      "replyDate": "2023-12-28T11:45:37.637Z",
      "replyText": "Thanks for taking the time to review the Shop app and submit your feedback! For context, Shop App provides a personalized shopping experience, allowing customers to track orders, discover new brands, receive personalized recommendations, and integrate with Shop Pay for convenient checkout. -Iris, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 127,
      "criterias": []
    },
    {
      "id": "aa560edf-560e-463d-8dd3-7475caaac255",
      "userName": "Maggie Romero",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVbMNDN-YsnhVE8uxZYcapja2J17rUe-_qtcrTX0COoew",
      "date": "2023-12-22T17:50:57.951Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=aa560edf-560e-463d-8dd3-7475caaac255",
      "title": null,
      "text": "It doesn't provide all purchases via online which sucks. Since I personally like having each purchase in a single location just to track them,but it does provide accurate information in regards to the carrier, delivery date, cancellation, or refund status which I guess makes up for it. Overall it's a good idea to use for any of your shopping needs. It does offer cash back rewards and special promotions too.",
      "replyDate": "2023-12-22T18:03:00.700Z",
      "replyText": "Hi there. Thank you for sharing your experience and rating the app. As we appreciate you your feedback, I've gone ahead and passed that information along to our developers. If you have any other concerns, please feel free to let us know. - Blair, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 268,
      "criterias": []
    },
    {
      "id": "1b24e2ec-5b07-4716-bd6b-807cff9e1936",
      "userName": "Travis Li",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWFDQ4PqF93tjpKdLvFFNOzOqsOyvyx5oCeJazUuak_uHs",
      "date": "2023-12-21T17:36:39.763Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=1b24e2ec-5b07-4716-bd6b-807cff9e1936",
      "title": null,
      "text": "It's terrible that the UI navigation keeps changing every few months. First, my orders button changed to a new position, which I hated but got used to. Now it's back to the previous position after I got used to the new navigation? Please stop changing it around so often. The tracking details changed too where I need to open an additional menu to go to the tracking website. The tracking website updates way sooner than the app so jumping through hoops to get there is irritating.",
      "replyDate": "2023-12-21T17:42:09.628Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. As I can completely understand the impact of this, I've gone ahead and shared your feedback with our developers. This will allow us to consider this in future updates. - Blair, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "da2e5e93-2efd-4404-829b-a3bea19dc7a0",
      "userName": "Candice “Candy” Campbell",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXnVZ5xO_PQOyuifvwOpY0usPjTsAFNmBbH4knY9MWJ2jw",
      "date": "2023-12-30T04:35:51.888Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=da2e5e93-2efd-4404-829b-a3bea19dc7a0",
      "title": null,
      "text": "I've never had a problem with the app and actually loved it...up until a few days ago. It occasionally disconnects my Amazon account and email but all I have to do is hit reconnect and everything is fine. Not this time. For the past few days I've been trying to reconnect Amazon and it won't let me. All I keep getting is a blank white screen. *12/29/23* Still not able to connect my Amazon account. Very frustrating.",
      "replyDate": "2023-12-16T18:19:43.829Z",
      "replyText": "Thanks for bringing this to our attention. We're aware of the connection issue with Amazon, and our developers are working on resolving this issue. Please keep an eye out for any updates available for our app. Should you experience any issues, then you can get in touch with us here: https://shopify.link/vRnL. Cheers. -Elias, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 42,
      "criterias": []
    },
    {
      "id": "8bb5689d-7bbb-48e7-84da-088a7b06af92",
      "userName": "Backlash",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX8IAS_vcT8ZafGgKxSr7gc5cRWzFd8ZVoAYbBHOnAtnQ",
      "date": "2023-12-27T17:08:28.996Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=8bb5689d-7bbb-48e7-84da-088a7b06af92",
      "title": null,
      "text": "Works... new update makes you click through more hoops to see tracking history. Keeps trying to sell more items, keeps wanting access to my email. There are zero good parcel tracking apps for android, ios has great ones that have always worked great and don't shove marketing down your throat. I use Mac, and now android. There are zero apps that sync with desktop Mac either.. still looking after 2 years for a decent option.",
      "replyDate": "2023-12-27T17:12:54.532Z",
      "replyText": "Hey, there! Thank you for taking the time to provide feedback about the Shop app. Our goal is to provide the best mobile tracking app on the market, while also helping you reconnect with some of your favorite stores. We're a tight knit team, so we'll make sure to channel this to the product team for their consideration! - Greta, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "e2e35487-ffce-44fa-a58c-4afffd644bde",
      "userName": "Michael",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVzDLEcB8pSV42qVa0s6Q-7eu_FI5UJ8YUkTwheNnuiuCA",
      "date": "2023-12-03T13:33:05.274Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=e2e35487-ffce-44fa-a58c-4afffd644bde",
      "title": null,
      "text": "I would not use this if not for some online retailers requiring it to track their products. It is great in theory and poor in execution. The extra star (2) came from the fact that it does compile all of your pending deliveries into a single place. However, the shipping statuses are incorrect until you manually click through the tracking links to update them, and each tracking takes no less than 3, and as many as 5 separate clicks to get to the status. It should be automatic at the home screen.",
      "replyDate": "2023-12-03T14:31:10.718Z",
      "replyText": "Hi, there! We know how important it is to have up to date tracking information. While Shop's updates come directly from the carrier, there can sometimes be a delay. We are working on improving this, so thank you for holding us accountable! Our goal is to bring you up to the minute notifications, so stay tuned. - Greta, Shop Support",
      "version": "2.134.1",
      "thumbsUp": 171,
      "criterias": []
    },
    {
      "id": "46ca474d-91ae-442c-9fbf-c5c55ee5636d",
      "userName": "Geosspone",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWuexVpkxBA_cFiwouGmSP506SAuyGoayDcfqXS1-pmIQ8",
      "date": "2023-12-15T03:04:45.149Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=46ca474d-91ae-442c-9fbf-c5c55ee5636d",
      "title": null,
      "text": "In the app's current state, it's mostly unusable. The different tabs at the bottom of the app screen are unintuitive and hard to figure out which is for what (most are just advertising products you might not even want to buy). When you can actually find your way to package tracking, it's great at following updates on your purchases, but there's no profile or menu buttons to update your information, permissions, or other settings.",
      "replyDate": "2023-12-15T03:21:59.785Z",
      "replyText": "Thanks for your feedback, we're sorry to hear that you're finding the app difficult to navigate. We're always looking to improve our user experience, and your feedback is invaluable in this process. We invite you to speak with us here: https://shopify.link/bmyj if you'd like to share more details. Thanks! -Kimi, Shop Support",
      "version": "2.136.0",
      "thumbsUp": 518,
      "criterias": []
    },
    {
      "id": "73a9b057-9fbf-4100-bae3-c2eeda23ed5f",
      "userName": "Dala Raine",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVbcZ3a59SKocXwxSPsAhKbmm25ncqc0NdLacSONcKt-SI",
      "date": "2023-10-09T20:19:30.401Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=73a9b057-9fbf-4100-bae3-c2eeda23ed5f",
      "title": null,
      "text": "It's always asking me to update my info or reconnect to my email, Amazon accounts. Seems shady to me. Sometimes, the shipping and delivery info is correct. The majority of the time, it's awaiting updates after the package was delivered a month or more ago. Would really be interested in knowing why the app has so many inconsistencies. The one thing positive I can say is that it has connected me to other stores that are appealing. Wouldn't trust the tracking with this app.",
      "replyDate": "2023-10-09T20:28:26.495Z",
      "replyText": "Hi, Dala. Thanks for providing your feedback. I recommend making sure your device and app are fully updated. If you still experience issues please reach out to our team here: https://bit.ly/3slFNvm - Skye",
      "version": "2.128.0",
      "thumbsUp": 371,
      "criterias": []
    },
    {
      "id": "3b8db0b0-eea5-414d-9294-7289a0d3d883",
      "userName": "Laro Selcouth",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK5AUZyIRWmgw0CxndJHsSR7rhbxmoCYBdC68ppLNLY=mo",
      "date": "2023-11-29T18:28:45.500Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=3b8db0b0-eea5-414d-9294-7289a0d3d883",
      "title": null,
      "text": "Disgustingly Inefficient to Navigate. For one thing, the app crashes regularly and it's impossible to find your way back to where you were. You can't search deals for a product, deal, store, or any kind of filter. Over half the times I added a deal to my cart, only for me to go to the cart and see the deal glitched and it isn't registering, so you'd have to go back to try again. But maybe that means scrolling for an hour to find the store in the deal section again... because you can't search...",
      "replyDate": "2023-11-29T18:46:59.442Z",
      "replyText": "Hi, Laro. Thanks for your review on the Shop App and providing your feedback. I understand your frustration here and will be sure to pass along your experience to our developers internally. - Holly",
      "version": "2.134.1",
      "thumbsUp": 364,
      "criterias": []
    },
    {
      "id": "0c6cc99d-8c2e-4b4f-a0d3-2a9c401bffb3",
      "userName": "Alex Flesburg",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL8-rLAdcNVgNoFPgi_DU_6puVGHVzhG4o17Cp46Mqg=mo",
      "date": "2023-12-17T17:54:12.211Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=0c6cc99d-8c2e-4b4f-a0d3-2a9c401bffb3",
      "title": null,
      "text": "Terrible navigation within the app, constant ads everywhere, asking you to sign in with outlook and other things. These requests even have an x in the corner of the image, but cannot be dismissed. Order tracking gives as little information as possible. All I even downloaded the app for was the order tracking, and it took longer than it should have to find. Uninstalled, and will avoid it like the plague. Don't even bother with the bot service reply. Uninstalled, couldn't pay me to reinstall it.",
      "replyDate": "2023-12-17T18:06:58.725Z",
      "replyText": "Thanks for the feedback about the application and review. We would like to learn more about the issues that you experienced when using the Shop app - feel more than welcome to reach out to our Shop team here: https://shopify.link/mNgl. -Ollie, Shop Support",
      "version": "2.136.0",
      "thumbsUp": 269,
      "criterias": []
    },
    {
      "id": "0f7ab3dd-cae0-43ca-a520-e5e656daf1e5",
      "userName": "S s",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWBOc-YcQcDSG1lXEfie-vYIG6DEHS5X1oKmHTqSkJXIQs",
      "date": "2023-10-16T20:00:45.642Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=0f7ab3dd-cae0-43ca-a520-e5e656daf1e5",
      "title": null,
      "text": "Very limited functionality. Was given \"shop cash\" that the app would never actually let me use as it KEPT CRASHING EVERY SINGLE TIME I repeatedly tried to place the order. And now the offer is \"expiring\". It crashes nearly every time it loads, if it loads at all, to track orders. Fairly decent in sending notifications. Response to developer: And yeah it was updated to most current version. And yeah I contacted customer service. And no they couldn't help",
      "replyDate": "2023-10-16T20:24:29.617Z",
      "replyText": "I'm sorry to hear the agent wasn't able to help you out. I recommend reaching out to us again so we can troubleshoot this further. I'd also recommend you double check that the device you're using is up to date with the latest operating system. This can often resolve issues with the app. -Erin, Shop Support",
      "version": "2.129.0",
      "thumbsUp": 68,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "0e3358e0-80da-4ed6-b44b-f0796f398704",
      "userName": "Melanie Phillips",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVLP2Cq36QC-o8ZwfgujIoT-Y-FZt7NKsf71iIkolMYfQj9",
      "date": "2023-12-16T06:48:20.508Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=0e3358e0-80da-4ed6-b44b-f0796f398704",
      "title": null,
      "text": "I like the app and the fact that you can buy products off of the app. However, the tracking information is usually always wrong or never updated, which is the only reason I downloaded/ have the app in the first place. I have 2 packages that are marked as \"being out for delivery\" but were delivered a weeks. It's just not a reliable tracking tool, and I ALWAYS have to check the USPS tracking program, which is always updated more than Shop is and offers text/ email tracking updates.",
      "replyDate": "2023-12-16T06:42:52.891Z",
      "replyText": "Hi, Melanie! We know how important it is to have accurate tracking information. While Shop's package updates and location come directly from the carrier, there can sometimes be a delay. We are looking at improving this. You can reach us here (https://shopify.link/bmyj), so we can take a closer look. -Victoria, Shop Support.",
      "version": "2.136.0",
      "thumbsUp": 189,
      "criterias": []
    },
    {
      "id": "d40bff1d-fde4-4ee5-aff5-eda7bd3a2fc2",
      "userName": "Jack Skelengton",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUD0Nz_uvxrVPsezhfqh-cKTlVbJmSPB48O75yR5vdk5P9E",
      "date": "2023-12-22T16:16:45.474Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=d40bff1d-fde4-4ee5-aff5-eda7bd3a2fc2",
      "title": null,
      "text": "Since I first downloaded the app it has changed too much for me. Like many people have recently said, the new layout is unintuitive but also they seem to prioritize advertising to you instead of doing it's main function, tracking! (Which took me a solid 5 minutes to find how to manually add a new package in the new layout and I consider myself better versed than most in internet navigation) If I find another app that keeps track of packages instead of advertising I'll def download that instead",
      "replyDate": "2023-12-22T16:22:27.100Z",
      "replyText": "Hey, there! Thank you for taking the time to provide feedback about the Shop app. Our goal is to provide the best mobile tracking app on the market, while also helping you reconnect with some of your favorite stores. We're a tight knit team, so we'll make sure to channel this to the product team for their consideration! - Greta, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 29,
      "criterias": []
    },
    {
      "id": "6dbe1659-b1b2-4a0a-bd1e-1e845f1fafae",
      "userName": "Roger Okewole",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJlutKMz6_XBBdtPUHpcYN9pr40RbMvcSi-fihG4pGj=mo",
      "date": "2023-12-30T12:46:27.267Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=6dbe1659-b1b2-4a0a-bd1e-1e845f1fafae",
      "title": null,
      "text": "So far, the process for delivering my products to customers has been seamless. I am kept informed on both domestic and international shipments at all times. So far so good! Update: DOWNGRADED from 5 stars. The tracking information is basically useless. 90% of the time, the tracking numbers don't work. I am not one to harp on little things, but this seems to be a glaring flaw for a shipment tracking app tied to a serious Shopify business. I implore the app designers to be better.",
      "replyDate": "2023-12-30T13:05:12.411Z",
      "replyText": "Hi! We know how important it is to have accurate tracking. While Shop's package updates and location come directly from the carrier, there can be a delay. We are working on improving this, so thank you for the feedback! We can also have a closer look at this tracker by reaching out here: https://shopify.link/bmyj. -Maz, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 20,
      "criterias": []
    },
    {
      "id": "d7465d52-78c9-4bdc-825e-e86aa9552ccd",
      "userName": "Moka Kohi",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU6wHtcUuPxbjMCKNGsQKa-yVOM-p8znkWekeLwe9mgHw",
      "date": "2024-02-02T22:19:55.177Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=d7465d52-78c9-4bdc-825e-e86aa9552ccd",
      "title": null,
      "text": "It's nice in terms of function, but it should not be this difficult to navigate. Every time I try to make a payment for my order, I'm wandering around trying to locate where to do that, which should be a selection that's up front and center. You can't navigate to it through receipts or past orders. I know I found it a couple times, but it's never easily accessible.",
      "replyDate": null,
      "replyText": null,
      "version": "2.135.0",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "88c75a69-1b02-453d-bb1c-7f151be0e80f",
      "userName": "Evey DiMarco",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWInVNH6y9Q1ybN0_JXTd1g2OqbA4g6hvDW47KuF6N7Tth0",
      "date": "2023-12-18T15:02:32.690Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=88c75a69-1b02-453d-bb1c-7f151be0e80f",
      "title": null,
      "text": "I was so excited when I downloaded this app originally, finally a place to track all my orders all in one place. Unfortunately, much of the tracking data doesn't actually load in, especially from Amazon, and all I can see is a long list of unmarked packages, which is totally unhelpful. It was a great idea in theory, I just wish they'd make some improvements to make it more functional.",
      "replyDate": "2023-12-18T15:13:00.298Z",
      "replyText": "Thanks for the review. We are constantly trying to improve the tracking on the Shop app with all orders you receive. We appreciate the feedback that you have provided us- if you have received an order but the Shop app is displaying that it is in transit. You can navigate to the order and *Mark as delivered*. -Ollie, Shop Support",
      "version": "2.136.0",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "07039175-7db4-4c3a-9aa3-55a95dd7769b",
      "userName": "Virginia “Sunshine” Graham",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVhiAt9GNv5wUsgSYkkZ1pgW2u5KW-2y1QFAmgH6WYQMGw",
      "date": "2023-11-19T02:29:18.139Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=07039175-7db4-4c3a-9aa3-55a95dd7769b",
      "title": null,
      "text": "I hate to do this I love the app enjoy shopping on it but it's so difficult to get quick answers for billing issues!! The amount of hoops you go through to finally be able to contact anyone just to then wait and wait. Is frustrating. Here's my deal, this app has gone out of its way to make shopping personalized and so easy for you to do you would think that they're billing would be just as important to the customer as shopping experience.",
      "replyDate": "2023-11-19T02:46:06.587Z",
      "replyText": "Hey Jenny! Thanks for your feedback. I understand it can be frustrating to wait, our team intends to reply as quickly as we can. It may take us longer than expected at times, depending on the current contact volume we're experiencing. We apologize if tickets are taking longer to be addressed, we appreciate your patience. - Moira, Shop Support",
      "version": "2.134.0",
      "thumbsUp": 401,
      "criterias": []
    },
    {
      "id": "abd08de6-229b-4959-be2a-cd7199719cd2",
      "userName": "Sara Campbell",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVG1wf0YpDyRbMnbWq55KPX7d9h17faQPdIm_iG8b5OtX8",
      "date": "2023-10-27T12:03:25.890Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=abd08de6-229b-4959-be2a-cd7199719cd2",
      "title": null,
      "text": "Overall, I like this app. It's easy to navigate and user friendly. Pros: When I buy from several different sellers using Shop it streamlines the task of grouping, listing, and tracking orders individually. The Shop app simplifies managing deliveries in one app, eliminating the need to use several apps like USPS, FedEx, UPS, etc. The one Con: I'm not able to add & track all orders automatically or manually if I didn't purchase the item(s) using the Shop app.",
      "replyDate": "2023-10-27T12:24:31.523Z",
      "replyText": "Hi, Sara. Many thanks for the review and feedback! We have some information here about how you can track your orders, which explains how to track orders not purchased directly via the Shop app: https://shopify.link/wN3z. -Rick, Shop Support",
      "version": "2.129.0",
      "thumbsUp": 49,
      "criterias": []
    },
    {
      "id": "5d57244f-cf23-42b5-9fde-8109369c02b3",
      "userName": "Knight (Knight)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXAvWNvvPE6U3mAr2xj12kGY26-aHEfFS0xfVqXzbv1dAk",
      "date": "2024-01-12T17:23:36.598Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=5d57244f-cf23-42b5-9fde-8109369c02b3",
      "title": null,
      "text": "The shop app needs a complete rehaul. There needs to be a section added for customer service and there needs to be a section for settings in general. I'm probably the most important part there needs to be a way to somehow connect PayPal to your account so that way when you make transactions you can do it in one shot instead of having to choose different cards. Do better.",
      "replyDate": "2024-01-12T17:33:47.844Z",
      "replyText": "Hey, there! Thank you for taking the time to provide feedback about the Shop app. Our goal is to provide the best mobile tracking app on the market, while also helping you reconnect with some of your favorite stores. We're a tight knit team, so we'll make sure to channel this to the product team for their consideration! - Greta, Shop Support",
      "version": "2.132.1",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "f8bdf5a0-ac77-4d3f-b1be-8cfeed67ab22",
      "userName": "Wendi Marie",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV1TPkREM3uGaLLMuKtdCk_f_CN3BOATzbfp_ptCg2AXPTy",
      "date": "2023-10-13T00:12:09.200Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=f8bdf5a0-ac77-4d3f-b1be-8cfeed67ab22",
      "title": null,
      "text": "I have used this for about 4-5 yrs. Great way to pay for my purchases as it's much easier and check out is quick. It also makes it easier to track my packages and gives me peace of mind knowing it's there to give me a \"second layer\" of protection should something go wrong with ups, FedEx or the USPS. It also gives you suggestions for purchases you might like and keeps a list of previous purchases. I have no complaints. You also earn money back on purchases you make. I love this shopping app!!",
      "replyDate": null,
      "replyText": null,
      "version": "2.129.0",
      "thumbsUp": 162,
      "criterias": [
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 1
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 2
        }
      ]
    },
    {
      "id": "f072ebea-1364-42bf-8057-bcfca3c181d9",
      "userName": "Jonathan Daniels",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVHjtlXN8ZYBQ4mWOe_lIOo5PkyEp2RTvbM830G0OGgmg",
      "date": "2023-10-12T00:17:28.563Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=f072ebea-1364-42bf-8057-bcfca3c181d9",
      "title": null,
      "text": "I tried saving up shop cash and use the app to purchase items. A couple times I tried to use my cash it wouldn't work. Then I just found out it expired. More than irrigated after spending lots of time trying to find something. Super annoying plus it's far from accurate showing when items are arriving. Now I'm done using it. They just take your rewards.",
      "replyDate": "2023-10-12T00:31:35.464Z",
      "replyText": "Thanks for taking time to review Shop, Jonathan. Shop Cash does expire and it's stated in our help doc here: https://shopify.link/LpVJ. As for the tracking delays you may have experienced, we are working on improving this. Thank you for holding us accountable! -Summer, Shop Support",
      "version": "2.128.0",
      "thumbsUp": 53,
      "criterias": []
    },
    {
      "id": "45111262-bd8b-40fa-8cc1-6c31d3cf24af",
      "userName": "Carson Eversole",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJfkIgY53kCiv3bIIwpvaNqEJofpBcRlxc-p3CiL2Bk=mo",
      "date": "2023-12-18T16:42:53.732Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=45111262-bd8b-40fa-8cc1-6c31d3cf24af",
      "title": null,
      "text": "\"Rewards\" are advertised a little disingenuously. Stating you can get something free with your rewards. Then you click an item and it turns out the rewards don't kick in until you have a full cart. The addition of videos is obnoxious. Constantly interrupting any media I have playing in the background. Besides centralizing your tracking, they do nothing for you. And guaranteed they are selling data about your buying habits and who knows what else. Big delete for me once I get this next package.",
      "replyDate": "2023-12-18T16:51:52.386Z",
      "replyText": "Thanks for the review. We would like to get a better understanding of the issues that you faced while using the Shop application. If you are open to it, please reach out to our Shop team here: https://shopify.link/gK88. -Ollie, Shop Support",
      "version": "2.136.0",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "6d2520af-6e06-48db-8c77-4774fa9e0941",
      "userName": "Shandi Brown",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU5ww8trWRu6j-GeCqfUAp6eBAFx6NvOJBd9jeQ8OUEnvw",
      "date": "2024-01-05T14:40:15.644Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=6d2520af-6e06-48db-8c77-4774fa9e0941",
      "title": null,
      "text": "I forgot I even had this app until I ordered something on Temu the other day, but I've been ordering things from all kinds of other places and received no tracking from Shop. And you have to \"reconnect Amazon\" every single time you open this app. Annoying as hell. *New edit. They are now \"tracking\" an Amazon order containing items that have never been in my cart/order history LMFAO",
      "replyDate": "2024-01-05T14:46:12.138Z",
      "replyText": "Thanks for the review. If you are experiencing frequent disconnections from your Amazon account, I would suggest uninstalling the application and re-installing it to your device. This will force sync any recent updates with the application to ensure you are using the most compatible version. -Ollie, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 10,
      "criterias": [
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "938aa78d-c357-4de6-beff-f25deac37747",
      "userName": "Dustin Moyer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjULyT3NiiNC9m28QPiNvjzFwoI6_gUi2f1GEO6yMFUuM8U",
      "date": "2024-01-12T16:53:02.176Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=938aa78d-c357-4de6-beff-f25deac37747",
      "title": null,
      "text": "There are fake shops all over the place. God forbid you get excited and pull the trigger on a purchase that's fake. Shop will do NOTHING to help resolve it. The \"shop cash\" rewards are a joke. You can tell that most of the items/shops you can use it on are carefully selected to have plenty of margin that you're not gaining much. It also has to be used quickly or, it expires, so there's no chance you'll be able to save up to an actual big savings. Avoid purchasing through the app at all costs!",
      "replyDate": "2024-01-12T17:04:50.480Z",
      "replyText": "Thank you for your review and feedback. If you don't receive your order or have any issues you must contact the store directly. If you are not able to do so, please contact your bank for refund options. -Emily, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "8021272f-0035-47bc-b8fd-cc6fbe9d6b05",
      "userName": "Spidey Whiplash",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXAAAgStyK38s-77qEA9uXLttApVE5siCR2hYw_akfz84uT",
      "date": "2023-12-21T15:12:43.555Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=8021272f-0035-47bc-b8fd-cc6fbe9d6b05",
      "title": null,
      "text": "Worthless App! Purchased something from the UK and it says track order with Shop App. Installed this app. Has a 40 second timer to confirm email address. It asked for every permission I have. Unable to navigate app to track the order. As in...Couldn't find my order in this app. Went back to email order and tried tracking again. Still couldn't find it on Shop App because it's so cluttered. Finally found the order. But no tracking info because it says: WE COULDN'T FIND A TRACKING NUMBER.🤬",
      "replyDate": "2023-12-21T15:21:19.903Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. As I can completely understand the impact of this, I've gone ahead and shared your feedback with our developers. This will allow us to consider this in future updates. - Blair, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 31,
      "criterias": []
    },
    {
      "id": "9a8d1c06-842a-4540-b61a-312eee012c19",
      "userName": "Gabriel Mariani",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXM6QVeKZNYLXBm5sRFNA_GixdUeaABCMiIOSJpJnyfDCk",
      "date": "2023-11-21T05:53:50.339Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=9a8d1c06-842a-4540-b61a-312eee012c19",
      "title": null,
      "text": "Stores won't give you a tracking number, even after installing the app. Its just a hook to advertise more stuff to you when you just want to track your order. I would give zero stars if I could. Edit: it's a shopify store, you entirely control how tracking numbers are displayed. Pushing it to an app is just a marketing ploy. You can just as easily always display the tracking information if you wanted to.",
      "replyDate": "2023-11-19T16:14:18.527Z",
      "replyText": "Hi, Gabriel. I'm sorry to hear about your experience. Our app provides the tools to track orders. We do not conduct business on behalf of the store owners and cannot provide numbers for them. I encourage you to contact the store directly for more information on your order. - Holly, Shop Support",
      "version": "2.134.0",
      "thumbsUp": 93,
      "criterias": []
    },
    {
      "id": "b88ceca7-e226-461a-9e8f-19a7fe54b1bd",
      "userName": "Ben Perkins",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU_mfjXprCQLoErSguqn-oBIU0XUWY-YSDoXyaTgYefG10b",
      "date": "2023-12-18T14:39:25.873Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=b88ceca7-e226-461a-9e8f-19a7fe54b1bd",
      "title": null,
      "text": "My go to shopping app! 🔥 I'm so excited for what's next on the platform. Something I love about it is how much it continues to evolve, improve and grow. The energy of an app that's constantly evolving makes me really excited to use it more often! 😁 The UI is so beautiful (and way better than Amazon imo), plus there's so much variety of shops. Checkout is so simple and I don't have to create an account with every company I buy products from. Just wish I wasn't opted into emails automatically.",
      "replyDate": null,
      "replyText": null,
      "version": "2.136.0",
      "thumbsUp": 54,
      "criterias": [
        {
          "criteria": "vaf_never_display_visually_good",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_customer_service",
          "rating": 1
        }
      ]
    },
    {
      "id": "02231af7-eeb3-4c6f-8b6d-3be8fe511c78",
      "userName": "Trionne Lane-Pollock",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWboWTSyiHRj04iqCuIvPzKUQfpMNvrnYcrkuDuLe9Gf6tT",
      "date": "2023-10-08T17:16:22.701Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=02231af7-eeb3-4c6f-8b6d-3be8fe511c78",
      "title": null,
      "text": "Been using this app for years especially for my business but recently it hasn't been tracking all my orders or letting me add them manually. Shipping has been having weird stuff happening lately like wrong locations and delivery dates. I'm nervous to ship my products. It was nice having everything in one app instead of opening 2-3 different apps and manually typing tracking numbers in. Please fix 😬",
      "replyDate": "2023-10-08T17:33:04.639Z",
      "replyText": "Hi there, Trionne. Thanks for reaching out. I'd recommend reaching out to our Shop support team about this so we can investigate further: https://shopify.link/bmyj. -Victor, Shop Support",
      "version": "2.128.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "a9f7c024-56cc-4ca9-9275-f3cd3d93c121",
      "userName": "Dawn Bateman",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK6itx145dC5qjmDpFPqB_t6s0c5aj34Rb72ry9FjgN=mo",
      "date": "2023-10-29T11:37:15.618Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=a9f7c024-56cc-4ca9-9275-f3cd3d93c121",
      "title": null,
      "text": "It used to work great! Now I get notifications still but if I click to go into the app from the notification or from the icon, I see the launch and then just white screen. No info ever populates. I've updated but haven't uninstalled/reinstall. I guess that's next. I've lost some of the \"miney\" to sirens because I have had time to mess with it. Small amount anyway but still frustrating I'll change the rvw if I can get it fixed",
      "replyDate": "2023-10-29T11:45:37.136Z",
      "replyText": "Hi, Dawn. Thanks for the review and feedback. Please feel free to contact our team directly and we can investigate these issues with you: https://shopify.link/bmyj. -Rick, Shop Support",
      "version": "2.131.0",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "05a5a0c0-cf19-4baf-8e6e-d2f04bb80338",
      "userName": "Nancy J. Smyth",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUL1iJE2eVtDEiqmCeAyR46hfJP-JkJ0j90ST97afnXX9Q-",
      "date": "2023-12-13T19:35:12.904Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=05a5a0c0-cf19-4baf-8e6e-d2f04bb80338",
      "title": null,
      "text": "I've been unable to find a way get this app to set a default shipping address for me. Because the platform is used by many different shops, it saves addresses I may have sent a delivery to once (on another site) and it's populating those old addresses to new websites when I order. The app chatbot gave me instructions for setting a default address that weren't options in the app, nor was there a way to do this on the Shop website. I've lost hours dealing with problems related to this issue",
      "replyDate": "2023-12-13T19:49:17.322Z",
      "replyText": "Hey there, thanks for taking the time to review Shop! We're sorry to hear you didn't have a great experience with our app. We would love to understand the issues you experienced - if you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to help further! - Dirk, Shopify Support",
      "version": "2.136.0",
      "thumbsUp": 77,
      "criterias": []
    },
    {
      "id": "b77e495a-0846-4e36-bcea-a3b8a590a38a",
      "userName": "DC Sharma",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocILwv0CBv5kEaA_uaFy69-32qSY7wCdBvDf2FPwZ4eF=mo",
      "date": "2023-12-27T09:50:31.808Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=b77e495a-0846-4e36-bcea-a3b8a590a38a",
      "title": null,
      "text": "Love that all the tracking info for my different packages can be found in one location. So easy and convenient, in theory. When it works, it's great! Some packages are not tracked accurately. Many packages have been \"lost,\" but it's just that the tracking info doesn't get updated.",
      "replyDate": "2023-12-27T10:03:26.548Z",
      "replyText": "Hi! We know how important it is to have up-to-date tracking information. While Shop's updates come directly from the carrier, there can sometimes be a delay. We are working on improving this, so thank you for holding us accountable! Thank you for the feedback and stay tuned. -Maz, Shop Support",
      "version": "2.137.0",
      "thumbsUp": 5,
      "criterias": [
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_easy_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 3
        }
      ]
    },
    {
      "id": "74c448e0-5ab5-485e-864f-da15891ecc91",
      "userName": "Christopher",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWHBQV39EN5JHnbjMf-Jvm9IzB6GUoGZmQafM84HVL-Rg",
      "date": "2023-11-05T21:14:53.958Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=74c448e0-5ab5-485e-864f-da15891ecc91",
      "title": null,
      "text": "The app works most of the time but sometimes when an item is delivered it doesn't always translate into the shop app, and it doesn't help if you get the wrong tracking number either. Also the rewards are nice, but they expire way too soon. It's like this app was designed for heavy spenders only. Most apps let you keep your points for a year or longer, not shop.",
      "replyDate": null,
      "replyText": null,
      "version": "2.132.1",
      "thumbsUp": 42,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 2
        }
      ]
    },
    {
      "id": "e1254060-e700-46d9-8ae3-2a3fbcb53f11",
      "userName": "Lizzie Hover",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVa5kWjODGKsIWG_IqvVl-DRVkUuVXSEAVdashDIAQfpEU",
      "date": "2023-11-08T02:01:27.378Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=e1254060-e700-46d9-8ae3-2a3fbcb53f11",
      "title": null,
      "text": "It's okay for tracking, kinda nice to have it mostly in one place. The shop cash function is nice, though it doesn't make sense to me how I got the cash, or how to get more. The worst part is when you try to use the shop cash, if you want to buy something with a multiplier, if you're just browsing. See, there's a reason having pages works better than endless scrolling, the app cannot handle loading everything. If you do anything it sends you to the top. That sucks.",
      "replyDate": "2023-11-08T02:13:23.320Z",
      "replyText": "Hey there! Thanks for taking the time to review Shop. We're sorry to hear you didn't have a great experience with our app and we would love to understand the issues you experienced. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution! -Summer, Shop Support",
      "version": "2.133.0",
      "thumbsUp": 56,
      "criterias": []
    },
    {
      "id": "4fed70ce-b0ca-4f0d-832d-b3556a0baea5",
      "userName": "Andrew Robinson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUXCztJ5O1HXabAkenMu7njuIvB_Lbh9QCKWvh9Nkzbm8Q",
      "date": "2024-01-09T19:31:04.955Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=4fed70ce-b0ca-4f0d-832d-b3556a0baea5",
      "title": null,
      "text": "At first, I was a bit concerned that there is an app that could somehow have the information of all of the places that I shop from and combine them all into one. But honestly, I figure nowadays everyone has all of my information anyways, and this is truthfully an extremely convenient app. Even if a website or a service doesn't offer direct integration with the shop app, you can manually type in a tracking number and your own information into it and track of all shipments from anywhere.",
      "replyDate": null,
      "replyText": null,
      "version": "2.137.0",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "c8dab550-60b1-411a-9080-14ed124def6d",
      "userName": "Christopher Bell",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKOV6pAyR08d-_adcyxLOBHyGSaDqc4ufxFociPYnhs=mo",
      "date": "2023-10-07T13:00:42.171Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=c8dab550-60b1-411a-9080-14ed124def6d",
      "title": null,
      "text": "Literally useless. I've entered both my email address and my phone number and it can't find any of my orders that I placed under both. I have to go to each individual order and manually add it to the app, which provides me zero benefit over just looking up the stupid order to begin with. Finding it in the app is literally an extra step, adding no convenience and removing any convenience that you previously had. Would an absolute waste of space, this app is dogshit personified",
      "replyDate": "2023-10-07T13:13:10.397Z",
      "replyText": "Hi, Christopher. Thanks for taking the time to leave a review. We're sorry to hear you didn't have a great experience. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at these issues and do our best to help find a resolution! -Rick, Shop Support",
      "version": "2.128.0",
      "thumbsUp": 71,
      "criterias": []
    },
    {
      "id": "68790883-4db0-4d6c-b38a-fdaedb4dd106",
      "userName": "Andy Bravo",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUd6EgOPBXtMMk0bNXHkclmlL3PiBfukWwp5tYWnzhO2Q",
      "date": "2023-10-27T01:59:41.445Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=68790883-4db0-4d6c-b38a-fdaedb4dd106",
      "title": null,
      "text": "I thought it was excessive to have to have another app just to order from certain shops, but found it convenient to see all my orders being tracked in one place, BUT..I just got hacked by someone from Romania and it was insanely easy for them to continue to make several purchases one after the other with MY account, even while on the phone with PayPal & my bank trying to cancel their purchases, but the Shop App refuses to. Beware, hackers can buy off this app..I thought it was just for tracking.",
      "replyDate": "2023-10-27T02:23:02.650Z",
      "replyText": "Hi! Our Shop app keeps information safe and secure, as stated in our Privacy Policy: https://shopify.link/vRmr. I can understand how frustrating the situation is however, so rest assured that our team will investigate your report if you've already contacted them regarding this matter. -Kimi, Shop Support",
      "version": "2.131.0",
      "thumbsUp": 22,
      "criterias": []
    },
    {
      "id": "c84537b7-a992-47e5-9a4d-f571f08a19e1",
      "userName": "Robyn Hurst (Vessels of Clay Yoga)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUY1OI_axAY238vUeIu13gO0UMlExWluopiJJnUwkHoDw",
      "date": "2024-01-01T00:26:36.317Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=c84537b7-a992-47e5-9a4d-f571f08a19e1",
      "title": null,
      "text": "The AI help is not a help at all. I was asking how to provide app feedback, & it could not give applicable directions. My feedback is this: somewhat useful in tracking orders, tho sometimes says \"partially delivered\" when everything has arrived. The bigger issue is the \"shopcash\" incentive. Every time I get excited to use my \"earned\" shopcash, the discount is eclipsed ny shipping costs...and I generally opt NOT to buy anything after all.",
      "replyDate": null,
      "replyText": null,
      "version": "2.135.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "f9b672a9-f122-4c99-b469-9e9eb8f2342c",
      "userName": "Berkie Allen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXtd18YWDnvwiWIcGZNOOEFfNXuYFb-bGB8kQ5WS3wB_Vzt",
      "date": "2023-10-10T20:42:56.161Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=f9b672a9-f122-4c99-b469-9e9eb8f2342c",
      "title": null,
      "text": "App was good until recently. Won't stay connected to Amazon and constantly asks me to reconnect. Please fix it! *Update 6/23 Got a new phone, moto edge, and it's still doing the same thing. I'm going to have to stop using it except for where I have to. I've emailed support and they know about the problem but won't say what they're doing about it.",
      "replyDate": "2023-10-10T20:54:18.550Z",
      "replyText": "Thank you for taking the time and sharing this feedback. While our development team is aware of the connection issue with Amazon, we're still working on a resolution. Please keep an eye out for any available updates, and feel free to contact us (https://shopify.link/bP6A) if you have any issues or suggestions. Cheers. -Elias, Shop Support",
      "version": "2.128.0",
      "thumbsUp": 10,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "7e4e87cf-95c7-4bb3-af3b-52e92fe037aa",
      "userName": "Joey Dickerson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXMXx3XkBSd59Maa890e0rqJLcH08FFfwtm5MqPl6jeIg",
      "date": "2023-11-06T22:07:11.998Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=7e4e87cf-95c7-4bb3-af3b-52e92fe037aa",
      "title": null,
      "text": "Someone's get notifications that are of zero interest to me. The collection of dlot of different shops and having them all in one place is nice, but there are still a good many shops that aren't on the shop app. Tracking has been good, sometimes I'll order something from eBay, Mercari or another store and there will be none to very little tracking, only @times though. For example, sometimes it will show that the printing label has been scanned and awaiting pickup, then arrive 1-2 weeks later.",
      "replyDate": null,
      "replyText": null,
      "version": "2.132.1",
      "thumbsUp": 20,
      "criterias": []
    },
    {
      "id": "65c56a90-7389-441e-8133-3d931ef10acb",
      "userName": "Jack Dunamis",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVX20HliuKfs8qay67V-tqXrjUEuj8X5hKWs6_z0hkQc1E",
      "date": "2023-10-28T23:23:06.840Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=65c56a90-7389-441e-8133-3d931ef10acb",
      "title": null,
      "text": "Good tracking, but terrible user experience. I can't change my phone number and it's preventing me from logging in on my computer. I would be fine if I were just clueless, but I don't know where these damm settings are. Edit: I'm adding a star for customer service, but as it is I cannot follow the steps required as I am stuck in a loop of my email not being enough to prove I am who I am. I cannot login to the app thru web browser as it says \"Too Many Attempts\" despite following the steps.",
      "replyDate": "2023-10-28T23:34:24.240Z",
      "replyText": "Hi, Jack! Please try reaching out to our the Shopify Support Team as they will be able to walk you through step by step: https://bit.ly/3htxIQ3 - Skye",
      "version": "2.131.0",
      "thumbsUp": 8,
      "criterias": [
        {
          "criteria": "vaf_never_display_visually_good",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_international_shipping",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 1
        }
      ]
    },
    {
      "id": "00284e80-97f9-4540-a4e0-d5fc6cf54d7e",
      "userName": "Jeremy Whaley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKMvN_Ap3zug4suwOED0gVYib82-kEQG4S4ELAsObgl=mo",
      "date": "2023-12-08T12:41:33.508Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=00284e80-97f9-4540-a4e0-d5fc6cf54d7e",
      "title": null,
      "text": "First, I keep getting error messages saying that there is something wrong with my internet connection when your app is the only one with that problem. Second, I don't know where you get your tracking, but there is a flaw. A package left Syracuse, NY at 8:38 PM and arrived in Byhavia, MS just 3 minutes later! That's not possible! Can you look into this glitch? Even the USPS web site says it is not in Mississippi.",
      "replyDate": "2023-12-08T13:08:16.685Z",
      "replyText": "Hey there, thanks for taking the time to review Shop! We're sorry to hear you didn't have a great experience with our app. We would love to understand the issues you experienced - if you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to help further! -Maz, Shop Support",
      "version": "2.135.0",
      "thumbsUp": 19,
      "criterias": []
    },
    {
      "id": "8bb4998b-879d-402f-bc58-3be8a44d4c58",
      "userName": "Ashley Wutkee",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVMR4Duai5zvBiIePWNxqrnuYR32J-t-AR-3ESvq91lVSMn",
      "date": "2023-11-29T17:49:31.257Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=8bb4998b-879d-402f-bc58-3be8a44d4c58",
      "title": null,
      "text": "This is such a convenient app! I mostly use it to track multiple purchases when I've gone on a bit of a spending spree at different stores and don't want to keep looking up individual shipping notification emails to check on tracking repeatedly. I also love when it helps me finish an online purchase real quick, saving me the trouble of entering my shipping and payment method info over and over again. I haven't shopped from the app yet or done anything with the free money sitting in my account.",
      "replyDate": null,
      "replyText": null,
      "version": "2.134.1",
      "thumbsUp": 52,
      "criterias": []
    },
    {
      "id": "3b6f2590-7608-4385-9c85-4503716ddb08",
      "userName": "Miranda McCain",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLLbmksrA6hRmvHCixfxFmO1U4lgn6-k0oGL4T9FyiF=mo",
      "date": "2023-10-06T11:05:40.253Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=3b6f2590-7608-4385-9c85-4503716ddb08",
      "title": null,
      "text": "I just thought I would put this out there... I hate the updates done to this app... you used to have all the payments in one spot..now I have to go threw all the notifications to find them.. I personally think this is flawed. It was much easier when it was on the profile page of what I owed.. you don't have to be different. The old way was better. I can't seem to find anything anymore and it makes me want to stop using it.",
      "replyDate": "2023-10-06T11:26:21.853Z",
      "replyText": "Hey there! Thank you for taking the time to provide feedback about the Shop app. Our goal is to provide the best mobile tracking app on the market, while also helping you reconnect with some of your favourite stores. We're a tight-knit team, so we'll make sure to channel this to the product team for their consideration! -Iris, Shop Support",
      "version": "2.128.0",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "c7ce0e75-4e59-4052-be0a-08ef98b8538d",
      "userName": "Andrew Carnborn",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgmFwB5Jwo_eP4S5b1FIfL_537eWUwh04Az2O92Btuo_o",
      "date": "2024-03-03T19:45:50.578Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=c7ce0e75-4e59-4052-be0a-08ef98b8538d",
      "title": null,
      "text": "Same as other users have stated, the app infinite loads when you try to connect Amazon. Uninstalling (which shouldn't have to be the case) used to solve the problem, but now it remains trying to reconnect. I track other packages but the MAIN point is for Amazon, so it defeats the purpose of the app when using my email or Amazon itself to track ends up being less of a hassle.",
      "replyDate": "2024-03-03T19:51:44.332Z",
      "replyText": "Hi there. Thank you for taking the time to leave your feedback, we truly appreciate it. I'm sorry to hear that your experience with the app wasn't satisfactory. If you haven't done so already, I'd encourage you to connect with our Live Support so we can take a closer look into this: https://shopify.link/mNgl. - Blair, Shop Support",
      "version": "2.145.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "02100ca7-f64f-413f-b26c-6fd67bfb6137",
      "userName": "Jacob Lunn",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIao8FrDnzgb-YGSeT7V5Yt23tZR8cFPvQJUk7_orYJ=mo",
      "date": "2024-03-06T00:02:06.938Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=02100ca7-f64f-413f-b26c-6fd67bfb6137",
      "title": null,
      "text": "This app is awesome for finding clothing that you'd have a hard time finding anywhere else. The only 2 things I can think of that would make it better for me would be a better search, so I can find things I like easier, something it does a decent job of already but could be much better, and a way to tell if something is available to be shipped to your region before going through and picking out a bunch of items and building an order over a few weeks just to find out you can't buy them anyway.",
      "replyDate": null,
      "replyText": null,
      "version": "2.145.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "1dbd2b70-6614-42e6-a3d7-946c65508584",
      "userName": "Jay “ThatBlokeCalledJay” Clark",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV3oH3nYxbg3iWSs9jhc-raXChzH0a6rpVU_9K9c19gAIU",
      "date": "2024-03-08T17:24:15.862Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=1dbd2b70-6614-42e6-a3d7-946c65508584",
      "title": null,
      "text": "Surprisingly good actually. I was forced into using to track status updates via a store I purchased from in the states. It's turned out to be a useful tool, keeping all my various order and delivery details in one place. There's a few gaps, probably a richer experience in the states, but still really good here in the UK too. It even keeps me updated with stuff I've ordered from abroad etc.",
      "replyDate": null,
      "replyText": null,
      "version": "2.146.0",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "192b9ec2-9009-4ac8-a078-96d7bceef56a",
      "userName": "Heather Catharina Bos",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL_GNo80Tv1zDi-pmWVvNYmdP8TD42zS2VFeF2BbWtXhoQ=mo",
      "date": "2024-03-15T19:54:43.525Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=192b9ec2-9009-4ac8-a078-96d7bceef56a",
      "title": null,
      "text": "I think the app works great! Gives me updates on multiple packages from different delivery companies. A tip for when your package enters your country, start tracking it through your postal service if it isn't giving more specific updates once it says it landed in your country. (No matter what you will see it out for delivery, but may not see exact location on route unless you track through your countries postal service) If it's UPS you don't have to worry between counties at all. It's great! 5/5",
      "replyDate": null,
      "replyText": null,
      "version": "2.147.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "7f5099de-165a-40a3-ae74-e845036e63ff",
      "userName": "Morgan Lorem",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJZRxIZ2WJXql4dYXfuIK0mGyISu1C-ajdvjAiWjzor=mo",
      "date": "2024-01-30T10:21:58.191Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=7f5099de-165a-40a3-ae74-e845036e63ff",
      "title": null,
      "text": "Mostly does it's job for orders placed on Shopify stores, but Tracking doesn't work properly for some shipping providers, such as YunExpress, and some Shopify store orders aren't picked up at all until they are forwarded to the address provided in \"add order manually\" Unfortunately the Amazon integration is non-functional for the 7.5 Billion of us that don't live in the US, UK, CA or AU. If these issues were fixed, it's probably worth 4*, but as it is a 2* with great potential for improvement",
      "replyDate": "2024-01-30T10:33:18.951Z",
      "replyText": "Thanks for taking the time to leave a review for Shop. We're sorry to hear you didn't have a great experience with our app and we would love to understand the issues you experienced. If you're open to it, please reach out to us here: https://shopify.link/bmyj. We'd be happy to take a look at this issue to find a resolution! -Rick, Shop Support",
      "version": "2.140.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "63d4645b-89a6-4c5c-8884-92ea7d5fb812",
      "userName": "Mark Noble",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVOq62IL3azHQK8On8hnrjrIIqUycPzLSUkMtP5b2vu0OM",
      "date": "2024-03-06T22:02:37.627Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=63d4645b-89a6-4c5c-8884-92ea7d5fb812",
      "title": null,
      "text": "Shop’s support (especially Jenna) was unhelpful with addressing an Amazon account linking issue. They repeatedly asked for the email associated with my account after I had provided it twice. The problem, which ultimately resolved itself, suggests a system flaw that they eventually corrected. Their support wasted my time, lacked professionalism, and refused to escalate my concerns when I tired of their nonsense. 👎",
      "replyDate": "2024-03-06T23:20:03.734Z",
      "replyText": "Hey, Mark! Thank you for taking the time to share your review and we are sorry to hear you were not able to get the support you needed with this. You are absolutely correct in identifying an intermittent issue impacting the Amazon connection which we are working on resolving. Thank you for your continued patience and understanding. -Olivia",
      "version": "2.146.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "835b6517-964c-48a6-9886-6cd51789933d",
      "userName": "Hell 666",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXLDxBH8ZEykSdBMI9j5znRORDtqp0LqywAXEWfnLbtjlk",
      "date": "2024-03-02T12:25:15.967Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.shopify.arrive&reviewId=835b6517-964c-48a6-9886-6cd51789933d",
      "title": null,
      "text": "Not too keen on this app,more so because it keeps marking items as delivered when they haven't even been shipped, it has happened to a few items I have ordered and honestly it's very annoying.....I plan to delete this app once I do have everything that I have ordered. Your response has me puzzled as you are saying the updates come from the carriers and that there sometimes can be issues I have an item marked as delivered that isn't due to be released in April so please explain why this is....",
      "replyDate": "2024-03-02T11:43:41.965Z",
      "replyText": "Hello! We know how important it is to have up-to-date tracking information. While Shop's updates come directly from the carrier, there can sometimes be issues. We are working on improving this, so thank you for holding us accountable! -Maz, Shop Support",
      "version": "2.145.0",
      "thumbsUp": 1,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CmoKaDAsMTAwMDAwMC43Mjc5Mzg0NzMyLDg3MDE3MzM2MzY2NSwiaHR0cDovL21hcmtldC5hbmRyb2lkLmNvbS9kZXRhaWxzP2lkPXYyOmNvbS5zaG9waWZ5LmFycml2ZToxIiwxLGZhbHNl"
}