{
  "data": [
    {
      "id": "2c1da839-f64e-422a-9553-9e08362340c4",
      "userName": "Gordon MacDonald",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIY6kOtao1mY6VCU7ql5X-0AfP1fgbn3N4Hg-x_sHyN=mo",
      "date": "2024-01-30T19:37:08.399Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=2c1da839-f64e-422a-9553-9e08362340c4",
      "title": null,
      "text": "Only wanted to use this to transfer text messages and it didn't work fully. A lot came over, but a lot didn't. Messages from my wife stopped at August 2023, today is January 30th, 2024. No media included in messages came over. Other friends texts stopped at October, November last year. Can't trust what came over and what didn't. Tried updating both phones and resetting iPhone several times, but got the exact same result everytime. If I can't trust it for messages, I won't trust it at all.",
      "replyDate": null,
      "replyText": null,
      "version": "3.5.0",
      "thumbsUp": 172,
      "criterias": []
    },
    {
      "id": "99efcc33-f76c-4432-b9bb-1a086f4c20bb",
      "userName": "Mathew Hennessy",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKYRF06C0rWi7kCaNwlfZNw4juf14GXxuh2ix1l-Ufb=mo",
      "date": "2024-01-09T22:06:30.324Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=99efcc33-f76c-4432-b9bb-1a086f4c20bb",
      "title": null,
      "text": "DO NOT USE THIS APP!!! After a two hour file transfer, the majority of my messages and apps were gone, contacts merged into groups, thousands of photos are a jumbled mess. It even erased my bookmarks and cleared my favourites on tik tok. Once the “transfer was complete” my Samsung will not turn on or even charge. It’s killed my android phone so I can not recover everything that was lost. DO NOT USE THIS APP.",
      "replyDate": null,
      "replyText": null,
      "version": "3.5.0",
      "thumbsUp": 453,
      "criterias": []
    },
    {
      "id": "1e093ebe-281f-480b-b62e-1ae29f560ab9",
      "userName": "Geoff Montee",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVY4GmcsFrO_OFHcE8mQPHLf2eclfvLERmQbmFK66ekVg",
      "date": "2023-12-20T05:21:02.855Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=1e093ebe-281f-480b-b62e-1ae29f560ab9",
      "title": null,
      "text": "This app did a decent job transferring data, but it is far from perfect. Group text messages don't really transfer seamlessly. On my new iPhone, my phone number is included in each group as an unknown contact. Google accounts don't actually get transferred, even though \"Google accounts\" is listed as an option to transfer. App data doesn't get transferred at all, which kind of makes sense. Be prepared to setup every individual app after the transfer is complete.",
      "replyDate": null,
      "replyText": null,
      "version": "3.5.0",
      "thumbsUp": 343,
      "criterias": []
    },
    {
      "id": "8c16731e-0860-433f-a943-261c3a2081f7",
      "userName": "Crackhead Dog",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVHbMdsooPCc5R5M55T35iXYio_Tq0Ob73VoYfFNJmSn-g",
      "date": "2024-01-21T03:35:44.274Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=8c16731e-0860-433f-a943-261c3a2081f7",
      "title": null,
      "text": "This app is honstly a good way to transfer your android data to your Iphone. Most of what I had on my android moved over without being corrupted. This includes all my messages, phone numbers, apps, and photos. The only bad thing about it is having to wait about 2 hours with your phone on through the whole process. My only other complaint is the duplication of my photos and videos in which I had to go back and manually delete duplicates. Otherwise it is a very useful app if you want to switch.",
      "replyDate": null,
      "replyText": null,
      "version": "3.5.0",
      "thumbsUp": 55,
      "criterias": []
    },
    {
      "id": "a52d59a2-7181-473a-ba0e-cdfd434f848c",
      "userName": "James Graham III",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW1-OzDHkIcSnrlxNahkuRZ6vYsn4h4PQn4hLUPcu1f-sU",
      "date": "2023-10-15T18:46:02.517Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a52d59a2-7181-473a-ba0e-cdfd434f848c",
      "title": null,
      "text": "I am dumbfounded by the negative reviews. I don't know what I would've done without this app as I use my phone for business as well as personal, and my text messages are essential to maintain. I was able to transfer all seamlessly including photos and data. It was completed in less than 15 minutes over Wi-Fi. I was afraid to go back to Apple for the reason of data transfer. This app made it a breeze and I recommend it to anyone making the change. (FYI, Pixel 7 Pro to iPhone 15 Pro Max).",
      "replyDate": null,
      "replyText": null,
      "version": "3.5.0",
      "thumbsUp": 451,
      "criterias": []
    },
    {
      "id": "ad489d06-a5ad-4321-869f-0769533cb4cd",
      "userName": "Paul Roberts",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLifOQGAJ6b3x58rfaEygdaHqRFkEPk-5eVfy6_smbRVA=mo",
      "date": "2022-07-02T18:46:48.971Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=ad489d06-a5ad-4321-869f-0769533cb4cd",
      "title": null,
      "text": "Complete garbage. Can't alter the iphone settings without completing setup, so the iphone falls asleep, at which point the transfer fails. Meanwhile, the progress bar doesn't actually work, so you can't tell how much or if any data has transferred, and if you start over, it'll just copy it all again. Love having three duplicates of my contacts that are incredibly difficult to delete manually on iOS, Apple! Great product!",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 728,
      "criterias": []
    },
    {
      "id": "c855a917-a846-4fb9-9a63-7f839b3c9893",
      "userName": "Summer Swaine",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV8zw-fH9-wfiaSqM_5tRbPE9WodIXa3qQ79qw5XdycVzQ",
      "date": "2022-04-05T14:50:09.196Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=c855a917-a846-4fb9-9a63-7f839b3c9893",
      "title": null,
      "text": "This app does not work. I have never NOT been able to transfer data from my Android to iPhone. I tried numerous times going through setup and having to reset my iPhone and start from scratch. Deleted a bunch of stuff so that the transfer size was smaller...didn't matter. Went to the Apple store, they couldn't help. Went to Verizon, they said it's a known issue with the app. I wasted an entire weekend trying to get the transfer to work properly only to give up and return the iPhone.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 240,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "343b4085-81ca-4ca6-bb6a-f0fa44d3aa1f",
      "userName": "Cameron Barton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJpPf-tZy-5T3JrB2I33wWHbtQoAkjjfB6u9VtW3x27=mo",
      "date": "2022-01-15T07:40:49.611Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=343b4085-81ca-4ca6-bb6a-f0fa44d3aa1f",
      "title": null,
      "text": "This app is the single worst app I've ever had the misfortune of experiencing in my life. A relatively simple concept, you'd think that between the two multi-billion dollar company's that are responsible for it, it might be somewhat capable of doing the job it it supposed to. Instead, I'm here 9 hours and 7 failed transfers later wondering how I'm supposed to do anything with a phone line that can't text, call, or use cellular networks. Thanks for confirming my fears about switching to an IPhone",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 57,
      "criterias": []
    },
    {
      "id": "aa06a31b-c6bf-4cb1-9458-1fed41b038b0",
      "userName": "Jeff Staack",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIKXPl7ae8OiREsYpo9JMqdOnK1vE08HyvP-X6kPOfW=mo",
      "date": "2022-01-15T04:12:54.359Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=aa06a31b-c6bf-4cb1-9458-1fed41b038b0",
      "title": null,
      "text": "Biggest POS ever. Apple clearly doesn't want your business, because this is THE WORST piece of software ever. Several years ago, I switched from iPhone to pixel for the photography; plugged in the cable, and 20 min later, my messages, photos, etc were on my new phone easy peasy. Now, trying to go back to iOS, this is the only option; it just plain doesn't work. Looking at reviews, it seems as though it hasn't for years, and 🍎 just doesn't seem to give a damn. Don't waste your time.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 445,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "ad2e05d3-1c07-43bb-b65a-f2c896f6ed3d",
      "userName": "Steve Katz",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVz2noJg8uzHFXfnujtiLrUzKlocoQfA6DFdVDornNI6Fm2",
      "date": "2022-01-03T15:13:57.240Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=ad2e05d3-1c07-43bb-b65a-f2c896f6ed3d",
      "title": null,
      "text": "Simply an awful app. It tells you there was a transfer error with zero additional information or instructions on further steps to take. After dozens of attempts, I was able to get it to partially succeed by unchecking messages and accessibility settings. Very disappointed with this -- as an Android convert, I expected my first experience with iOS to be smooth, and it was anything but. Would love to see some followup from Apple considering the hundreds of one-star reviews this app is getting.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 175,
      "criterias": []
    },
    {
      "id": "2ab37347-78b3-4cd2-8c74-d5d31f4979c3",
      "userName": "Garrett Stephens",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJzpzz-ovosZpoXiBOs_565G05K73mk4RyEZiHP-si5=mo",
      "date": "2022-03-30T07:12:52.911Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=2ab37347-78b3-4cd2-8c74-d5d31f4979c3",
      "title": null,
      "text": "At this point it's pretty well noted that the app basically doesn't work. What the creaters could probably easily do is allow transfer of small amounts of data at a time, so when it inevitably fails, you can pick back up where you left off--whether it be transferring photos, contacts, etc. At the moment it forces an all or nothing strategy, which pretty clearly explains its current rating. Very sad that there aren't better options.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 612,
      "criterias": [
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_visually_good",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_difficult_to_use",
          "rating": 1
        }
      ]
    },
    {
      "id": "9b0d7723-41c9-4f56-81e2-589dda85048c",
      "userName": "Laura Cunningham",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK1LBdPMIH0UiBRqSLQymqjGWKhGRfznun2sn1jgE4G=mo",
      "date": "2022-03-31T14:37:10.838Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=9b0d7723-41c9-4f56-81e2-589dda85048c",
      "title": null,
      "text": "This app doesn't work. I'm only trying to transfer my messages from a pixel 3a and get a transfer error every time. The transfer makes it to about 35-40min remaining and dies. I've tried every \"fix\" I can find on the internet, all with the same result. Both phones are plugged in, SIM removed from Android, no apps running in the background, phones connect on private wifi, Fail. This really shouldn't be so hard.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 254,
      "criterias": []
    },
    {
      "id": "01968518-6cf2-49dd-a248-cbc30f69828c",
      "userName": "Steven Mobbs",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUEjezrmZTjxKvev_F8WUBlQK8ybVI1UuP0F9VqaVHTZZQ",
      "date": "2022-02-20T08:56:53.902Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=01968518-6cf2-49dd-a248-cbc30f69828c",
      "title": null,
      "text": "What an awful, awful app. As much as Apple may hate Android, you would think they might put a modicum of effort into an app that is meant to switch people to their own platform. And yet, here we are. Seriously, this must've been made by the bottom of the barrel of their software team. There was no thought (limited thought at the most) put into the data transfer process. Why in the hell can data only be transferred over Wi-Fi? Was the reasoning supposed to be security? Because nothing is more secure than a direct cable connection, and it also happens to be faster. Perhaps their thought was that a user might accidentally yank out the cable in the middle of the transfer and have to start the process over again - which might be fine IF their Wi-Fi transferring worked. As you might be able to tell from the plethora of other reviews, it almost never works. When you do manage to connect, the estimated time is absurdly long, and often drops connection or runs into an error during the middle of the transfer. It's awful, and I hate that this is the only free way to transfer text messages from an Android phone. But seriously, it's 2022. Almost every Android phone from the past 5 years has been using USB-C, and the cable you get in the box for new iPhones is USB-C to Lightning. You'd think that a data transfer using the cable included in the box (that conveniently has both connections most people would need) would be a no-brainer. But I guess it's a tiny-amount-of-brainer, because the no-brains who design and update this app still manage to miss the mark. Hope they fix the Wi-Fi issues and add a cable transfer method, because this is an awful way to introduce people to the iPhone ecosystem, and I imagine it'll drive away many people who can't figure out alternate ways to transfer data.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.0",
      "thumbsUp": 338,
      "criterias": []
    },
    {
      "id": "8e66512c-b842-4eef-b79e-28a0fae671bd",
      "userName": "Andrew Weinstein",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVv8Iwp3fj9VXCg9kX3rug-nzvNrAiHz3fwIpOYDnPpBpo",
      "date": "2021-11-27T16:03:27.253Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=8e66512c-b842-4eef-b79e-28a0fae671bd",
      "title": null,
      "text": "This app is terrible. The support and instructions for this is just as bad. I tried for two full days to transfer my messages. This is the only way to do it. Apple Support sent me to a local shop, blaming my WiFi. The tech at the shop told me they have never been successful in this app working its way to completion. At that point, I had to decide if I wanted to switch to iOS and lose my message history or stay on Android.  It doesn't make sense about the WiFi comment from Apple because the iOS is the one broadcasting and is the backbone for transferring them. If you don't need to migrate your messages, there are other apps to transfer contacts, photos, and other items. Use those instead. So you might want to try to migrate your messages only and then use the other apps to transfer photos, etc.  If you are making the switch, here are some tips: * Don't activate your iPhone until this completes. Otherwise, you'll get texts, phone calls, etc. even though you're iOS device hasn't been fully set-up. If you do view your call log or texts, you'll have to go through the setup and then do a device factory reset and start the Move to iOS process all over again.     * It uses a private WiFi SSID from the iOS device to the Android device. For no more than 5 seconds, the Android device needs to connect to the SSID. If it doesn't, it just continues and tries to use your WiFi but it never goes anywhere and there is no indication from either app that nothing is happening.     * If you don't see a pop-up on your Android device that you connected to the SSID \"iOS xxxx\", then you might want to take a 3rd device out and then look to see if the iOS device is broadcasting it or not. There were multiple times I didn't see it broadcast so I knew to start over again.     * If you have to start over, it is best to restart both devices.     * Make sure that you leave both devices alone until the transfer finishes. For example, on your Android device, the Move to iOS app should stay on-screen the whole time. If you use another app or get a phone call on your Android before the transfer finishes, your content won't transfer. So maybe take the SIM card out and silence all notifications on your Android device.      * The instructions say, \"should stay onscreen the whole time\". Does this mean that if you turn off the screen, everything stops? What about burn-in? Even so I would advise to just leave it on because anecdotally, it seemed to go further (until it didn't). It is crazy that Apple engineers have to have the Android app in the foreground at all times with the screen on to make this work. This seems like a relic from pre-2000.      * Even though this doesn't work the first time, there is no mention of what happens if you want to only transfer messages only. My guess is that you then have to use other apps to transfer Photos, Music, Device contacts, etc. What progress indicators they have either constantly spins or there is a line that never fills up. At times, it may tell you how much longer it will take to complete, but if you triple that time and return to your device, it is still stuck on the same message. Perhaps they should have a progress indicator of how many kilobytes out of how many gigabytes are moving across the connection. Yes, kilobytes because it feels like waiting for a file transfer over a 14k modem.  Once you do get the file transfer, there are no warnings like \"the app stopped working due to.... \"   Good luck - hope you have better luck than me. I understand that Apple touts the security of iMessage but I would think that they would try to make this one of their most robust applications, not their worst.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 426,
      "criterias": []
    },
    {
      "id": "c653bc03-f907-4df4-885f-c41b88647655",
      "userName": "Christopher C",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUJJw2ipaODBUGWB_BrIxqjAuqtMyNAKMaTQYAz6RFeVfQ",
      "date": "2022-01-15T18:04:51.866Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=c653bc03-f907-4df4-885f-c41b88647655",
      "title": null,
      "text": "Always get \"transfer error occurred\" when the iPhone goes to sleep during transfer. I'm not going to sit around for an hour tapping the screen every 30 seconds just to copy 200MB worth of text messages. Definitely reconsidering this switch if this is what iOS has to offer. I'm reading that the previous version of the app works fine so it's obvious Apple is the one at fault here.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 88,
      "criterias": []
    },
    {
      "id": "c71264c1-f7ba-48e9-8381-49d7b22e285f",
      "userName": "Alex Montague",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVvQSIjM5aJoQ0dG_W30CmBI5arVaeC4sAJFgaGl2SVXAY",
      "date": "2022-11-04T22:14:32.713Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=c71264c1-f7ba-48e9-8381-49d7b22e285f",
      "title": null,
      "text": "Transfer fails every time. It doesn't tell you important setup information needed to complete the process. If the iPhone goes to sleep the transfer fails, but you can't change settings to keep the screen on until AFTER the transfer and the default is 60 seconds, so you have to keep touching it every 50 seconds. Transfer time is estimated in hours so that's fun. Still haven't gotten it to work. It would be nice if either the app or the iphone told you WHY the transfer process failed.",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.1",
      "thumbsUp": 454,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "61b91a83-2970-48a5-b527-14ddaa3e2fef",
      "userName": "Shane Taitt",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVW9n0hz6bkBVQQJ2r9RqYunfRHWhTlpyW7qYFYU4UXOGw",
      "date": "2020-12-13T21:55:44.345Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=61b91a83-2970-48a5-b527-14ddaa3e2fef",
      "title": null,
      "text": "This app is a freaking joke. I was never able to get it to transfer for more than 10 minutes at a time because I kept getting a Transfer interrupted error. If it would even work, it said it was going to take 3 hours to transfer from a 64GB phone. I ended up only transferring my contacts and email accounts, then dumped this app for a much better one for photo transfer. I did do all the recommendations for eliminating the error, but nothing worked.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.0",
      "thumbsUp": 145,
      "criterias": []
    },
    {
      "id": "5b4c6d52-936e-4ccf-b52a-819969324891",
      "userName": "John Tiede (Jack)",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLgBSy9UAwdZCiNJie4Uo3Z2CPLy86BfZ9bdDlSzn26=mo",
      "date": "2022-08-01T06:19:58.830Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=5b4c6d52-936e-4ccf-b52a-819969324891",
      "title": null,
      "text": "I'm sure it's hard on the technical side to switch from Android file formats to iOS, but this app pretty completely fails at achieving this goal. The file transfer ALMOST completed the first time I did it, but my new iPhone fell asleep (quite easy to do because in setup you can't change how long it takes for the screen to sleep, meaning I had to tap it every 30 seconds for HOURS), and the transfer failed anyway. After many more attempts I just gave up on transferring most data.",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 263,
      "criterias": []
    },
    {
      "id": "93cb5a4f-48e1-47b0-8066-8ed80e87e201",
      "userName": "Cora Crisher",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWvvcVjJDitLmw5ZlakgZ_ef9_LnCftSzdUq8CH5Dlfxs0",
      "date": "2022-03-20T18:48:43.851Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=93cb5a4f-48e1-47b0-8066-8ed80e87e201",
      "title": null,
      "text": "Your 0hone has to be at 50% no matter what! Even if you have it plugged in, it won't work. Had to sit around for 30 minutes at the store before I could do the transfer and set everything up. Very poorly designed. Also, iPhone gives you a usbc to lighting cable so why isn't there a wired connection option?? Definitely need to do some major upgrades to this app.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 186,
      "criterias": []
    },
    {
      "id": "9e6eafd9-1a9b-42e0-b87d-5694ef81edc9",
      "userName": "Walter Smith",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLE6okQAhj0t3LFSq8nOLPHYLjC__4tF1Fv3MpQiOsh_g=mo",
      "date": "2022-04-21T08:54:56.756Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=9e6eafd9-1a9b-42e0-b87d-5694ef81edc9",
      "title": null,
      "text": "Seriously, don't waste your time with this app. I tried transferring data from a moto x4 to an iPhone 13 and the process never completed. The app takes 10-15 minutes just to get the phones connected, even when I was on the same private wi-fi. Once finally connected, the estimated time to complete was inaccurate. The iPhone showed 11 hours to complete the data transfer, but proceeded through the first \"six hours\" in about one hour. The next five hours was about correct, but it got to one minute remaining and never got past it. I waited thirty minutes additional minutes before giving up. Not sure what I'll do now, but save yourself from this headache.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 615,
      "criterias": []
    },
    {
      "id": "9c4792ea-b228-460a-aa79-b467042d3069",
      "userName": "Rick Barr",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVeBJxboK_YlelUihL4wt77PC0LhDgjwml59eSxhDFWkns",
      "date": "2021-01-28T00:26:54.851Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=9c4792ea-b228-460a-aa79-b467042d3069",
      "title": null,
      "text": "It worked for me. I did get the \"transfer interrupted\" message than many are complaining about, but it appeared when the transfer was almost done. I started again and the app picked up where it had left off and finished quickly. So minus one star for having to run it again but really, no biggie. My guess is this works better for some Android phones and not so well with others. I had a Pixel 2.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.1",
      "thumbsUp": 547,
      "criterias": [
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        }
      ]
    },
    {
      "id": "2156cd86-ae49-4b6e-ad3a-ad136319a226",
      "userName": "Jenny Ryals",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUDKWwYNdp9Z0BA_C52ZrEPu5EwItil4ixtSkvnAMxXSw",
      "date": "2023-01-10T12:43:09.431Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=2156cd86-ae49-4b6e-ad3a-ad136319a226",
      "title": null,
      "text": "This app is garbage. I have done every bit of troubleshooting but it keeps getting stuck at 1 minute left (for 7+hours) until I give up, cancel it, and try again. My WiFi connection is absolutely not the problem, nor is the amount of data being transferred, yet here we are. This is my first iPhone ever and this nightmare of a transfer process has made me seriously question my decision to switch to iOS.",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.2",
      "thumbsUp": 837,
      "criterias": [
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 3
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 2
        }
      ]
    },
    {
      "id": "ac763635-8216-46d8-82cd-93ab23409d09",
      "userName": "Aadi Bhattacharya",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVEF0CAUqSniDh3NL8fpjH18ZWH1W4cj4tM7lYReg34a8E",
      "date": "2020-08-10T14:21:06.652Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=ac763635-8216-46d8-82cd-93ab23409d09",
      "title": null,
      "text": "This app helped me move from a Galaxy S7 to an iPhone SE. I was hesitant to use this app because of all the bad reviews, but it ended up working fine. I turned on airplane mode in the beginning, and the whole process took about 40 minutes to transfer my messages, contacts, and photos. The only reason I took off a star is because my photos weren't in the right order, which is kind of annoying. Other than that, it worked fine. I'd just make sure that the name of the wifi connection on the android is called \"iOS _____\". For example, mine was iOS d046c. The password and network name is the same. If your android is not connected to the network from the iPhone, the transfer won't work.",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.2",
      "thumbsUp": 731,
      "criterias": []
    },
    {
      "id": "fc477189-69a9-4758-804d-2ab925a31792",
      "userName": "Daniel Bliss",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL_V229pg0NckaC-yWscn-aOiB67RS0Sn_EKLzWnzYL=mo",
      "date": "2021-11-17T15:45:29.643Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=fc477189-69a9-4758-804d-2ab925a31792",
      "title": null,
      "text": "Should be zero stars. And the title of the app should be, \"iDon't Move to iOS.\" It's hard to imagine a worse advertisement for Apple. A little edit here now that my mind is made up. My first attempt at \"moving to iOS\" actually worked, but then I got delayed in activating the iPhone and was advised by Apple tech support to reset and start over if I wanted to get messages that had come into my Android during that delay. Every subsequent attempt, seven resets of the iPhone, plus reinstallations of [Don't] Move to iOS, failed. Seemed to me the app hangs if it sees an iPhone has previously been activated on the account. AT&T's generally excellent AT&T Mobile Transfer app unfortunately isn't a full answer because for Android to iOS it doesn't transfer SMS messages, text or photo. In the end the only thing that saved me is that successful first attempt had backed up on iCloud (definitely an Apple plus there), or I'd have been faced with a choice between losing nine years of messages or staying with Android. That's no choice at all; I'd have gotten a refund and stayed with Android. Apple -- FIX THIS! When it works, it's great. But 95 percent of the time it seems it does not work. And it ought to be more flexible than requiring a completely blank virgin iPhone.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 43,
      "criterias": []
    },
    {
      "id": "a2f585f0-44d5-41e1-b725-e47269ccb2f1",
      "userName": "Rourke Buechel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUz09DK4zficXRjVdJOi0oZb8XWAIKxVG48OitLQjhy2jCg",
      "date": "2022-04-14T15:36:48.117Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a2f585f0-44d5-41e1-b725-e47269ccb2f1",
      "title": null,
      "text": "Horrible, I can't get it to work. I've tried restarting both phones, turning on wifi only and turning everything else off including mobile data and Bluetooth and other background apps. It gets hung up at \"1 minute remaining\". I even let it sit like that overnight for about 7 hours and still nothing. This is why I was afraid to switch to apple and I'm tempted to take the phone back at this point.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 363,
      "criterias": []
    },
    {
      "id": "fd6f8543-d55f-4f8a-a2bc-d39e798fdaf4",
      "userName": "Jeff Welch",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKpAzjbQbml-eiXrxBdyFntXAKlulF-3-JVtS27lVkv=mo",
      "date": "2021-12-14T15:41:20.248Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=fd6f8543-d55f-4f8a-a2bc-d39e798fdaf4",
      "title": null,
      "text": "This app is worse than nothing. If you try it and it works, great. If you run into issues and it gets stuck in pending status or you see the time remaining going up and up, you might be better off throwing in the towel and transferring to your new phone manually. I spent hours trying to get this app to do its job and after watching the time remaining go 3% and then error out, the status remain 'pending' for hours, or the time remaining go from 1 hour to 2 to 4, its better just to do it myself.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 55,
      "criterias": []
    },
    {
      "id": "9f670d4c-7ce4-46c7-b04b-c290c7b2338d",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-04-02T15:33:30.962Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=9f670d4c-7ce4-46c7-b04b-c290c7b2338d",
      "title": null,
      "text": "This app worked flawlessly to move all my SMS/MMS messages from my BlackBerry Priv over to my iPhone XS, and did so in 15 minutes. I didn't need photos or documents moved over cause they're already backed up on Google Drive. I don't have the size of the data moved, but it included all SMS/MMS messages from the last 4+ years, and believe me, there were a LOT. I did have to keep tapping the iPhone screen frequently to keep the phone from going to sleep. When the transfer was complete, I jumped up and down with joy knowing everything I wanted moved, was moved. I highly recommend this app!",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 402,
      "criterias": []
    },
    {
      "id": "b819f2df-9fde-47ef-a1b4-fb9b62228a17",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-05-06T11:54:26.536Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b819f2df-9fde-47ef-a1b4-fb9b62228a17",
      "title": null,
      "text": "This app hasn't been updated to operate on Android 9, so it won't even establish a connection between phones. If you're moving from a Google Pixel phone (any of them) to an iPhone, you're not going to be able to transfer your data through this app and you *will* lose all of your messages.  I only found this out after scouring the internet for solutions and noticing that Verizon's website states that \"Devices running Android 9.x are not currently compatible with Move to iOS.\" as of the 6th of May, 2019.",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 860,
      "criterias": []
    },
    {
      "id": "b8b3efd0-c81d-42ff-8fd7-fce68f49dbd4",
      "userName": "Anurag",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJrELQvvW9XN5nvp0EZmgbyAKg3_msl-VwEGOr62BOu=mo",
      "date": "2021-12-15T02:20:43.658Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b8b3efd0-c81d-42ff-8fd7-fce68f49dbd4",
      "title": null,
      "text": "The app is worthless - does not do anything. It keeps saying transfer error for just messages and contacts. It makes you wonder why would anyone be comfortable switching to iOS. Little care in development and does not do anything. Would rate 0 if possible. Unfortunately for some people they will have to figure out how to migrate everything piece by piece.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 88,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_difficult_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        }
      ]
    },
    {
      "id": "b9925f54-b42d-4e9b-baad-caa115071b35",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-07-09T00:53:07.188Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b9925f54-b42d-4e9b-baad-caa115071b35",
      "title": null,
      "text": "Complete waste of time. Might as well stick with Android. I have an iPhone 6s and a Samsung Note 8. I can never get the Samsung to connect to the iPhone. I get an error \"couldn't connect with device\" after TWO days of trying every single attempt save for one that involves a computer. I don't have a computer I can use to manually transfer my contacts, photos, messages and videos. This shouldn't be so complicated.",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 152,
      "criterias": [
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 2
        }
      ]
    },
    {
      "id": "4429fd89-e0a5-4756-886f-5f5588dd1093",
      "userName": "Siavash Omidvar",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK9B6dea85e5D3uoY_V4tic8tQaqwBCAaBruYJfyHH0IbY=mo",
      "date": "2022-01-24T21:24:38.210Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=4429fd89-e0a5-4756-886f-5f5588dd1093",
      "title": null,
      "text": "Worst experience Ive ever had. 5 hours later and the transfer still has yet to complete. All the info Im transferring is my messages and calendar (no pictures or videos or apps, nothing heavy). This is ridiculous. I keep having to tap the iPhone screen every 10 seconds to not turn off since that will crash the app. This is making me regret switching to Apple.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 66,
      "criterias": [
        {
          "criteria": "vaf_never_display_visually_good",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 2
        }
      ]
    },
    {
      "id": "8438b05d-c030-43aa-98e0-06a338a046ca",
      "userName": "Michael Thomas",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXGnsQ8d91FO6Z59zfPjwHiMmzdAc4FMJjfZwCm1qY4dys",
      "date": "2022-02-19T02:13:32.181Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=8438b05d-c030-43aa-98e0-06a338a046ca",
      "title": null,
      "text": "Well, it minimally worked. It transferred my contacts, but duplicated them 4 times, possibly from past failed transfers when I one by one gave up on transferring my pictures (I had a lot, ok), files, and messages. Kind of a dumb tool. The data transfer rate must have been in the kilobytes, and it seemed to screw it up whenever the new phone fell asleep, which happened a lot since it was a new phone and I couldn't change the settings.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 50,
      "criterias": []
    },
    {
      "id": "a394fcc9-68ed-4277-88ec-75a450449e58",
      "userName": "EdJoyce Millkell",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKXqZovKpJ2NyqYRAi9uAIZW67XEkHgklnzrp1_PPXX=mo",
      "date": "2022-01-19T20:34:25.420Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a394fcc9-68ed-4277-88ec-75a450449e58",
      "title": null,
      "text": "App is confusing and complicated and I never could get it to work after hours and 2 other devices. Steps don't have a clear order; tangled up security methods and will not connect devices for transfer. Seems like both companies are sabotaging each other to prevent account transfers. And you can't use a computer either...that \"lightning\" cable isn't compatible with any PC and you have to buy Apple's adapter. After all that trouble you might as well manually download each app you want!!!",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 174,
      "criterias": []
    },
    {
      "id": "5190bb7f-35ad-4f96-b440-ee62bad6b7fd",
      "userName": "Sarah A",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXlrH3LlBsUcXggPvdG7230EW0E1aWHsIIPe9ksupFhhWo",
      "date": "2022-07-13T00:06:29.944Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=5190bb7f-35ad-4f96-b440-ee62bad6b7fd",
      "title": null,
      "text": "Like others, I am trying to transfer my text messages from Android to iPhone but only the sent messages showed. The sent messages are all in ugly green text (of course). I have tried numerous times to get my conversations transferred but no success. I backed up my text messages to an XML file with SMS Backup & Restore Android app to G drive. I highly recommend it for Android users. I now regret my decision to trade in my Note 9 for an iPhone. I never had any trouble with Android transfers.",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 146,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "3c94059f-a5ff-4001-a4a7-87faa8e0f1d8",
      "userName": "Jennifer Munsee",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXbN600Ku8ECdyRDVFYDFdjRZ6dfR2bMDnfBM_ezTf1lo6B",
      "date": "2020-11-14T00:29:27.778Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=3c94059f-a5ff-4001-a4a7-87faa8e0f1d8",
      "title": null,
      "text": "This app is slooooow, and unlike Android to Android transfers that happen on the backend, this essentially hijacks both phones until the transfer is complete. It creates its own wifi signal which seems a lot less efficient than using the home wifi signal they are already connected to. Not sure its better security, but maybe that is the rationale. I recommend people skip the photo transfer and do that after the fact with google drive; otherwise you aren't going to be able to use your phone(s) for about 6 hours. You will also need to stay near the iphone as you can't adjust the screen timeout until you are post setup, and it will time out about every 30 seconds",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.0",
      "thumbsUp": 248,
      "criterias": []
    },
    {
      "id": "f0d800e1-ea0e-4288-973d-d2ffd4c17322",
      "userName": "Corinne Newsome",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWminraRzHmrEFg9IlmKRUmAuaDJynRYOBAe2SjD3_QWJtf",
      "date": "2022-05-08T21:36:55.544Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=f0d800e1-ea0e-4288-973d-d2ffd4c17322",
      "title": null,
      "text": "Really bad app. It skipped over a large chunk of my apps, files, and messages during the transfer. Like, it says the last time I texted by brother was in December instead of yesterday! I opted to back up my photos with Google, but I just know that if I used this app to transfer them, a lot of them would've been missed. But since there's no alternative for this app, they don't even care about the issues, because we'll use it anyway.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "92752ece-f9e9-46d3-b300-65dd998cabe2",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-03-17T02:12:40.584Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=92752ece-f9e9-46d3-b300-65dd998cabe2",
      "title": null,
      "text": "Absolutely useless. If I don't get the error message at the beginning that the phone is \"unable to migrate\" data, then the android phone will show a message that migration is complete, but the ios phone ends with the same error. I even reset both phones to factory settings, followed online guides, nothing would change. Wasted a lot of time on this app, and I still dont have my text messages on my new iphone. Very disappointing!",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 39,
      "criterias": [
        {
          "criteria": "vaf_never_display_make_you_happy",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "f6f817c1-7f2f-4b8b-b7e9-368f42aa03e2",
      "userName": "G R",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI6wSCotzuYOZjtEFR8ZKyBJXmp6BMi_6Bm1DSv0FSI=mo",
      "date": "2022-04-29T12:00:11.500Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=f6f817c1-7f2f-4b8b-b7e9-368f42aa03e2",
      "title": null,
      "text": "Unbelievable! I switched companies and they sent me an iPhone. I have an Android and attempted the data transfer in multiple occasions. Rebooted both phones, turned off cellular data, charged both phones to 100%, touched my toes while spinning in circles (sarcasm), but the transfer hangs at 1 minute remaining for hours with no progress. As I suspected and heard from several others....Apple SUCKS!!",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 167,
      "criterias": []
    },
    {
      "id": "10e53f75-e7a5-4eb5-a1e6-0fd1b2770ff3",
      "userName": "Atif Mushtaq",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUHktKnVFRwNeUDbpgDmgrw3SozbDrT4Wn-Y96EsIufD3U",
      "date": "2022-01-15T04:50:00.974Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=10e53f75-e7a5-4eb5-a1e6-0fd1b2770ff3",
      "title": null,
      "text": "No doubt this one is just a garbage. But how it works for me after too many attempts. Just don't put password while setting your new iphone, keep tapping your screen during tranfer and make sure no calls, no texts and forget all wifi passwords. Then only it will transfer your data. I am able to transfer contacts, messages and apps. I didn't choose video and images otherwise it will take much of your time. Just transfer important stuff and say goodbye to this app. Hope it will work...",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 53,
      "criterias": []
    },
    {
      "id": "573b1076-5571-4570-9a9d-b0a904c62f76",
      "userName": "DiAvanti Bedford",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUPjdlA-Gcsx6S-dSfXMrFNlAyR4QzOPmlSX1463QjYoJ69",
      "date": "2023-01-05T19:59:05.898Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=573b1076-5571-4570-9a9d-b0a904c62f76",
      "title": null,
      "text": "The app works perfect if you want to transfer apps, settings, accounts. However, if you want to transfer your text/call log it doesn't work. Have been trying for 3 days longest the I left the transfer up was 23 hours and nothing. Text/call log was most important for me as there's info I still need from them. All the other things are easy to setup/re download.",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.2",
      "thumbsUp": 300,
      "criterias": []
    },
    {
      "id": "cdd45176-43ba-4c37-82a3-64cefc5b83a5",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-02-07T11:14:36.928Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=cdd45176-43ba-4c37-82a3-64cefc5b83a5",
      "title": null,
      "text": "I gave the app 5 stars because it did actually work- but yes it's true, it does take a little time to transfer all of your files (I'm transfering from a galaxy note 9) and its true, you need a stable and fast wifi connection, both phones should be connected to the same wifi. Do not activate your iPhone until AFTER the process is completed. Yes some of your file will be out of order but...hey, first world problems, atleast you HAVE your files and it transferred my apps from the android!",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 129,
      "criterias": []
    },
    {
      "id": "a2c3aa5f-3fc5-42c9-983d-a0b22a3c29e0",
      "userName": "Anamaria Matos",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLEcgPlFl4k1GkR-cvEzFOnflBdwAxWlNjR84CPsL38=mo",
      "date": "2022-01-21T22:08:25.303Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a2c3aa5f-3fc5-42c9-983d-a0b22a3c29e0",
      "title": null,
      "text": "Beyond worthless! Buyer beware!BEFORE you buy an iPhone, note! It takes many attempts to get the transfer started. Then the transfer stops after a couple of hours. It will only start if mail is selected or everything is selected. If you select only mail, the iPhone won't let you rerun the app to get contacts or messages. What was Apple thinking when they designed an app that halts when you get a text or call - as if you can stop that from happening. Spent a grand on a phone that I can't use.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 112,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_easy_to_use",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "8a89406a-55b7-4f2e-bf4c-ab3299590d5e",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-07-11T23:15:41.288Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=8a89406a-55b7-4f2e-bf4c-ab3299590d5e",
      "title": null,
      "text": "I work for a phone company, where moving people's information is pretty common. For the most part Samsung smartswitch, lg switch, and restore from I cloud backup, has been successful. it's only when we try to use \"move to ios\" where it becomes an issue. both devices for some reason wont connect to wifi, it wont recognize each other. and then it just takes us back the previous screen. This has gotta be the worst transfer app by far.",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 65,
      "criterias": []
    },
    {
      "id": "b80d5fb2-aec9-45f5-9dfd-bf05fae6afaa",
      "userName": "Jeff Jacobson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVhfMUUnWdi1VPOxhfhxyWFNCPhpbZ0jYIfzovmN0OM2JQ",
      "date": "2020-12-29T05:53:55.597Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b80d5fb2-aec9-45f5-9dfd-bf05fae6afaa",
      "title": null,
      "text": "It worked fine. The app could be clearer that when you press Continue it will connect to the iPhone's WiFi hotspot for you, that you're not supposed to try to connect to it yourself in Settings. Transferring my Google account and ~2 GB of text message data took about an hour. Everything seemed to make it over. I didn't worry about the camera roll since I have all that backed up in Google Photos. Since the iPhone came with a Lightning to USB-C cable I do wonder if that would've been faster.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.1",
      "thumbsUp": 295,
      "criterias": []
    },
    {
      "id": "7a3d0bde-af22-49c3-8510-f484587288c1",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-10-23T13:59:45.240Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=7a3d0bde-af22-49c3-8510-f484587288c1",
      "title": null,
      "text": "Worked fine transferring data from my husband's OnePlus 7 to the 11 pro max once we figured it out by looking at tips online. Still took a full day and many failed attempts, but eventually everything was transferred. However, transferring my Pixel 2 XL to the 11 Pro won't even start to transfer. Once I type in the code, both screens say \"preparing\" for a couple minutes until the iPhone says it can't connect to the pixel and it takes me back to the code screen. Tried everything. Worthless!",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 66,
      "criterias": []
    },
    {
      "id": "78cc70e9-d1f5-4701-8d20-2a6ceb457a45",
      "userName": "Paula Yann",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX0t7Y5IP2cUS6EvIjWQcedL3pHDaNZaKP29jeNg9LImsDN",
      "date": "2022-04-12T03:02:21.656Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=78cc70e9-d1f5-4701-8d20-2a6ceb457a45",
      "title": null,
      "text": "I've used this app before and it worked fine, but now it doesn't work at all. I'm trying to transfer my messages to my iPhone but I repeatedly get an \"unable to migrate\" error on my phone. It's so frustrating. Do not use this app. Update 4/11: Sometimes, it does connect and is in process of transferring but it takes a ridiculously long time (20-30 hours for 5 GB of data). This app needs to be fixed.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 268,
      "criterias": []
    },
    {
      "id": "c69dacd1-4051-4317-8a14-cc40452933cc",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-01-09T04:28:38.228Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=c69dacd1-4051-4317-8a14-cc40452933cc",
      "title": null,
      "text": "The app takes HOURS and things don't even transfer correctly. My photos were sorted in albums and all went into one album on my iPhone. Only a few of my contacts transferred and some showed a name but the number didn't even transfer! I use Verizon. And Verizon has a Content Transfer App. It took about 10 minutes and everything moved over completely and in order. Dont use this app from Apple, find another one through a carrier or something else. This app is garbage.",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 64,
      "criterias": []
    },
    {
      "id": "cbae9520-4fa5-446d-9b88-051841aaff23",
      "userName": "Dana Gold",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ-ewqg_UD8Be01Jlh91ZiL2WHZZsbtHR16b3X4O9xb=mo",
      "date": "2022-01-25T02:12:55.614Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=cbae9520-4fa5-446d-9b88-051841aaff23",
      "title": null,
      "text": "Embarrassed to say I wasted a week of my life to try to transfer just 16 gigs from Note 9 to iPhone. Spent several hours uploading videos/photos to flash drive to reduce from about 25 gb to just 12. Even the 12 gb wouldn't transfer. Every time you have an error, instead of picking up where you left off it starts over creating several duplicates of the little bit you can get to transfer. I'm sure they do this by design to prevent you from switching to Apple. I literally cried in frustration.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 27,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "64c9b2ba-38ab-4fd6-97c8-21253073e76a",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-06-14T02:34:23.870Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=64c9b2ba-38ab-4fd6-97c8-21253073e76a",
      "title": null,
      "text": "First time after I installed the app, the transfer didn't work at all. After looking at support on Apple site regarding the app, and what this app should have instructed in the beginning is to make sure the wifi and data connection is disabled on the Android phone. After I disabled both the settings, the transfer works and everything went smoothly.",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 120,
      "criterias": []
    },
    {
      "id": "d127c8fc-8177-4b22-ba86-d616b30d5c44",
      "userName": "Michael Delgado",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXvs8RoOzluTxnX5Kz1dqyNHpfp6CZfRVhHtMJe6sX35-yN",
      "date": "2021-12-28T02:04:42.900Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=d127c8fc-8177-4b22-ba86-d616b30d5c44",
      "title": null,
      "text": "only thing I want to transfer is messages. this app is incredibly brittle, requiring no disruptions & failing on any wifi or app switching, and still hanging for hours while trying to transfer less than 1GB of data while on the same network with the two phones sitting next to each other. after waiting multiple hours, it has now crashed twice, requiring starting over. terrible.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 59,
      "criterias": []
    },
    {
      "id": "39bd2174-beb7-47f1-a8b0-3c90fe6d6c1c",
      "userName": "Frank Zych",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXl9p8Hh4bpsfgm95UMLTm78Hg3GYxIIUZD8ExWVoW-EZI",
      "date": "2022-12-31T15:21:15.536Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=39bd2174-beb7-47f1-a8b0-3c90fe6d6c1c",
      "title": null,
      "text": "First of all, this app should be called \"copy data\" or \"replicate data\" not \"move\" since it doesn't move or delete anything, it simply replicates your Android data. I ran it twice and both times it gave me an error and said it failed. Well, it copied most of the data so the error message isn't labeled correctly. It also should give an estimated time and show progress of what's been imported, but it doesn't. Ended up it copied my contacts and gmail but not photos. I can live with that.",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.2",
      "thumbsUp": 345,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "e5ec9e3a-0146-48de-b66f-f76bf177c565",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-09-21T06:46:28.906Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=e5ec9e3a-0146-48de-b66f-f76bf177c565",
      "title": null,
      "text": "Im not being able to sync this app on my note8 to my brand new iphone 11 on the set up screen. It does not recognize the codes. I've tried several times. Reinstalled multiple times and every code is not recognized. Both are on same wifi, next to each other. And both being charged. My softwares are updated. Please fix this issue ASAP or create another way to transfer android data to ios through Smart Sync and/or iTunes. I have a backup on my computer with Smart sync but it won't recognize iphone",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 16,
      "criterias": []
    },
    {
      "id": "336903b1-5efb-4f93-9cd3-bba50a02bbd1",
      "userName": "William",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV_N3IEIzpVTiPwbJFTCGz4301BfiNW6cLhG4ze6MwVU2s",
      "date": "2022-05-12T10:58:32.613Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=336903b1-5efb-4f93-9cd3-bba50a02bbd1",
      "title": null,
      "text": "After four failed attempts each taking over 8 hours I can definitively say this app is pointless. Why not just use the cord that is included with the iPhone and just transfer the data that way rather than over Wi-Fi...!? Every time there would be about 3 hours remaining in my transfer and I would receive a message that there was a connection error. Just stick with Android or start fresh on an iPhone.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 417,
      "criterias": []
    },
    {
      "id": "ee2c603a-2583-4fae-98d2-c9d3b0aff2e4",
      "userName": "Christina Weckwerth",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJr_PSqk_BTzbuavc7HMiQkeo9apvrJ67CkAc1WB20m=mo",
      "date": "2022-06-21T12:21:21.248Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=ee2c603a-2583-4fae-98d2-c9d3b0aff2e4",
      "title": null,
      "text": "We retried this app several times when it wouldn't work, and it just made things worse each time. If you are foolish enough to expect success, at least start it and let it run overnight. -Note: it was especially bad at getting text history: imported only one person's half of a text conversation, only pictures, or only text (depending on conversation) -introduced duplicate contacts x4, but only for half the address book",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 214,
      "criterias": []
    },
    {
      "id": "470e4af0-c90f-488b-bc46-9df9b3d61614",
      "userName": "Yuliana Bosken",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKL6Dz_npIiOfZrLIVdW_EniiWCrtdX4y9LzwuYTiE8=mo",
      "date": "2022-01-01T18:30:34.530Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=470e4af0-c90f-488b-bc46-9df9b3d61614",
      "title": null,
      "text": "This app sure put my patience and perseverance to test. I only wanted my messages as everything else is backed up in google. It failed more than 10 times. I admit I am a message hoarder and have some 6K messages (800 mb). It requires a very stable wi-fi. My first efforts were during peak hours in the evening (wifi drops occasionally) and it never worked. I tried the next morning and with some solid prayers and fingers crossed it finally worked, it took a little over 3 hrs.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 64,
      "criterias": []
    },
    {
      "id": "8bdfa538-cfa5-4da9-a872-23b1ac9089ce",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-04-12T00:52:11.249Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=8bdfa538-cfa5-4da9-a872-23b1ac9089ce",
      "title": null,
      "text": "Never could get it to work. Tried many many times. Most of the times the phones would not connect. The couple of times they did connect, they went through the process of the transfer, but in the end nothing was transfered. Tried all the trouble shooting tips but to no avail. Ended up having to purchase dr.phone from Wondershare, and that worked as advertised",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 351,
      "criterias": []
    },
    {
      "id": "fb066188-8c56-4dfd-b5eb-f2abcd5587fb",
      "userName": "Jordan Simon",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLAJRX4wpKSpj6C4ZJOQzOF5ncKNtnCDnHqolwxmJn4=mo",
      "date": "2022-01-14T02:32:38.933Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=fb066188-8c56-4dfd-b5eb-f2abcd5587fb",
      "title": null,
      "text": "This app is completely broken if you want to transfer your texts. And unfortunately it's the only free way to transfer texts. I tried a bunch of troubleshooting steps found online and still had 20+ failed transfers over ~8hrs of trying. I only had 700MB to transfer so it shouldn't have taken long. What finally worked was disabling RCS, changing off of the Google message app as default, and download an apk for the 3.2.0 version of the app. Once I did those things, the transfer worked.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.0",
      "thumbsUp": 11,
      "criterias": [
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        }
      ]
    },
    {
      "id": "7bf574eb-8d7f-49d0-975d-5d5200688dcc",
      "userName": "Bianca Shambrook",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX00Ybl8Fv_T3YkHW86WQBokSS-WrGVj2gmmR_MA9TPnybw",
      "date": "2022-06-02T13:43:38.981Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=7bf574eb-8d7f-49d0-975d-5d5200688dcc",
      "title": null,
      "text": "Doesn't work. Just spent 24 hours trying! This (again) is a reminder of why I loathe Apple & it's undertone mission to make everything twice as hard (& twice as expensive!) Alas, I've been coaxed to change for work. It's basically impossible to transfer data. Why the noodle wouldn't they just enable it via a cord? The app doesn't do didddly-squat. (I didn't even try to transfer photos either! Lord knows how long that would have taken!) Do not recommend. Please find something.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 103,
      "criterias": [
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_negative_ads_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        }
      ]
    },
    {
      "id": "cc3eb5e6-1aad-4037-a690-f974351b9216",
      "userName": "Rachel Wells",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKS4scEzxxw3tpxy0o4tEbVI7f2WL3HGMwIuGxXwVFI=mo",
      "date": "2022-04-03T15:27:31.584Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=cc3eb5e6-1aad-4037-a690-f974351b9216",
      "title": null,
      "text": "I have never been so frustrated with an app to the point of writing a review, but this app is NOT effective at all in transferring texts and mms messages to an iPhone. It appears the process stalls out once it tries to convert an mms or group text. Was looking forward to the transition to ios but have been very disappointed by this experience. Just be upfront if your app can't do this.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 71,
      "criterias": []
    },
    {
      "id": "a4da9064-3356-490c-8237-ee85d07c681a",
      "userName": "cynthia muaka",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKjXqd4fM99-l45rtQZf0GhosIrmVuxql9NlvPn_jbC=mo",
      "date": "2022-03-20T17:42:09.331Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a4da9064-3356-490c-8237-ee85d07c681a",
      "title": null,
      "text": "I am tech support and help clients move to IOS. And let me tell you I have tried using app over 1000+. I have never been able to transfer simple things like photos or important Documents. First of all the estimation are always wrong. The app say 15 minutes until completed . But after an hour. You get an error and have to start all over... waste of time. And it leaves the clients unsatisfied of move to IOS. Especially after such a hype to get an IOS device.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 141,
      "criterias": []
    },
    {
      "id": "23afd05f-51ed-429f-84c9-21b09a28995e",
      "userName": "Ronald Pant",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU2u7J8AI3uFcqkPH-AW0BXh6edwei3jE6aXEukfDeNjA",
      "date": "2021-02-20T19:35:54.302Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=23afd05f-51ed-429f-84c9-21b09a28995e",
      "title": null,
      "text": "I work in the cell phone industry and use this app almost on a daily basis to transfer customers from Android to iOS. It is slow usually takes HOURS to complete. Usually have to restart the process several times. Then, when it wants to download many of the apps from the Apple Store, it forces you to say yes to each individual app. That consists of THREE taps for each app. I can only imagine what it's like for a customer to do this on their own, when I use it daily and it frustrates me.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.1",
      "thumbsUp": 490,
      "criterias": [
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_visually_good",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        }
      ]
    },
    {
      "id": "d4ae67e6-7208-474a-8e60-10a14b685fff",
      "userName": "Walt",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ1OIxIB3fWYD0391GLl1OL-GrzY0EqP_0S2ugbeA3g=mo",
      "date": "2021-05-05T13:09:47.655Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=d4ae67e6-7208-474a-8e60-10a14b685fff",
      "title": null,
      "text": "Horrible experience. After 3 hours of trying to get it to work from my Pixel4a to iPhone 11 pro, with multiple restarts and resets, I finally was able to turn off transferring the camera roll (20GB) and then it took 2 hours to transfer apps/contacts. There's still a ton of manual setup to do after that, so the only benefit was transferring text history. What a trash app.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.1",
      "thumbsUp": 93,
      "criterias": []
    },
    {
      "id": "440eea38-5eb2-4659-8cd8-e9437e7ee0ec",
      "userName": "A. Rock",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWqBnygaO90X0WCuwETJG1yMhNs6wEsoCMtvlDcA23XDdI",
      "date": "2022-02-13T16:00:58.536Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=440eea38-5eb2-4659-8cd8-e9437e7ee0ec",
      "title": null,
      "text": "This app is absolutely useless. I have been trying to transfer minimally my contacts and text messages from Google pixel to iPhone and it has been 24 hours with no success. I have troubleshooted as much as possible and am still on the phone with Verizon how to fix this. The app takes 8+ hours each round just to tell me \"failed to migrate try again later\". Don't even bother.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 85,
      "criterias": []
    },
    {
      "id": "fccf5863-4ebd-445b-bbd6-bcc3b28e5a36",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2020-04-22T14:01:50.467Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=fccf5863-4ebd-445b-bbd6-bcc3b28e5a36",
      "title": null,
      "text": "Just got done testing the app from my Pixel 2 XL to my old 5s before I get my new iPhone (yeah, back to iOS after a year of Android). Worked like a charm, just made sure I kept the screen on the iPhone on the whole time it was transferring (took about 20-25 minutes). Lots of texts, not a whole lot of Pics though since they're in the cloud already for me. Not sure why all the negative reviews, just keep the screen on and you're good to go!",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 156,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        }
      ]
    },
    {
      "id": "37c317a1-961f-42f5-aa41-8dace13df1c3",
      "userName": "Michelle",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVnsnliAUxKANiZoBCI8rwqCb5rn-TddCnPyX6PHzjqWyk",
      "date": "2020-10-21T07:16:27.967Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=37c317a1-961f-42f5-aa41-8dace13df1c3",
      "title": null,
      "text": "Complete waste of time. I spent hours trying to transfer the data on my Samsung to my iPhone, and it always gave me the \"unable to migrate files\" error. None of the tips I found on the Internet worked as well. Turning on airplane mode, connecting both phones to the same wifi, connecting to ios network... nothing. I'm extremely disappointed with Apple. The numerous bad reviews and the fact that they have done nothing to resolve this issue tells a lot about how they feel about their customers.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.0",
      "thumbsUp": 667,
      "criterias": []
    },
    {
      "id": "12c6ad07-7aa8-4c7a-8bf9-84dadd3deebd",
      "userName": "Kim Lim",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIHrWJQ_WpY-UQc6b9l2c06ABfm_5Xmod5zBqlBn9ok=mo",
      "date": "2021-11-28T10:59:02.346Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=12c6ad07-7aa8-4c7a-8bf9-84dadd3deebd",
      "title": null,
      "text": "Horrible app that keeps having transfer errors. Been trying to transfer from a Samsung to an ip for 4 days. So far, the only items that can transfer over are the accessibility and display options. Anytime I try something sides those two options, the app crashes or the Samsung phone has a transfer error or the iPhone has a transfer error. I'm switching to use a computer based app with a cable to do the transfer. What an enormous waste of time.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 98,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 3
        }
      ]
    },
    {
      "id": "e4fdb371-a21f-4b8e-b748-7b1a17b36885",
      "userName": "A Dubb",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKjGftwYuqDGAk3tFwMvguUKn2_iLrbeXvPS-NGxR4Z=mo",
      "date": "2022-07-08T15:18:47.935Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=e4fdb371-a21f-4b8e-b748-7b1a17b36885",
      "title": null,
      "text": "I wish I'd read the reviews before I used this app. Half of my apps didn't transfer. Only the sent text messages transferred, none of the received, so I lost half of all of my conversations. Now when I try to send a text on my new phone it tells me it failed to send unless I search the person I am texting. All of my photos are completely out of order and the information associated with the photos like date, time and location is gone.",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 460,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "64bdba7e-57c3-4a64-bbea-12805b68bf27",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-09-22T11:47:09.807Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=64bdba7e-57c3-4a64-bbea-12805b68bf27",
      "title": null,
      "text": "I wanted to try the iphone 11 and transfer over my texts, but Apple has not updated this app in over three years. None of the workarounds suggested work. The app drops the wifi as soon as you enter the six digit code. But if you enter an incorrect code, the wifi connection sticks and you get 'connecting to iphone'. Apple needs to update this app to work with Android 10. Or, as Apple always says, in a way that \"it just works.\" Enjoy your returned device, Apple.",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 24,
      "criterias": []
    },
    {
      "id": "b6f65b56-d081-4ee1-9ea2-ecdb861e99d0",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-12-30T15:59:24.846Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b6f65b56-d081-4ee1-9ea2-ecdb861e99d0",
      "title": null,
      "text": "App worked as advertised. It made moving everything over easy. Sure, it takes a while, but it works. I would like to see a hardwired option in the future to speed up the process... Or, you know... Like a cloud based messaging system that either OS can read from so you don't have to transfer data from one phone to another. I don't understand the one star reviews, honestly. The estimated time is nowhere near the actual time... Just be patient, read a book, make some coffee. Chill...",
      "replyDate": null,
      "replyText": null,
      "version": "3.0.1",
      "thumbsUp": 172,
      "criterias": []
    },
    {
      "id": "a60b84e0-e8ea-4a6d-b4e1-e64621bdb26b",
      "userName": "Kyle Gorrell",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUF6ZdEQbBgy5gN5vDz01UU1Bz7WlP8BTIwfwPuLSoCYqMQ",
      "date": "2022-02-10T20:22:30.179Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a60b84e0-e8ea-4a6d-b4e1-e64621bdb26b",
      "title": null,
      "text": "Couldn't ever get it to work. Any time I tried to transfer anything it would give me a ridiculous estimated time (4 hours for just contacts and calendar, 10+ if I added texts), then it would run for a couple hours before telling me there was a transfer error and making me start over. Every single time. I ended up having to find something else to transfer my data.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 248,
      "criterias": []
    },
    {
      "id": "7c5e9d67-5303-42aa-8fd8-21edb936f834",
      "userName": "Isabel Bayer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWuBw5cOq8I4Kh4_G36t0w_7fpS9f-d4sd6ljXB14pws1z1",
      "date": "2022-04-11T04:40:10.865Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=7c5e9d67-5303-42aa-8fd8-21edb936f834",
      "title": null,
      "text": "This app consistently fails after 10% ‐ 60% has been transferred from Samsung S8 to an iPhone 13 Pro. An error msg occurred on the Android app with no error code or explanation of the problem. Once I gave up and continued the iPhone set‐up, I discovered that some of the data actually did transfer (not sure how much?). The contacts were duplicated 6 or 7 times due to the failed attempts. Very poor app. I expected more from Apple. I would fire the development team for this app.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 41,
      "criterias": []
    },
    {
      "id": "b08db3fd-bf7c-4e80-a7cd-92b9a58b7ce2",
      "userName": "Andrew Williams",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX-3pVQzbyRMrPM5kaWkmR7QX0N4ZR3xJasz9sZaji6aI4",
      "date": "2022-10-23T04:42:57.337Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b08db3fd-bf7c-4e80-a7cd-92b9a58b7ce2",
      "title": null,
      "text": "Nightmare. I tried 6 times with different variables and produced the same result. My 3 main contacts' texts were missing due to the sheer amount of texts they contained. It saves all of the pictures sent through text, but none of the actual texts. It did not work for this, now insane, iPhone switcher. I've wasted hours and hours over 3 days in this futility. Enough is enough.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 45,
      "criterias": [
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_difficult_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_negative_ads_impact",
          "rating": 2
        }
      ]
    },
    {
      "id": "d94ef312-eb00-4094-b536-776fcf28a163",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2018-11-03T17:21:40.983Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=d94ef312-eb00-4094-b536-776fcf28a163",
      "title": null,
      "text": "Pixel to iPhone - failed, failed, failed to communicate. I have tried every single tip, multiple times. The results have been consistent - Failure. I am so disappointed with Android v9 that I was willing to move on over to iPhone.. but this app is not the way apparently. That sucks, since I really wanted SMS and Call history to move, the rest I can do manually.",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 16,
      "criterias": []
    },
    {
      "id": "a81f95ae-290c-4cc8-adc3-dbdb88434c6b",
      "userName": "Antonio Cruz",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUA0q1MVKvwD3--302MpP6TMB2t41CrPuqVcK-DBf2L83U",
      "date": "2021-12-01T02:10:27.290Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a81f95ae-290c-4cc8-adc3-dbdb88434c6b",
      "title": null,
      "text": "Genuinely Terrible and unusable. Was extremely excited about getting my first iPhone and was coming from a Pixel 3a. Ended up paying a restocking fee to keep my old phone. Unusable. This app took 2 hours to prepare then started moving over things and then promptly crashed leaving a random assortment of pictures and videos all mangled together into one folder with no rhyme or reason, 2 photos from the past year, and transferred random text messages from 2017-2018 (in November of 2021).",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 29,
      "criterias": [
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "b368ce3a-1c89-47c4-a99d-d2a8f6747630",
      "userName": "Fidelina Morales",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX1y9IHa6R29Q_-E5FYb2TxBsUbR9P1WUBY_18tQtJKu1o",
      "date": "2021-12-25T03:49:35.798Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b368ce3a-1c89-47c4-a99d-d2a8f6747630",
      "title": null,
      "text": "crashed a few times and uploaded all the data each time it was restarted. had to reset the phone i'm transferring to and started again. app crashed again. it uploaded my emails at least 10 times, as well as each contact. EVERYTHING 10 times. been working on it for 5 hours now going on 6. there seems to be no other option. will have to reset my phone AGAIN and hope it works.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "448d073a-008d-4a01-bf5e-3055a4548bcf",
      "userName": "J",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJYESzGbcbH6lnIxvenfeCAnFHNXBaPe1kMZ1ovLwve=mo",
      "date": "2022-02-25T09:19:32.444Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=448d073a-008d-4a01-bf5e-3055a4548bcf",
      "title": null,
      "text": "Doesn't work. After multiple resets both handsets connected. After 4 tries, waiting hours, the app hangs with '1 minute left' and cannot complete the transfer. I could transfer my apps one at a time faster than this app takes to fail. It's 2022. You can't do better then this?? I will be returning my new iPhone. For +$800 I can buy an Android flagship phone and be up and running in no time. Apple doesn't think they need customers to switch from Android, this app is less than an afterthought.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 8,
      "criterias": [
        {
          "criteria": "vaf_never_display_easy_to_use",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_disruptive_ads",
          "rating": 2
        }
      ]
    },
    {
      "id": "4f92161b-a35c-4a21-a1e7-087339fd3731",
      "userName": "S Avila",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ6GSJm-7NSqi2Q4GYRwIohLiiuXBQWaaWq2x0Zv4qrnA=mo",
      "date": "2021-12-04T16:54:56.559Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=4f92161b-a35c-4a21-a1e7-087339fd3731",
      "title": null,
      "text": "I wish I could give zero stars. this app sucks. it shows as “installed” on my iPhone but there is no way to open it. nothing transferred from my old phone; no contacts, no pictures, no apps, nothing at all. frustrating to say the least. having to manually transfer and install each of my contacts and apps on a phone upgrade that is in the thousands is not worried the time and effort.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 128,
      "criterias": []
    },
    {
      "id": "98235cac-00a5-4383-a9ea-8f1609ea4bb5",
      "userName": "A Google user",
      "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
      "date": "2019-09-21T05:14:52.799Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=98235cac-00a5-4383-a9ea-8f1609ea4bb5",
      "title": null,
      "text": "This never works. Ever tried it multiple times over the last year. I can't switch to your system because you can't even make an app that works. Just insane this still exists in play store and is still garbage after all this time. And the customer support people at Apple are equally worthless, they can only help like old people that need help turning on WiFi or something",
      "replyDate": null,
      "replyText": null,
      "version": "2.10.0",
      "thumbsUp": 33,
      "criterias": []
    },
    {
      "id": "720dbe7b-db01-474f-98c6-72bf4e1e2fb8",
      "userName": "Andru Franjelo",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWZi1vb1gtiJ0nhQHB5CnN2Ee4Z8yXoDG2Di5QOkoQUUVc",
      "date": "2022-07-30T15:39:49.802Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=720dbe7b-db01-474f-98c6-72bf4e1e2fb8",
      "title": null,
      "text": "As others have mentioned, will not transfer all messages. Tried 3 times it only transfers sent messages and not including all conversations. Pictures are out of order. Contact numbers were duplicated. Thought this might be from having duplicate contacts say in phone and SIM storage but confirmed Samsung phone only has contacts in one repository. Tried it also with data turned off. Kind of frustrating. Not sure how Apple is such a huge company and the app doesn't work right.",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 56,
      "criterias": []
    },
    {
      "id": "20db8ab4-4f2c-4bdf-b3a0-7672aa371a91",
      "userName": "Daniel Maine",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKQdJlSv7bnW2P1qqMxblW0VOvQmQG18qqkcq-S1bIq=mo",
      "date": "2022-04-03T23:21:00.749Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=20db8ab4-4f2c-4bdf-b3a0-7672aa371a91",
      "title": null,
      "text": "Dumpster fires provide warmth, this app is far less useful than that. Do you have spare time that you'd like to exchange for frustration? This app is for you. Do you have a need to have data move from Android to iOS? Keep looking, this app can't do that. Once you troubleshoot the VERY buggy connection successfully, you'll then learn that a \"successful\" transfer is neither successful nor a transfer. I hate you both Apple and Android. Absolutely awful app.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 34,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "9049045c-3f99-4e11-86f6-c77ae6594567",
      "userName": "Alex Lorberg",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJzdIwVcpXusNBIZxK_j4Yhuu6UJt6U8Czo63R3OYeP=mo",
      "date": "2022-05-15T11:02:10.902Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=9049045c-3f99-4e11-86f6-c77ae6594567",
      "title": null,
      "text": "The app failed multiple data copy attempts with no information on how to address whatever issue it was having. At some point it actually started copying data. The phone had about 10GB of data with transfer taking over 5 hours, then stopping at 1 minute remaining for the next 3 hours. In the end all it did is created 3 copies of all the contacts. I ended up purchasing a 29 dollar windows app, which completed the transfer in under 30 minutes over USB.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 66,
      "criterias": [
        {
          "criteria": "vaf_never_display_easy_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        }
      ]
    },
    {
      "id": "9e768155-36d6-41f7-bbc6-4155042c88d5",
      "userName": "Harry Guye",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXUVXSZp5xcuxDF9GAqQjA5q3LflNiglgRMJshvKjBHEg",
      "date": "2022-01-29T20:21:25.167Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=9e768155-36d6-41f7-bbc6-4155042c88d5",
      "title": null,
      "text": "Huge waste of time. Will not move anything large such as photos or files. Progress bar stops about 25% and connection times out. All you can do at this point is start over. I finally limited the data move to contacts and calandar and it took about 10 minutes to complete (1 minute if you belive the app). Now I have my contacts with each contact appearing four times in the list. I could have accomplished this faster msnually. You'd expect better from an overpriced iPhone product.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 76,
      "criterias": []
    },
    {
      "id": "c249443c-3b06-4d9c-a6f8-e28b3f840140",
      "userName": "Emily Munoz",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWx7HjH9mbwlZTnSSZU747jN1vQO_ZaAQZrTr1MPcvQ_J1p",
      "date": "2022-03-15T01:15:18.323Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=c249443c-3b06-4d9c-a6f8-e28b3f840140",
      "title": null,
      "text": "Thank you Apple, - for convincing me to stay with Samsung! It took 3hrs to load data, and it didn't even work! Once I finished duplicate contacts appeared, I wasn't signed into any of my emails, error messages kept showing up, and it called random contacts of mine. I was switching for your only valuable asset (imessage), but I've realized that the detriments of this switch outweigh the benefits. This was such a horrific let down.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 81,
      "criterias": []
    },
    {
      "id": "ff7a2c71-023c-4eda-a8df-29892756e6fc",
      "userName": "Noah Paez",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUFrNV1hKQd9X2SDKUAlefPTq6aOAL6rlNL_eHc5mHr1JY",
      "date": "2023-01-10T04:17:29.434Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=ff7a2c71-023c-4eda-a8df-29892756e6fc",
      "title": null,
      "text": "Terrible experience. Almost makes me regret switching to apple. Not everything I selected got transferred to my new device. Had to jump through several hoops just to get the transferring process to engage. Very disappointed to see how it didnt transfer my albums and just opted to cram all my media into one disorganized folder on my new device. It does the job, but not well.",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.2",
      "thumbsUp": 86,
      "criterias": []
    },
    {
      "id": "7def95d1-99a8-48ca-8649-8da60a6b5be2",
      "userName": "A Johnson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKw0yKamd74kgFh9gJ0FJWjBJtULtsCblxi7juawK-yDMc=mo",
      "date": "2022-02-25T14:03:38.800Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=7def95d1-99a8-48ca-8649-8da60a6b5be2",
      "title": null,
      "text": "In the interest of saving time, unlike this app, i'll give end result 1st. YES IT WORKS. is it efficient? no. is it convenient? no. is it fast? no. is it awful? yes. 3 days, 5 resets and 15 total hours later i was able to transfer my messages after i'd deleted half of them. I did not transfer anything but my messages bc this app is horrible. use any any other app to transfer contacts, photos, history, etc... literally ANY OTHER APP. ultimately it did work. after many errors and hours.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 18,
      "criterias": [
        {
          "criteria": "vaf_never_display_visually_bad",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 2
        }
      ]
    },
    {
      "id": "a20afd98-9539-4ae4-9d53-39e1e73104b2",
      "userName": "Corgi",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWhZ5kbng7vuF5sKdBG0LR1vjabqpXKiNK9Q9IT64ymD-6M",
      "date": "2022-07-05T13:17:06.426Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a20afd98-9539-4ae4-9d53-39e1e73104b2",
      "title": null,
      "text": "Horrible, unintuitive, misfunctioning. Does not work at all, user experience is awful. Tried to use my old iPhone 6 because my Pixel stopped charging, couldn't transfer a thing. A waste of time. I'd rather have a phone that can barely charge then try to use this horrible app. Why can we no longer transfer things via hard cable??? What was so wrong with that????????",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 80,
      "criterias": [
        {
          "criteria": "vaf_never_display_difficult_to_use",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_app_description",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_positive_impact",
          "rating": 2
        }
      ]
    },
    {
      "id": "5d0e8006-a1e3-46f3-91d2-be1f6546232b",
      "userName": "C Squared",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXiTHKanI1X1YoIP_ru9-y7EdR15KFgTwKHpA_ipJzOSJut",
      "date": "2022-05-27T23:56:02.280Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=5d0e8006-a1e3-46f3-91d2-be1f6546232b",
      "title": null,
      "text": "Tried for hours, it didn't work. I kept getting the error that the transfer couldn't be completed. The load times are insanely long, and the transfer feature seems to get disrupted for arguably no reason. I tried to troubleshoot using elaborate guides online and nothing helped. This app is a joke, it's honestly appalling that they don't have a wired transfer option. There is absolutely no other way to convert your data over using Apple sanctioned software besides this app, and it doesn't work.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 16,
      "criterias": []
    },
    {
      "id": "ec01dbde-925b-4408-a46b-f46c5ef57ad0",
      "userName": "Scarlett Cross",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVRreoIq5hyQVUj7Vv-hkynQDZYfAeHNMDc1LwKA28IwA",
      "date": "2022-05-08T04:53:00.487Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=ec01dbde-925b-4408-a46b-f46c5ef57ad0",
      "title": null,
      "text": "Who the heck designed this thing??? Very poorly thought-out app. Terrible because it does not work!! I have been fiddling with this this for the last 24 hours almost to no avail, trying to copy over my information from my current Android Galaxy S9 to the new iPhone 13. What the heck is this??? This app will suddenly drop in connection at any given time when you are trying to convert your files over. Then you have to start all over again and it has made NO progress. Seriously flawed app.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 52,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "96bae15b-1bd6-4db5-a31c-9d31479a0cab",
      "userName": "Veer D",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUKOuG4zyQW52yCE_5HccEyoeBsG93xm9N-C7jAQURTbA",
      "date": "2022-07-23T17:45:37.820Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=96bae15b-1bd6-4db5-a31c-9d31479a0cab",
      "title": null,
      "text": "I'd recommend not moving to iOS based on the headache of moving data between ecosystems. Stay on Android if you care about any of your history. Move to iOS if you want a fresh start with a new phone. SMS messages did not transfer over correctly, NO pattern for why some messages are missed and others make it through. WhatsApp transfer seemed to work, but took a very long time. Only slightly better time estimates than old windows estimates!",
      "replyDate": null,
      "replyText": null,
      "version": "3.3.1",
      "thumbsUp": 44,
      "criterias": []
    },
    {
      "id": "d41e717f-cad2-43a4-82a0-51863230621a",
      "userName": "Cassandra Gold",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJWPTqahhDNcWKiaPDxZtYNT-6PTTD0jkdW0Rxni-s=mo",
      "date": "2021-11-18T07:01:29.430Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=d41e717f-cad2-43a4-82a0-51863230621a",
      "title": null,
      "text": "It does NOT WORK!!!! This app is absolutely a waste of time and energy to get all of your stuff moved from Android to iPhone and I don't know if it's Android just making it miserable to switch or apple being lazy, but neither are leaving good feelings about themselves for me. I'm trying to get away from theess called Android 12, but trying to switch to iPhone is making me think twice with this horrendous failure of an app. Constant crashes, no data transferred and a complete waste of my time.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.2",
      "thumbsUp": 15,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "b1358b67-56cb-4362-98ab-508f9b6e4510",
      "userName": "Janelle Bond",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI6YnlgdsqPGLBjKxNa-l9AsW19kMssq1wMfPayU_xn=mo",
      "date": "2022-10-16T22:51:06.995Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=b1358b67-56cb-4362-98ab-508f9b6e4510",
      "title": null,
      "text": "Complete Trash. This app fails spectacularly. It moves only some messages, and the ones it does move are out of order or mixed up. After a trip to the apple store and a call with Lvl 2 support the response from Apple was 'try it again and hope it works, best we can suggest'. It moved all the pictures, but forgot to move the dates on some of them -- so pictures from a few years ago show up as taken today. Went with a 3rd party app instead and had to pay out the nose for it to work",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.1",
      "thumbsUp": 198,
      "criterias": []
    },
    {
      "id": "db2674ff-de61-432a-951b-a894f8bfa2c4",
      "userName": "C Kirk1971",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKjJ5TtYmbxFVaDs3jy-z24rhTrwLGMCeQsgJo-Ik0Q=mo",
      "date": "2022-01-10T14:53:10.636Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=db2674ff-de61-432a-951b-a894f8bfa2c4",
      "title": null,
      "text": "Horrible app, started to use it at noon one day. It continues to disconnect, after multiple tries and 7 hours I went into my iPhone. I dropped some of my contacts and multiplied the others. It still never finished always getting stuck. I may have some blame because the first try seemed like it was working ok but then I had a battery die with20 mins left. So it's possible that having to restart started a chain reaction of just nonsense. , make sure both phones are charged!",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 43,
      "criterias": []
    },
    {
      "id": "c1e62a56-d552-457e-9131-37e0d79fdda2",
      "userName": "Zaid Shoorbajee",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLyzenNJgalNokj2GY9uBOqYCbKnVOIm9SkEYN3q0Dfqeg=mo",
      "date": "2022-03-17T03:06:00.923Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=c1e62a56-d552-457e-9131-37e0d79fdda2",
      "title": null,
      "text": "This app DOES work but you have to do it in a very particular way, and it will not tell you if you're doing something wrong until the very end. I tried and failed several times to transfer JUST my messages. Each time took about 2 hours and it ultimately just gave me an error message. But like I said, there IS a way to make it work. Here's the key: The Android app HAS to connect to an artificial Wi-Fi network broadcast by the iPhone. The problem is 9/10 times, the app won't tell you to do that. You need to make your Android phone forget ALL your local Wi-Fi networks before beginning the process. Just putting it on airplane mode won't work. You should also disable your mobile internet connection. Honestly I just took the SIM out just to be safe. ONLY if your Android connects to the iPhone's fake Wi-Fi network will this process work. I learned this from a post on Apple's website by another frustrated user. You can search for \"Move To iOS app transfer error solutions\" to find the post on Apple's website -- it was quite helpful, so thank you to that user. Pretty ridiculous that that clearest instructions for using this app came from a user and not Apple itself.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.5",
      "thumbsUp": 81,
      "criterias": []
    },
    {
      "id": "3f7679a5-93dd-4aa1-8977-52d24b0ef202",
      "userName": "Jake Lauer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUkr9J_KW_eQwjnG0SlnkClSQObkgR4Ak_A0SrP4J-YKmA",
      "date": "2022-03-22T15:44:08.182Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=3f7679a5-93dd-4aa1-8977-52d24b0ef202",
      "title": null,
      "text": "After multiple attempts of getting stuck at 1 minute remaining, i have found that some of my data transferred but in a very chaotic fashion. I have about 4,000 pictures on my phone that span over many years. On the iphone, they are completely jumbled. That is just unacceptable. Out of all my texts, only a handful transferred and in most cases, the texts i had sent and any texted pictures were gone. Just a complete mess.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.6",
      "thumbsUp": 86,
      "criterias": []
    },
    {
      "id": "7abc557e-490b-49b3-a537-24916f1df23d",
      "userName": "Ken Cominsky",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJuYPHsk36A1Ey9F9yVj-7-mBnjwTqtFZAZdJI-vZP8=mo",
      "date": "2021-07-14T00:06:19.203Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=7abc557e-490b-49b3-a537-24916f1df23d",
      "title": null,
      "text": "Not sure why this app got so many negative reviews since it worked perfectly for me. I'm moving to iPhone for a while because I'm tired of buying Android phones full of bloatware that are only supported for a year or two. With all the negative reviews of this app I was expecting the worst. But it worked great transferring everything except pictures on the SD card (backed-up to Google account) from my Bold N1 with Android 10 (talk about off-brand!) to a new iPhone 11. I turned on wireless (5G) and Bluetooth (not sure if this was necessary). It took about 30 minutes and everything looked good on the new phone. So, again, scratching my head over why so many people with \"mainstream\" Android phones had so many problems.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 13,
      "criterias": []
    },
    {
      "id": "cd5417ef-ebb2-4be0-ba7e-19d26237750a",
      "userName": "Gabe Lazar",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVoQHAEiClrMdHUeYWhJRjvKyaoFqRrfAei5Xk-7WOnuHMT",
      "date": "2022-06-13T03:24:24.544Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=cd5417ef-ebb2-4be0-ba7e-19d26237750a",
      "title": null,
      "text": "Trying to move from a Galaxy S10+ to an IPhone 13 Pro. At ~20min of \"Transferring\" I keep getting an error code. At first I was trying to transfer everything including about 30gb of additional files (pics, docs, sound files). Didn't work so I just choose the 5 default options on the main screen. Still didn't work so I limited it to only contacts and pictures... STILL DIDN'T WORK! I've looked up all the recommended troubleshooting stuff I can find online from Apple and elsewhere. PLEASE HELP!!!",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 12,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "6aaae829-0a3b-4a97-859e-d039a9c30f51",
      "userName": "Bryant Johnson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWzgE4XHfzgdld5aGzdP0yA7QKYWzB8lXB5ZlpjIAkhR8k",
      "date": "2021-01-31T21:41:52.565Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=6aaae829-0a3b-4a97-859e-d039a9c30f51",
      "title": null,
      "text": "Overall, the app worked well for me. I read a tip from another poster about putting the phone in airplane mode, and then turning on the wi-fi to prevent the interruption. I did that and it worked -took about 2 hours. I only transferred the messages and photos and Google ID. My contacts are in the Google cloud. Here's a tip about the photos. I had about 60 or so albums and the app transferred them all into the \"Recents\" section of the photos app. Transferring the photos via iTunes will copy them to your new phone and they remain in their respective albums. My albums were on my SD card and I copied them all over into a master photos folder on my PC, and then listed the same master photo as the location for syncing via iTunes. It took about 30 minutes to copy the photos over. I also have a cloud backup of my photos, but like having copies on my phone in case of a poor internet connection.",
      "replyDate": null,
      "replyText": null,
      "version": "3.1.1",
      "thumbsUp": 457,
      "criterias": []
    },
    {
      "id": "d2d0b735-4095-4f1a-b58f-bc0fc03037f3",
      "userName": "Jacob Rumpf",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWjKvSBwLwlb4c67m6rd8Ph6Qw5es2ImG54xU0AqMmw9x5h",
      "date": "2022-01-16T04:38:07.137Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=d2d0b735-4095-4f1a-b58f-bc0fc03037f3",
      "title": null,
      "text": "TEXT MESSAGE TRANSFER DOES NOT WORK. On top of that, you can only do the transfer during initial iPhone setup, and it just loads forever if you try to transfer text messages. There are alternative desktop programs to do this that allegedly work, but they cost $45 on Mac for something that this app is supposed to do for free. To add insult to injury, they're only $30 on Windows. I need to transfer to my new phone so I can't wait for an update and will have to pay $45. Worst start of a new phone.",
      "replyDate": null,
      "replyText": null,
      "version": "3.2.4",
      "thumbsUp": 80,
      "criterias": []
    },
    {
      "id": "a39e0a11-86c2-4187-9442-b266adbb3a32",
      "userName": "Nathan Cohen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUyrN8xl_TkEkKYja8r_9Qmh45N6pX2X5fEVRahvJpuCg",
      "date": "2023-02-13T03:50:33.824Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=a39e0a11-86c2-4187-9442-b266adbb3a32",
      "title": null,
      "text": "The Move to iOS app is very great! It can say 16 minutes but it can take way longer it took me about 30~40 minutes. Great tip is: Grab your phones leave then plugged in very close to each other and close to the internet modem. You will be all set. WhatsApp transfer is great, transfers messages/videos/photo. If you use stickers I recommend to create a group to storage all of them, then save them on your new iphone. This is a great FREE way to transfer rather than other PAID options!",
      "replyDate": null,
      "replyText": null,
      "version": "3.4.2",
      "thumbsUp": 67,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        }
      ]
    },
    {
      "id": "5d712787-f6d5-4bc2-a1ae-016419f46e02",
      "userName": "Giovanni Santos",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWhme-BHBH34jvUrxEwM938hGHBsUhIPbMM8qH1Phh-N4E",
      "date": "2022-04-16T03:55:10.634Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.apple.movetoios&reviewId=5d712787-f6d5-4bc2-a1ae-016419f46e02",
      "title": null,
      "text": "Awful. It's so slow, buggy and it doesn't even work. I'm trying to just transfer messages (not even that much messages, just 40mb) and it literally has been 5 hours and now it's just stuck at 1 minute left for the past hour. This is the first thing people use when switching from Android to iOS and it sure is a turn off when it doesn't even work. And it seems like apple is in no rush to fix it as it's had awful reviews for a long time. Shame on you apple.",
      "replyDate": null,
      "replyText": null,
      "version": null,
      "thumbsUp": 10,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CmwKagpoMCwxMDAxMDAwLjQyMzc2ODY2OTQsOTQ1MTc0MjA0NjYsImh0dHA6Ly9tYXJrZXQuYW5kcm9pZC5jb20vZGV0YWlscz9pZD12Mjpjb20uYXBwbGUubW92ZXRvaW9zOjEiLDEsZmFsc2U"
}