{
  "data": [
    {
      "id": "cb27042f-02d3-4c23-bd1d-dd0266e6f5d0",
      "userName": "Nicole Hansen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXjxuUz0ce89uuFi4a6kHjddJpN_rrZtb73EGK94FMNkUqH",
      "date": "2024-02-19T08:50:51.185Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=cb27042f-02d3-4c23-bd1d-dd0266e6f5d0",
      "title": null,
      "text": "The fact that there is not a way to download digital purchases from the app is absolutely ridiculous. The app interface is okay, though there are plenty of rough spots. Finding a full list of things you've saved can be tricky and annoying. Navigating through a sellers catalog is also tedious, but it could be worse. Esthetically, the app is lovely. I just wish it were backed up by better functionality.",
      "replyDate": "2024-02-19T15:36:58.342Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport for any concern. Rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.60.0",
      "thumbsUp": 136,
      "criterias": []
    },
    {
      "id": "6abe2637-1b7b-4a96-b1cf-b759b4d8dab2",
      "userName": "Caterina B.",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV5ix6nSQINCb-Dhan9D0QsnFIBpaIXcFUnqALJhCiKCGI",
      "date": "2024-03-11T01:04:43.467Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=6abe2637-1b7b-4a96-b1cf-b759b4d8dab2",
      "title": null,
      "text": "I used to love this app, but now it won't even let me log in on the phone app or on my computer. I just keep getting an error message stating \"too many requests\". I've cleared the cache and storage in the app, I've restarted my phone, and even uninstalled and reinstalled the app, but it still doesn't work. It's very frustrating!",
      "replyDate": "2024-03-11T19:01:18.388Z",
      "replyText": "Thanks for your feedback! We’re sorry to hear about your experience. We would appreciate it if you could contact us using this link: etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you, and stay safe!\n",
      "version": "6.63.0",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "68b691aa-6c9a-466e-a1b7-1f87dbcf1a68",
      "userName": "Dade Robison",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU0epm8NDQz32tgk_w-7GKE7KE8uUEBl-PeCrRzdcXCDw",
      "date": "2024-02-25T21:19:35.532Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=68b691aa-6c9a-466e-a1b7-1f87dbcf1a68",
      "title": null,
      "text": "You know very well there isn't a method to contact support for app issues on your site. This isn't about my account, this is about the way your app is developed. There are certain push notifications I do and don't want, but I don't have the option to choose - trying to toggle any one type of notification takes you to Android OS' notification settings for the app, forcing you into an all or nothing agreement. Either you accept their ads and annoying useless messages, or you get no updates at all.",
      "replyDate": "2024-02-08T17:38:54.800Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the notification. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.61.0",
      "thumbsUp": 156,
      "criterias": []
    },
    {
      "id": "10594528-c62c-46a0-9fff-1c3b0b8ca1f0",
      "userName": "Jacob Smithmyer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXTixlrG6OVDCIrJ_NFmzU2_lwOMHdVCIC6x12g2YhKtFk",
      "date": "2024-02-05T02:35:37.897Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=10594528-c62c-46a0-9fff-1c3b0b8ca1f0",
      "title": null,
      "text": "Trustworthy company with many protections for the consumer. I am never worried about purchasing from Etsy, and I think it is a great way to support small businesses from all across the world! However, the recent updates to the mobile update makes it confusing to navigate. I preferred when there was a separate tab for my favorites, and it just showed me my lists instead of a continuous \"there's only one left of this item!\" I think a whole tab just for gift cards is wholly unnecessary.",
      "replyDate": "2024-01-13T18:31:11.352Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.58.1",
      "thumbsUp": 349,
      "criterias": []
    },
    {
      "id": "773195f0-3dab-4fd5-a8f1-c0db0e91343a",
      "userName": "Reebs",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVgbN3IBgquyqTvXxwx2aAn_ZmDfAGMn6sw3NPOtJ7nhjI",
      "date": "2024-01-11T22:06:32.890Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=773195f0-3dab-4fd5-a8f1-c0db0e91343a",
      "title": null,
      "text": "I used to love shopping on Etsy. Browsing for hours through all of the wonderful goodies. But the app and site have become so messy that it's too overwhelming to use. They have made literally everything a big image which is overstimulating and nowhere is there a place to change the view to a simple list or even smaller images. There's way too much going on and to contact them it's pretty impossible. I won't be using Etsy anymore until they clean it up.",
      "replyDate": "2024-01-12T16:24:29.673Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further, rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.55.0",
      "thumbsUp": 265,
      "criterias": []
    },
    {
      "id": "76f78274-0055-40ef-ae03-7b4a8be87580",
      "userName": "Debra Babineaux",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWkbQw_lqaBiWIH7xZGvA3IQfsC2Y313JkAE0DG2iszOo4I",
      "date": "2024-01-28T20:51:26.720Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=76f78274-0055-40ef-ae03-7b4a8be87580",
      "title": null,
      "text": "edit: there's now this new \"gift mode\" tab. you have to go into the \"you\" tab to get to your favorites and lists. can there just be a better search engine? the search has gotten awful. this is new; if i'm listening to audio through my phone and browsing the Etsy app, Etsy will pause what i'm listening to to auto-play video clips in the app. why? it does this even on item listings that don't have audio. please turn this off. i dont see a setting for this on my end at all.",
      "replyDate": "2019-06-07T19:51:02.413Z",
      "replyText": "Thanks so much for taking the time to share your feedback. We’re noting your feedback and will be sharing it with the team to consider for future updates. For legal reasons, I have to point out that any ideas members share with us are non-proprietary to them. You can read more in our Terms of Use: https://www.etsy.com/legal/terms-of-use",
      "version": "6.57.0",
      "thumbsUp": 40,
      "criterias": [
        {
          "criteria": "vaf_never_display_inappropriate_ads",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_tracking_orders",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_meet_expectations",
          "rating": 3
        }
      ]
    },
    {
      "id": "6c6e0c10-a8d7-4a27-91f1-18c805dc7873",
      "userName": "Marianne T Sites",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWeZe3lUswV7zmiBYr36MjFPZj69yTwhzVco-_sUUgmzQ",
      "date": "2024-01-08T05:56:41.787Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=6c6e0c10-a8d7-4a27-91f1-18c805dc7873",
      "title": null,
      "text": "Etsy was easy to use. Not now. The shopping cart's dysfunctional. I've bought a lot in the past. I'm impeded from purchasing much now, as I can't review my shopping cart--it won't display what's in there w/o messing with me. Tho I deleted about 80 items,it still says I have 84 items in there. I've closed &reopened the app 2X, yet it still shows the wrong count, which means I can't add what I wanted to; &why are there 6-7 duplicates?! As I scroll, it repeats PARTS, never getting to the REST! UGH.",
      "replyDate": "2024-01-11T18:44:21.341Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.54.0",
      "thumbsUp": 83,
      "criterias": []
    },
    {
      "id": "7c5b9619-a611-4ed9-be3b-ea0ab6ca7402",
      "userName": "Elisabeth Hidalgo-Sawyer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWJJ7y01ZdIGugxksA3YWHpn9olX7s1onFZtS39FjHUUg",
      "date": "2024-02-17T21:14:00.269Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=7c5b9619-a611-4ed9-be3b-ea0ab6ca7402",
      "title": null,
      "text": "This app features a lot of creators and is great for finding hand-made or unique items. However, the app quotes you delivery times that aren't accurate to the location of the seller, which is exasperated for international shipping. There's also a notification issue where it keeps notifying you daily that you have (no exaggeration) dozens of new messages, but when you open the app, there are none. The items, shops, and sellers are great; but the actual functionality of the app really needs work.",
      "replyDate": "2024-02-19T17:09:56.643Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport for any concern. Rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.60.0",
      "thumbsUp": 178,
      "criterias": []
    },
    {
      "id": "53fec387-d99b-4765-b5e9-36d1c26143ed",
      "userName": "Christopher B",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIW3XVPXIgANy9vwkDoaH-ZvWrjCB9tGHdTl-pHnLCmAg=mo",
      "date": "2024-02-05T16:52:42.834Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=53fec387-d99b-4765-b5e9-36d1c26143ed",
      "title": null,
      "text": "This used to be the easiest and best app I've ever used. Then they decided to create a new app which doesn't work half the time, fails to upload pictures, and creating a listing is a pain. You have to click extra buttons now to move pics, edit listings, and adjust variations. Half the features are even completed yet or work, and it's so not user friendly anymore. Please go back to the old app.",
      "replyDate": "2024-02-05T17:21:30.689Z",
      "replyText": "Thank you for taking the time to leave a review! We’re sorry to hear of the trouble you've had using the app. Please contact us using this link: etsy.me/contactsupport and provide specific issues so we can check on them further. Rest assured that we'll assist you right away! Thank you, and stay safe!\n",
      "version": "6.58.1",
      "thumbsUp": 73,
      "criterias": []
    },
    {
      "id": "7ead6364-3656-40f6-9663-b05bc527746c",
      "userName": "Andie",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVg1SRexO8mxuduLUCdcnx0hAlnrvmvKCZ2cTaqSpfpQB7w",
      "date": "2024-01-23T22:04:30.300Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=7ead6364-3656-40f6-9663-b05bc527746c",
      "title": null,
      "text": "UPDATE(1/23/24): This change has been made and I love it! (9/29/18): This app is really great!! The only change I'd like to see is that when adding an item to a list, it appears the lists are in order of creation (maybe first created list at the bottom and most recent at the top), but I'd rather have the list that's been most recently added to at the top (rearranged in order by frequency of use or amount of time since adding), or have the option to just manually arrange them in a desired order",
      "replyDate": "2024-01-23T21:49:08.910Z",
      "replyText": "Hi! Thank you so much for your review! We're always hard at work in making improvements towards the app. Your review and feedbacks will only help us improve further. Stay tuned for further updates to the app! You may reach us out here: (etsy.me/contactsupport) for further concerns.",
      "version": "6.56.0",
      "thumbsUp": 50,
      "criterias": [
        {
          "criteria": "vaf_never_display_deceptive_ads",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_tracking_orders",
          "rating": 1
        },
        {
          "criteria": "vaf_never_display_considerate_of_time",
          "rating": 1
        }
      ]
    },
    {
      "id": "6d7f4d6c-2a11-4bf7-bff8-1831b55b32aa",
      "userName": "Dave Ubermensch",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLU-xT7Hx9kSo5z2-92QKq-sHfo3Zx94TCifpH4C9Kp=mo",
      "date": "2024-01-23T02:37:06.905Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=6d7f4d6c-2a11-4bf7-bff8-1831b55b32aa",
      "title": null,
      "text": "App works ok. Search is ok, but could be more accurate. The biggest problem is for several months now the app gives a notification 2 or 3 times a day that there's a new item in my favorite store. I check. It shows sold items from 22 weeks ago that I've seen tons of times. Most of the time when I click thru to the store, there's no new items at all.",
      "replyDate": "2024-01-23T17:58:20.434Z",
      "replyText": "Thank you for your kind feedback. We are aware of this problem and are currently working on solving it. Please update your app to the latest version when you see an option.",
      "version": "6.56.0",
      "thumbsUp": 25,
      "criterias": []
    },
    {
      "id": "ea380edf-782b-4188-ac3b-b7efee3bfd35",
      "userName": "Nina Marcellus",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVkJ4FYupVliMqMv14AvEs4OqZy1w2cZwmHhTZvhlFmXh-v",
      "date": "2024-01-13T22:57:24.543Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=ea380edf-782b-4188-ac3b-b7efee3bfd35",
      "title": null,
      "text": "I've come back to change my rating down to 2 stars - they added auto-playing video previews for products that, even when silent, turn off anything I'm listening to. So instead of scrolling through Etsy and buying stuff while listening to podcasts, I'm getting frustrated and closing the app and doing something else with my podcasts. This has been pretty frustrating, so I hope they can change it soon.",
      "replyDate": "2024-01-14T19:24:08.497Z",
      "replyText": "Thanks for your feedback! We would appreciate it if you could contact us using this link: etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you, and stay safe!",
      "version": "6.55.0",
      "thumbsUp": 134,
      "criterias": []
    },
    {
      "id": "97e086aa-f330-4a06-94f5-764908e5bf72",
      "userName": "Brenna",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUm1lvXD0yiQrElvlX9RCR_3x2bD0nQHXVXOrKtuJvuE6eu",
      "date": "2024-01-28T18:16:58.305Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=97e086aa-f330-4a06-94f5-764908e5bf72",
      "title": null,
      "text": "Overall, I have had positive experiences shopping on the app. The only reason I'm taking off a star is because of a really annoying issue that I keep experiencing while scrolling through a shop's items. Every few seconds as I am scrolling vertically through the items, it will think I am swiping right, which brings me to the shop's \"reviews\" tab. It takes a second for me to divert back, but when it does it like 20 times/min, it is ANNOYING. PLEASE make it less sensitive!",
      "replyDate": "2024-01-30T18:01:39.531Z",
      "replyText": "Hey, thanks for writing a review. Sometimes, the app may be slow but such instances are rare. If it happens too often, please let us know at https://rb.gy/pucp3f. We'll have things investigated.",
      "version": "6.57.0",
      "thumbsUp": 94,
      "criterias": []
    },
    {
      "id": "67e5827b-66af-4ea8-a403-efa2a4740922",
      "userName": "Bobbi Taylor",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV8tcxgjldGwRYdKi5KcgkAxTThTUmYghPzsyH9eWBgcA",
      "date": "2024-02-01T21:06:58.932Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=67e5827b-66af-4ea8-a403-efa2a4740922",
      "title": null,
      "text": "Etsy has changed where you can access your favorites and now it's so hard to navigate to. It used to be on the bottom bar which was great and easily accessible. Instead, it's hidden in your profile and even after opening the Favorites section, it defaults to showing you ads for stuff similar to your favorites? It just feels like the latest few updates have turned Etsy into an ad centric app you have to shift through in order to find the items you're searching for.",
      "replyDate": "2024-02-02T18:00:10.432Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.57.0",
      "thumbsUp": 169,
      "criterias": []
    },
    {
      "id": "035837de-af1b-4489-85a8-d8a159bbc19a",
      "userName": "Anna Leslie",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWkGPbz7M5-Y7WilubWqr-f5QSAi6ZOveNNTwCUNaDdom8",
      "date": "2024-02-16T07:45:39.423Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=035837de-af1b-4489-85a8-d8a159bbc19a",
      "title": null,
      "text": "Frankly, this app sucks. I've been using Etsy for over ten years, so this review is not for the company itself but the app specifically. It frequently crashes saying \"Oops, something went wrong!\" or it says something about not being connected to the internet, even when I am. They also do a lot of useless updates that don't actually enhance or improve the user experience, such as moving where favs are or how they are displayed. I end up switching to my browser more often than not these days",
      "replyDate": "2024-02-16T18:43:45.100Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some crash issues. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.60.0",
      "thumbsUp": 38,
      "criterias": []
    },
    {
      "id": "f78bcbc8-e4d7-404b-b02a-2f25ebc83ba5",
      "userName": "Rajesh Ramsaroop",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXtXgPAHvAKZPVWzImkcOV4gS7nniFFGSZKyFiTCZKCLwdh",
      "date": "2024-02-01T12:21:28.863Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=f78bcbc8-e4d7-404b-b02a-2f25ebc83ba5",
      "title": null,
      "text": "For the most part the app works well but there's so many notifications it's insane! Every day the app seems to want to remind you to exists with both regular and silent notifications! It's so annoying! It also keeps saying I have 3 notifications as I had 3 purchases I had to review... Upon reviewing them, the bubble in the bottom navigation bar still didn't go away.",
      "replyDate": "2024-02-03T18:51:56.915Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some notification issues. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.57.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "a69878ef-a7f1-4636-a631-765ce56acde7",
      "userName": "Tim Pelfrey",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLCPlHMwDzGD98RhSr4nKm7H_rQvNVGZvvHyR5nm0GO=mo",
      "date": "2024-02-13T02:05:42.309Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=a69878ef-a7f1-4636-a631-765ce56acde7",
      "title": null,
      "text": "Great place for unique gifts and to see lots of creative works. Easy to use, just a couple, little twitches while shopping otherwise it'd be perfect. As an update, got an email saying to share my exp. so they might be able to look into it.I do so and the response was that they dont monitor the box, so talk to the help center. They respond with an answering machine message to look nice. Why would I go thru the \"call tree\" ( bot or not that's what it is) to bring their problems to their attention?",
      "replyDate": "2024-02-11T15:32:13.618Z",
      "replyText": "Thank you for taking the time to leave a review and for choosing Etsy as your shopping platform. Please reach out to us at https://help.etsy.com/hc/en-us/articles/115013375488, if you have other suggestions or concerns. Thank you, and be safe!\n",
      "version": "6.59.0",
      "thumbsUp": 72,
      "criterias": []
    },
    {
      "id": "10537e50-8472-4c0e-8f27-090e9d01dcda",
      "userName": "Sam U",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVvMEIi2bMAMvx5O7ye0CcC7JM2ng6e0MtHB57qXVlr-Is",
      "date": "2024-03-01T10:00:27.199Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=10537e50-8472-4c0e-8f27-090e9d01dcda",
      "title": null,
      "text": "My previous issue was resolved more or less. I don't like the change to the location of the favorite lists or this prominent gift selector option. You can't copy your order number from within a receipt through the app. You don't get notifications through the app when a store is back from vacation, only email. We should have ability to ignore Etsy product recommendations to help algorithm. It'd be nice to stop seeing product recommendations from a shop I had issues with and don't want to support",
      "replyDate": "2023-11-24T20:14:05.214Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.62.0",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "c2c47f44-15a0-4d76-a592-c55d8f25f374",
      "userName": "Christina McAllister",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLmKXnQEOQHrFCBfVDBPxkYbcQUzt3xR1P3s2PGO2or=mo",
      "date": "2024-01-07T17:28:12.640Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=c2c47f44-15a0-4d76-a592-c55d8f25f374",
      "title": null,
      "text": "I've been using Etsy for years, and have never had any problems until now. My previous review was 5 stars, and I'll return it to 5 stars, once this problem has been resolved. Nine days, before Christmas, I ordered a customizable digital download that was supposed to be ready to preview within 24 hours. 3 weeks later, I've received nothing from the seller, except for a promise that they're working on it. I haven't been able to find the \"open a case\" option that I keep reading about. I'm pissed.",
      "replyDate": "2024-01-09T20:10:49.545Z",
      "replyText": "Thank you for reaching out and we’re sorry to hear you didn’t receive your order. We invite you to contact us here: etsy.me/contactsupport with your account details, order number and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.54.0",
      "thumbsUp": 58,
      "criterias": []
    },
    {
      "id": "11bda2f8-9824-45df-94cd-7b3640918379",
      "userName": "Zia Hankins",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW70HzH-1WVdqISIdephbzhOtMXMzdx8Piww8peBKlIwQ",
      "date": "2024-03-01T15:29:16.232Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=11bda2f8-9824-45df-94cd-7b3640918379",
      "title": null,
      "text": "I absolutely love Etsy! I definitely recommend it for anyone interesting in buying from small businesses, or personalized items. Although, the reason I gave a 4 is because there aren't much options regarding reviews, like if I wish to edit my review I can't. If I wish to delete my review, I can't. So, that is the only thing, but aside from that I love it!",
      "replyDate": "2024-03-12T19:34:09.447Z",
      "replyText": "We appreciate your feedback! If there is anything we can help you with please reach out to us at https://help.etsy.com/hc/en-us/articles/115013375488.",
      "version": "6.62.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "522a4034-ab73-4318-a0be-80a74adb2511",
      "userName": "Drew R.",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXHCBg4WMmHw16c11BE8sVcIaCBnGSEI5Y1-MebaSHpeYqa",
      "date": "2024-02-04T01:26:55.957Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=522a4034-ab73-4318-a0be-80a74adb2511",
      "title": null,
      "text": "this app is becoming more annoying and convoluted with each update... the favorites tab used to be one of the main icons across the bottom, now you have to search for it... instead it's been replaced with \"deals\" and \"gift mode\" which i don't use, and to find my favorites i have to click \"you\" then \"favorites\" and even then i can't see the items at first! under favorites it opens to \"updates\" so you have to switch to \"items\" before you can see what you've favorited... so weird and unnecessary",
      "replyDate": "2023-09-04T17:24:08.669Z",
      "replyText": "Thank you for your valuable feedback. We’re very sorry to hear about your experience. We appreciate these comments from the Etsy community, as we collect insights for future adjustments. Kindly let us know what updates or changes you would like to see in our app. Stay safe!",
      "version": "6.58.1",
      "thumbsUp": 111,
      "criterias": [
        {
          "criteria": "vaf_phase1_tracking_orders",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_spend_more_time",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_same_day_delivery",
          "rating": 2
        }
      ]
    },
    {
      "id": "223af3ea-197d-4929-a0a3-9b41333ddafb",
      "userName": "Arleenah",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjULNLsnFox6uxExI-zNCs592R__dOKIeUXPIJ5rHGeMig",
      "date": "2024-03-15T04:56:10.430Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=223af3ea-197d-4929-a0a3-9b41333ddafb",
      "title": null,
      "text": "I used to open the app all the time to see what new items my favorite shops have listed but now the app doesn't have that section anymore. I'm annoyed that I have to go to individual stores just to browse newly listed items. This app is quickly becoming too cumbersome to navigate and I can never find the niche craft items I'm looking for using the search function so I have to resort to googling it. So backwards that I have to go outside of the app to find the etsy listings I actually want.",
      "replyDate": "2024-03-17T17:37:42.110Z",
      "replyText": "Thanks for your feedback! We’re sorry to hear about your experience. We would appreciate it if you could contact us using this link: etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you, and stay safe!\n",
      "version": "6.64.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "5cad9cdf-5436-495b-b408-d39fcb8a78bc",
      "userName": "Dana",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUMb3V7CoQhK4E-K8y8cVx4PXnzY_gE3iEOtuuTfDSUhmw",
      "date": "2024-01-27T11:12:03.181Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=5cad9cdf-5436-495b-b408-d39fcb8a78bc",
      "title": null,
      "text": "I have been shopping for scrapbooking items quite a bit lately and my search results in the app and on Google are flooded by people on Etsy selling their digital downloads. When I search for washi tape that's what I'm looking for. I'm not interested in digital downloads to make it myself. This has actually made finding what I'm looking for extremely difficult! I have managed to find some great websites because of all the digging around I have had to do that offer much better prices.",
      "replyDate": "2024-01-27T17:42:01.963Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.57.0",
      "thumbsUp": 22,
      "criterias": []
    },
    {
      "id": "cb95232d-146d-4410-984b-5fe644c4874e",
      "userName": "Jay Pena",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXkFiPqzgvclwKFOjPefFGqZUnB2zThv_JvjYchu21epcI",
      "date": "2024-02-20T15:12:04.725Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=cb95232d-146d-4410-984b-5fe644c4874e",
      "title": null,
      "text": "Etsy seems more like an overpriced flea market than a galleria. Not much handcrafted items like there used to be. Tons of cheap junk from Aliexpress being sold on there. Lot of fake scammer accounts on there, so buyer beware. The app is a little buggy. Search function works great but you really have to filter out tons of junk on there. I keep getting notifications that the seller I bought from sent me a coupon code but everytime I tap the notification it takes me to an empty inbox.",
      "replyDate": "2024-02-25T18:09:39.490Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport for any concern. Rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.60.0",
      "thumbsUp": 12,
      "criterias": []
    },
    {
      "id": "23525442-3806-42dd-a743-72b59fff0eda",
      "userName": "Jared Stander",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVqVd1QFkis8ZYLys-RA20GYCVrNLTGeh4Ly82MEtp3gTs",
      "date": "2024-02-03T19:54:34.642Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=23525442-3806-42dd-a743-72b59fff0eda",
      "title": null,
      "text": "Edit: I keep getting awful spam notifications for basically nothing. I enter the notifications setting in the app only to discover that they are all forced on and cannot be turned off individually. Even though they are all listed out with toggles, clicking them just opens the global notification settings for the app, meaning it's all or nothing, they have taken away the granular control. If you want me to block all of your notifications, so be it. The people who built this app are bad people.",
      "replyDate": "2023-09-07T20:04:08.269Z",
      "replyText": "Thanks so much for your feedback. We’re noting your feedback and will be sharing it with the team to consider for future updates. Please know we take comments from the community to heart, and we make many changes to the site based on what we hear. You can read more in our Terms of Use: https://www.etsy.com/legal/terms-of-use",
      "version": "6.58.1",
      "thumbsUp": 61,
      "criterias": []
    },
    {
      "id": "bed8d049-e3b0-42a2-a747-bd0bb89c29fd",
      "userName": "Casey Dodd",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWm1DHW7KvKohRKK4fmhYAlefS4OjeS-pkW0EBqxYJ3uyBw",
      "date": "2024-02-17T04:56:03.749Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=bed8d049-e3b0-42a2-a747-bd0bb89c29fd",
      "title": null,
      "text": "Anytime I go to checkout, I get an error screen saying the URL doesn't exist. I updated the app, uninstalled and reinstalled, cleared the cache, signed out and back in, and it still won't work. I am also having an issue when I add things to my favorites. I get an error message that favorites isn't working right now. None of my Mastercards or Visas are accepted, not even my debit. The only payment accepted is Discover, and not only do I not want to use that, I can't even checkout with it anyway.",
      "replyDate": "2024-02-17T19:29:33.450Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues placing an order. You can try to restart your device or update the system of your device. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.60.0",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "773067df-3843-434a-892d-de87d619f286",
      "userName": "Melissa “MHMartin” Martin",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVQeMA-QPYYqWKqUfTNwpX1JdLpu2yWa7VQlPjUdhj0Ax4",
      "date": "2024-01-25T19:02:47.710Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=773067df-3843-434a-892d-de87d619f286",
      "title": null,
      "text": "I hate the algorithm, but everything else is fine. Fun place to shop and find unique items Update: I should like to be able to see other items. When searching the algorithm shows various items from the same seller and it's really hard to know what other options there are. I don't always only want to see from top shops, etc ...",
      "replyDate": "2024-01-25T18:14:15.190Z",
      "replyText": "Hi, we are always looking to improve the experience for our users, and really appreciate the feedback. If there is anything specific we can look into, please contact us at https://rb.gy/pucp3f.",
      "version": "6.57.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "553fbc67-d5a5-412c-8bd3-70cd4c8c9cb2",
      "userName": "Sebastian Ganes",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW6Cdx2uF_NtMb0OLaViJaXBZlo6VkSZG_vJ_CLNDlIczI",
      "date": "2024-02-14T22:44:39.840Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=553fbc67-d5a5-412c-8bd3-70cd4c8c9cb2",
      "title": null,
      "text": "Was a good app, but they made it so bloated with the interface that it feels super hard to navigate. I can no longer listen to music while scrolling my home page cause of the videos. Please have the option to use the old format. Also! The absolute dishonesty with sellers because this company enables dropshipping on there app is pretty nasty, doesnt make it better that Etsy in the past already has a bad history with seller honesty and company policy",
      "replyDate": "2024-02-15T18:30:21.892Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.60.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "607e018a-0e3e-46c0-a8e3-446782b2bf0d",
      "userName": "Clarissa Gasiciel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXk3UedGbGNW3ieK8CYI2dz7FvkFswm6AmetfCJiKlnfA",
      "date": "2024-02-07T23:10:30.590Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=607e018a-0e3e-46c0-a8e3-446782b2bf0d",
      "title": null,
      "text": "I used to be able to see when sellers I favorited added new items, which was great for being first to a rare find. Etsy appears to have removed that functionality, making me way less likely to use Etsy. I've also heard from many shop owners that Etsy continues to take more money from their sales and cause difficulties for them with receiving payments.",
      "replyDate": "2024-02-08T17:17:46.571Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience of removing the favorite feature. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further, rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.59.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "423ab113-440e-4a85-9307-e94ee525b4bc",
      "userName": "Jackie Hughes",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV0FETxJHiD0TyE7f7BIGBb9SLrBchjiPXRtFHd--Kj8js",
      "date": "2024-01-31T23:50:09.821Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=423ab113-440e-4a85-9307-e94ee525b4bc",
      "title": null,
      "text": "The perfect place to find all things perfectly unique, hand-made, customized or one-of-a-kind. Something made right here in the good old US of A or something handcrafted abroad in Europe or some where else. A lot of items ship free and those that don't the shipping cost is usually reasonable. You always have the chance to communicate with the seller if you have questions or concerns about a product and most respond within a reasonable time. So start shopping now, you be disappointed! =)",
      "replyDate": "2024-02-07T20:38:20.711Z",
      "replyText": "Thank you for providing your valuable feedback. Please reach out to us at https://rb.gy/pucp3f, if you have other suggestions.",
      "version": "6.58.0",
      "thumbsUp": 35,
      "criterias": []
    },
    {
      "id": "3330d19e-1951-400b-98d6-b2f92c6d3b21",
      "userName": "Anna Roshanski",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJMbyRl2Dlkse645wZpqiDZijPIW2bqa-xUG4UQcSY9CNc=mo",
      "date": "2024-01-19T11:58:06.190Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=3330d19e-1951-400b-98d6-b2f92c6d3b21",
      "title": null,
      "text": "Absolutely pathetic, ever since 2 recent updates! I've been shopping on etsy for years and have never had issues.NEVER!! until I updated the app, 3 months ago and the most recent update made it even worse! 1. Sending me notifications all day, nonstop (53 notifications a day) upon clicking on the app, it shows nothing new..as soon as I'm out of the app, I see the same number (53). What the hell?! 2. Loggs me out of my account on its own. 3.cant see messages. They disappear.FIX IT!!!",
      "replyDate": "2024-01-20T15:41:55.600Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.55.0",
      "thumbsUp": 12,
      "criterias": []
    },
    {
      "id": "8b704fd2-251f-4014-b1a2-f2d1fbf5ffff",
      "userName": "Cindy Ward",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLQYQxeF-gAWcYKsW1XtaKX6OLfb2HsZn0oL8eDyxBl=mo",
      "date": "2024-01-13T14:15:02.937Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=8b704fd2-251f-4014-b1a2-f2d1fbf5ffff",
      "title": null,
      "text": "1/13/2024 Update... When I purchase downloads I am not able to get them from the mobil app. Even if I go through google chrome, if the app is still on my phone it won't let me. I have to uninstall the app every time and then go to Etsy through google chrome to get them. This is a huge inconvenience and doesn't make any sense as to why I should keep this app on my phone. Please fix this so I can access them through the app!!",
      "replyDate": "2024-01-13T17:22:27.845Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.55.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "95546320-69c9-48d9-87dd-6baea9083e6c",
      "userName": "Artismos",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVZ5lLGNVKaKU_tcgwWtmTUQiLhYJLj5zj15sQ1wxrB0A",
      "date": "2024-02-22T15:56:20.591Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=95546320-69c9-48d9-87dd-6baea9083e6c",
      "title": null,
      "text": "Please add a feature to be able to backup all favorites/items, saved shops, and created item lists, i have so many extremely rare finds on here i dont wanna lose, and with how buggy the app and website is already, especially the fact i cant look at my own favorites past page 251 without it repeating whats on the first page on every page after 251... these things are very dear to me, and i cant access them due tp these bugs. otherwise really love the platform.",
      "replyDate": "2024-02-25T18:05:18.759Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport for any concern. Rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.46.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "56136c6d-6296-4211-a0f6-321da933f3bc",
      "userName": "Marie",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJVinBtZsEgcZmOUEPEhUDLVnQGu7_11tBX-QL9zISx=mo",
      "date": "2023-12-30T04:19:34.611Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=56136c6d-6296-4211-a0f6-321da933f3bc",
      "title": null,
      "text": "App is pretty good except for the purchases page. 1. When I click purchases, orders display twice or don't appear at all. (It displays correctly on the web browser.) 2. When I tap an order number to get the full details of a purchase, the details page only lists the first 4 items in the order. If I use the web browser, it displays all items in the order. The purchases page is buggy. Makes me wonder if sellers experience this same issue and don't see everything I ordered.",
      "replyDate": "2024-01-02T19:56:46.146Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.52.1",
      "thumbsUp": 85,
      "criterias": []
    },
    {
      "id": "428b6b5c-38d9-4e67-bffd-f0aeaad7cdfc",
      "userName": "Kristen H",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV08gGJa7EqkzZa99_8OavISlssQ2_mfCov47S-Not4mkM",
      "date": "2024-01-02T20:49:10.167Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=428b6b5c-38d9-4e67-bffd-f0aeaad7cdfc",
      "title": null,
      "text": "The cart is very glitchy, on app AND website. I can't move stuff to favorites or save for later. The screen flashes and nothing happens. On the computer I have do everything one at a time and then click back to my cart after every move. They say I can't add more than 99 items to the cart but it's impossible to move to favorites or save for later! Fix it!",
      "replyDate": "2024-01-03T18:53:43.761Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.52.1",
      "thumbsUp": 50,
      "criterias": []
    },
    {
      "id": "371a4dc8-e239-4c45-b372-de67b269ea2a",
      "userName": "Lauren Martin",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLdXUVXxBcBMRd8Jy4V1cQ6O99OYHaX9g5gNYDAClf2=mo",
      "date": "2023-11-26T15:49:58.446Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=371a4dc8-e239-4c45-b372-de67b269ea2a",
      "title": null,
      "text": "I've been using Etsy as a buyer and seller for 15 years. Within the last year or two, Etsy has made updates to their app that make it essentially unusable. Purchases won't show up, you can't use the search bar within your favorites list to find items. On top of that, they updated the layout in a way that is unfriendly to the fingers - now you have to scroll to the right instead of just using your thumb to scroll down. It freezes frequently. Garbage.",
      "replyDate": "2023-11-26T19:33:25.591Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.47.0",
      "thumbsUp": 140,
      "criterias": []
    },
    {
      "id": "5841f0aa-f0f7-4e6b-9aa0-15162de55298",
      "userName": "Gretchen Schulte",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLyDv5Wps_lxeBZxHZEUdyEpsNli-mWAlECLRnOx--P=mo",
      "date": "2023-11-30T14:22:09.879Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=5841f0aa-f0f7-4e6b-9aa0-15162de55298",
      "title": null,
      "text": "The site has ALWAYS been difficult to navigate. Even when I select the choice to have the lowest priced items listed first, there are higher priced items woven throughout the page. I find that HIGHLY sneaky and deceptive! I tend to use eBay, such an easier shopping experience! I like supporting smaller shops that make hand made items, but I refuse to deal with your maddening search features!",
      "replyDate": "2023-11-30T20:47:52.446Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 50,
      "criterias": []
    },
    {
      "id": "b0d75805-cb38-403e-94a6-f90d111d2917",
      "userName": "Alexis Mag",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXoCiHccO1L8JvNgD4ynYOG2LbPjU52UQzJ3gJI-er53pt3",
      "date": "2023-12-01T12:29:25.910Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=b0d75805-cb38-403e-94a6-f90d111d2917",
      "title": null,
      "text": "Great app to reach those small businesses across the world, that one may not otherwise get to experience. My only issue is, the app will not allow me to save items I am not ready to purchase. I click on save for later, the screen blinks but does not remove item from cart. I never had this problem prior, until the last update which, sliding to save cart was added (does not work either). Please assist in fixing this. Thank you.",
      "replyDate": "2023-12-14T16:29:42.158Z",
      "replyText": "Thanks for taking out time to rate us. It really helps us to keep going and delivering the best. If you experience any dissatisfaction, please contact our customer care at https://rb.gy/pucp3f.",
      "version": "6.47.0",
      "thumbsUp": 82,
      "criterias": []
    },
    {
      "id": "6c50a823-7823-48bf-b941-49fc86fe3911",
      "userName": "Laura Arango",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV4RDYhEht_mdelboW_hKbHmToT_Fluvxzqp31rBkKNJxg",
      "date": "2023-11-24T12:19:54.360Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=6c50a823-7823-48bf-b941-49fc86fe3911",
      "title": null,
      "text": "Love it! I just wanna point out one glitch because it kinda drives me bananas: I love browsing Etsy while listening to music. If I scroll all the way to the bottom where the new clips are, my music cuts out. Same when I open a listing, and if the listing has a video of the object they're selling, my music cuts out. Is there any way to stop that from happening? It's inconvenient, and the app is still nice, but it's annoying.",
      "replyDate": "2023-11-24T12:55:53.392Z",
      "replyText": "Thanks so much for taking the time to share your feedback. Happy to hear about your experience with Etsy. Please let us know the reason behind this rating at https://rb.gy/pucp3f. We'd be happy to improve our app based on your suggestions.",
      "version": "6.47.0",
      "thumbsUp": 122,
      "criterias": []
    },
    {
      "id": "1943ec68-ed29-4be8-a9e1-c297143ce810",
      "userName": "Jasmine Hoover",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX0zlbG-DVzhRrjawAqQxNu9QOlCw0jPt7rJYCBXKNUIX-t",
      "date": "2023-11-23T19:01:27.706Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=1943ec68-ed29-4be8-a9e1-c297143ce810",
      "title": null,
      "text": "Love Etsy but it's honestly a really bad and problematic app. It gives me an error message every time I try to go to my cart. It's been months since I could access my cart. So I can shop/browse on the app but then have to open the browser to do anything from my cart. It's been months like this. For an app where the point is shopping, that's pretty bad. Also, when you buy any kind of digital file, you can't download it from the app. Lots more but no room here. Might as well use your browser",
      "replyDate": "2023-11-23T19:58:19.445Z",
      "replyText": "Thanks for taking the time to share your feedback. We’re sorry to hear about your experience. To best look into this, can you open a ticket with our support team? They’ll be able to gather more information and pass the relevant information to our designated teams. You can contact us here: https://help.etsy.com/hc/en-us/requests/new",
      "version": "6.47.0",
      "thumbsUp": 140,
      "criterias": []
    },
    {
      "id": "e36fcc3f-8cbf-4416-a6b0-2f9d600930ce",
      "userName": "Sarah Parton",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVeRwt_k5grIH1QCl43v2CzWgRpkmiHb80c9FHj_XYUnA",
      "date": "2023-12-05T19:26:47.307Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=e36fcc3f-8cbf-4416-a6b0-2f9d600930ce",
      "title": null,
      "text": "Don't get me wrong, I love the things people make on Etsy and, for thr most part, my stuff has always been amazing! However, I find it super frustrating that you think you have found a good price and then you realize that the \"good price\" is for a 3t in white and not a women's medium. Another example would be searching for a Stanley brand customized cup only to have to search the detail of every seller because the low price isn't the one pictured- it's for an unbranded cup. Super annoying!",
      "replyDate": "2023-12-05T20:50:16.141Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 82,
      "criterias": []
    },
    {
      "id": "60249b60-86f7-470d-b392-cbe53dc801b1",
      "userName": "Marie F",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVLaOu1o3i9SMULBP_4xEZukZOExn5TzksTD4MP0o-L4QU",
      "date": "2023-12-06T15:01:22.399Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=60249b60-86f7-470d-b392-cbe53dc801b1",
      "title": null,
      "text": "Great features: categorizing your favorites and easy browsing. Bad features: 1. When you have multiple items in your cart, you cannot see the total from each shop. 2. You never see the shipping amount until you pay. 3. When you delete items from your cart it is incredibly slow. 4. After making a purchase you cannot see the day and time when you placed your order ever on the app. This is a huge issue for me. How does a buyer hold a seller accountable? This app is going downhill fast.",
      "replyDate": "2023-09-20T20:18:40.846Z",
      "replyText": "Thank you for your valuable feedback. We appreciate these comments from the Etsy community, as we collect insights for future adjustments. Kindly let us know what updates or changes you would like to see in our app. Stay safe!\n",
      "version": "6.47.0",
      "thumbsUp": 102,
      "criterias": []
    },
    {
      "id": "ad2fecb3-aab2-47ef-bd12-232ccb5e84c6",
      "userName": "Jessica Baker",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKqzpUmEhDCnfCkXs8byX9K7gYiWGK8849vcUQfW7gL=mo",
      "date": "2023-12-10T12:08:14.870Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=ad2fecb3-aab2-47ef-bd12-232ccb5e84c6",
      "title": null,
      "text": "The functionality of the app is not great, they push WAY TOO MANY notifications from the app that are not related to an order, and it doesn't seem you can 'unselect\" an item once you've marked it as a favorite. I constantly get notifications that i have unread messages (which isn't true). It pushes notifications to items i marked with the heart. In order to stop the constant bombardment, I want to unselect them but it wont let you! Very annoying!",
      "replyDate": "2023-12-10T18:01:31.870Z",
      "replyText": "We understand how annoying that must be. We're working on a solution. We hope you'll re-consider the rating once we fix the issue.",
      "version": "6.50.1",
      "thumbsUp": 318,
      "criterias": []
    },
    {
      "id": "8f1b0c46-e863-4196-a358-aa90571b39ce",
      "userName": "Danielle Adams",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVVBc-l7BHmQLXG3SFLaLuye23GcHnFJ1UeOiCQaLFmBwSM",
      "date": "2023-10-07T00:12:53.924Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=8f1b0c46-e863-4196-a358-aa90571b39ce",
      "title": null,
      "text": "I used to really love browsing on the Etsy app but their last updates have made it less enjoyable. I hate the videos that play automatically because it stops whatever audio you might be listening to. I also don't know why they got rid of the multiple lists of suggested items. I used to spend so much time jumping from list to list and now there's barely anything on the homepage for browsing. I definitely use the app way less now.",
      "replyDate": "2023-10-08T18:46:40.206Z",
      "replyText": "Thank you for taking time to write your review. We’re more than happy to help you, if you wouldn't mind opening a ticket with our support team. Kindly reach out using this link: https://help.etsy.com/hc/en-us/requests/new. Have a wonderful day!",
      "version": "6.41.0",
      "thumbsUp": 270,
      "criterias": []
    },
    {
      "id": "224294ac-f068-4e99-8855-10b69f09299e",
      "userName": "Brandy Boyd",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXRlb3tIcJxkkxCsgW7oVq3VXuubE8-9bGv8MKFOIRI3rUU",
      "date": "2023-11-25T21:39:30.869Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=224294ac-f068-4e99-8855-10b69f09299e",
      "title": null,
      "text": "Etsy support sucks- and it's pretty much non existent. 11/23- no matter what I do, I can't access my cart on the app. I get a \"whoops! Something went wrong, try again\" message. And it's been going on for over a month. I've updated, uninstalled and reinstalled, no fix. Also, can't find a way to report issues in the app. From 2021- Etsy replied in 2023...I can't add anything to my cart. I get an \"error adding this item\" every time.",
      "replyDate": "2023-09-09T19:30:09.898Z",
      "replyText": "Hi, we are always looking to improve the experience for our users, and really appreciate the feedback. If there is anything specific we can look into, please contact us at https://rb.gy/pucp3f.",
      "version": "6.47.0",
      "thumbsUp": 52,
      "criterias": []
    },
    {
      "id": "b8667f54-6073-4689-8e74-5ccba0e114b1",
      "userName": "Regal Leopard",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXtWbA9C8OEX6audzvz9W5hqn853jp0xtFlikXWFPWEAA",
      "date": "2023-10-12T01:54:51.112Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=b8667f54-6073-4689-8e74-5ccba0e114b1",
      "title": null,
      "text": "OCT 2023: It's only 1 month later & it's happening again for the entire week; on the rare occasion that the cart page loads (ie 2x out of 12 attempts), I am unable to delete anything from it. On the other hand, it has saved me hundreds of dollars! ..Sep 2023: It's very difficult to make a purchase when the page just spins, & spins, & spins & the page to the shopping cart won't load.",
      "replyDate": "2023-09-11T20:16:58.118Z",
      "replyText": "Thank you for taking time to write your review. We’re more than happy to help you, if you wouldn't mind opening a ticket with our support team. Kindly reach out using this link: https://help.etsy.com/hc/en-us/requests/new. Have a wonderful day!",
      "version": "6.42.1",
      "thumbsUp": 87,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "6ae16db6-0ef8-4239-b5b7-5fbb884e45ff",
      "userName": "C WCG",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJjxz54NayrFVO0FQoLav6UU6p4oM1sRUxBzWpCkhk=mo",
      "date": "2023-10-30T03:42:02.758Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=6ae16db6-0ef8-4239-b5b7-5fbb884e45ff",
      "title": null,
      "text": "Latest update has essentially broken the app. I can't access my cart at all without me getting an error. Every. Time. When I could access it, it wouldnt let me delete anything. I also cannot access my favorites section without having to back out of the app multiple times because its a blank screen. I've tried uninstalling and reinstalling every time I use this app now and the same thing happens. Really frustrating going into the holiday season.",
      "replyDate": "2023-10-31T20:49:40.440Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.44.0",
      "thumbsUp": 120,
      "criterias": []
    },
    {
      "id": "f10a46a6-7de4-4f03-af6a-2488e60abf9c",
      "userName": "mindlessbuddha",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWUg08YxMXxuW6ut4uk5SsqRlCQ8P0rpPf_v_0WQTTA1FI",
      "date": "2023-10-18T12:50:41.395Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=f10a46a6-7de4-4f03-af6a-2488e60abf9c",
      "title": null,
      "text": "Needs to allow shipping options for sellers. We should be able to choose ups, usps, fed ex, etc. I'm repeatedly told by sellers that it isn't allowed. UPDATE: lowered rating because of broken search. Sellers and buyers have complained for years without any fix. Many exact matches are buried in a long list of irrelevant or unmatched search hits. It's beyond frustrating. It's faster to search with google and then open Etsy app. Don't search in Etsy - it's a waste of time.",
      "replyDate": "2023-10-11T17:45:14.924Z",
      "replyText": "Thank you for your valuable feedback. We appreciate these comments from the Etsy community, as we collect insights for future adjustments. Kindly let us know what updates or changes you would like to see in our app. Stay safe!",
      "version": "6.42.1",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "3af7cfca-fafc-4c07-a87a-bab161121df7",
      "userName": "Anna Pomeroy",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUETqB4F8502q7jw0sAvGa9h_QWFace8LVCEnuKeu8hv_A",
      "date": "2023-10-21T00:16:58.491Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=3af7cfca-fafc-4c07-a87a-bab161121df7",
      "title": null,
      "text": "I love etsy and the app. I frequently add stuff to my cart and then change my mind and \"Save it for later.\" After this last update, I can not save things. The app won't let me. It just does nothing. I thought maybe it was because the save it list had too many items, so I tried to access that list, and it was not there. There used to be a tab at the top of the page of your cart, and you could switch back and forth between the two and add items back into your cart. There is no tab. 🤬",
      "replyDate": "2023-11-27T18:42:41.429Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues adding items to your cart. Try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.43.0",
      "thumbsUp": 166,
      "criterias": []
    },
    {
      "id": "99789f00-2d9b-44bd-b4b4-71500528dd82",
      "userName": "Nathan M",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLEnNRFPBZI81z06RiKZgLOi0Bo2iN3GXlmQk4he5I1=mo",
      "date": "2023-10-04T18:21:52.538Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=99789f00-2d9b-44bd-b4b4-71500528dd82",
      "title": null,
      "text": "It works most of the time, I had an issue with one order and tried to get help through the app but couldn't submit a ticket and now the \"help with this order\" button always leads to the \"uh oh something went wrong\" page. Also the app doesn't update tracking well. I never know when I'm getting anything. Usually stops updating after \"product shipped,\" I'm like to know where my product is. Review tab isn't working either. I hope it gets fixed soon.",
      "replyDate": "2023-10-04T19:20:53.125Z",
      "replyText": "Hi, sorry to hear you’ve been experiencing some issues. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: https://help.etsy.com/hc/en-us/requests/new with further details. We’ll work with you to resolve this issue as quickly as possible. Thank you!",
      "version": "6.41.0",
      "thumbsUp": 132,
      "criterias": []
    },
    {
      "id": "2836572e-9ce4-4cf9-8580-229cb1b6d681",
      "userName": "Saundra McNair",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLtCSRpob2DrO1h6bm2sFGmOua4oKlgxyFICyqF8-gZ=mo",
      "date": "2023-10-13T12:46:18.390Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=2836572e-9ce4-4cf9-8580-229cb1b6d681",
      "title": null,
      "text": "After installing your new update for the app I am no longer able to check out my items. It keeps saying there is a URL issue. There is no way to call and speak with someone regarding this issue, and this is Poor Etsy customer service, not the seller's fault. I do Not like the new update at all. I don't like the videos. I don't like how with the slightest touch, it removes items from my cart; and then I have to go through the process of returning them to my cart. This update is an Epic fail.",
      "replyDate": "2023-10-13T14:51:17.727Z",
      "replyText": "Thanks for taking the time to share your feedback. We’re sorry to hear about your experience. To best look into this, can you open a ticket with our support team? They’ll be able to gather more information and pass the relevant information to our designated teams. You can contact us here: https://help.etsy.com/hc/en-us/requests/new",
      "version": "6.42.1",
      "thumbsUp": 86,
      "criterias": []
    },
    {
      "id": "b9076ed8-5d24-4129-8889-6f1e95c9b9fc",
      "userName": "Rachel Richardson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXY6jhVKL8fxKUy8JO8b0l_sJ7ahXH1oIfJdPuLhaQ5KU8A",
      "date": "2023-10-03T16:38:27.467Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=b9076ed8-5d24-4129-8889-6f1e95c9b9fc",
      "title": null,
      "text": "Would be great if you could actually see your digital items and download from the app/phone, it's basically a app just to shop but not full service for sure. Needs major improvements. Very annoying that when you \"heart\" something it automatically goes into 'favorites' and you can make list and sort but then it's in 2 folders so constantly have to remove every item from favorites. Why give you the option of folders to sort if you're going to add it yourself where we don't want.",
      "replyDate": "2023-08-23T19:28:41.235Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further, rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.41.0",
      "thumbsUp": 90,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        }
      ]
    },
    {
      "id": "25b68749-3710-4ac9-8692-8d9360354310",
      "userName": "Alysse Berry",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUARHVbbLNCye4_XsT7zQ_qvRMh38upSB95_oDLUzuPL905",
      "date": "2023-10-12T21:53:18.412Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=25b68749-3710-4ac9-8692-8d9360354310",
      "title": null,
      "text": "A recent update had added videos and seemed to force every listing to have them as the second photo... but they're not helpful, and they make any music you're listening to stop playing and you have to manually start it again, which is extremely annoying and makes it hard to browse while listening to music... often end up in me just closing the app without actually finding and buying the things I want. Also etsy charges ridiculous fees on sellers and does nothing to weed out drop shippers",
      "replyDate": "2023-10-14T14:44:07.952Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.42.1",
      "thumbsUp": 44,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 2
        }
      ]
    },
    {
      "id": "e089f41d-bdcc-4ac4-ae95-31c8fc1dffa6",
      "userName": "Stephanie Ashton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK1YtHvZGrzqSszwzQWCqkCIpe0j0-LMcrQJASAElg4=mo",
      "date": "2023-10-22T07:10:43.529Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=e089f41d-bdcc-4ac4-ae95-31c8fc1dffa6",
      "title": null,
      "text": "Update: it seems to have been fixed. Was fine until the latest round or two of updates within the last day or two. I literally placed an order within the last week, and now the app won't open at all. I have tried rebooting my phone, but it refuses to open. I can't check on my order status without tracking down my password and getting on a computer. Defeats the purpose of the app.",
      "replyDate": "2023-10-20T13:29:07.173Z",
      "replyText": "Hi Stephanie ! Thanks for reporting this to us. To best look into this, can you open a ticket with our support team? They’ll be able to gather more information and pass the relevant information to our engineering teams. You can contact us here: https://help.etsy.com/hc/en-us/requests/new",
      "version": "6.43.0",
      "thumbsUp": 95,
      "criterias": []
    },
    {
      "id": "cea84ef9-3474-4f06-ac7d-28ccfbf1153f",
      "userName": "Miranda Oehler",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKcSg6YWzDe2hOOO5d7Vth61EmYjBQ81LX_uMWbOtMv=mo",
      "date": "2023-11-12T02:17:19.981Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=cea84ef9-3474-4f06-ac7d-28ccfbf1153f",
      "title": null,
      "text": "I'm glad the team fixed the weird issues where the same \"updates\" appeared in both the Favorites and Updates tab, but the new \"Deals\" tab is total chaos. There's one section that scrolls horizontally and one that's grouped vertically and \"shop items on sale\" are just random items and \"save on your favorites\" aren't even on sale! I preferred when it was all together in list format but if you're going to separate things at least make the sections contain what they're labeled to contain!",
      "replyDate": "2023-11-12T21:49:02.653Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you and stay safe!\n",
      "version": "6.46.0",
      "thumbsUp": 54,
      "criterias": []
    },
    {
      "id": "2d06ae2a-994f-433d-8bad-915a2bd2af46",
      "userName": "Joe Pittaluga",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUyM8l1b6EPWrJJ8wYzHch4xHmmSLHdXKgDoR9JvFlO_Lw",
      "date": "2023-10-07T15:27:02.934Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=2d06ae2a-994f-433d-8bad-915a2bd2af46",
      "title": null,
      "text": "I have several complaints about the Etsy app. the help buttons do not take you anywhere and there is very little response from the Etsy. it is also very hard to customize your order so that you can get it in a timely manner if needed. As much as I would like to help the artist sell their goods I have a hard time supporting this platform because of issues I am having with communication.",
      "replyDate": "2023-10-08T11:44:38.644Z",
      "replyText": "We're sorry to learn about your experience on our help button and order customization. Kindly contact our Support team using this link etsy.me/contactsupport and provide this specific issues that we can check on further, rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.41.0",
      "thumbsUp": 13,
      "criterias": [
        {
          "criteria": "vaf_apps_category_food_and_drink_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "2de20cc2-5fb5-44d2-a71a-a437bddc53aa",
      "userName": "Kristin Vornholt",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW7oakNXyiCLyigO_aPQWD8sX4rurMpPsOtJdckhZvhgcpV",
      "date": "2023-12-03T01:40:54.512Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=2de20cc2-5fb5-44d2-a71a-a437bddc53aa",
      "title": null,
      "text": "I see so many designs repeated at shop after shop - sometimes dozens. I feel no confidence that I'm buying from an actual seller and not somewhere that's just ripping off other people's work. Also, as a former seller, I have no interest in ever coming back, knowing my designs will likely just be stolen. It's also very hard to find any information about your orders - like order number, date of order, price paid, etc from the app. I'm not convinced you can which is annoying.",
      "replyDate": "2023-12-03T20:34:43.929Z",
      "replyText": "Hi, we are always looking to improve the experience for our users, and really appreciate the feedback. If there is anything specific we can look into, please contact us at https://rb.gy/pucp3f.",
      "version": "6.47.0",
      "thumbsUp": 30,
      "criterias": []
    },
    {
      "id": "c9198a14-66f0-4d62-9508-070cdcf54498",
      "userName": "M",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXJPDMwrByWImL35U0rKUUQv70Z8-lTnosvuXkE2JI5czA",
      "date": "2023-12-25T16:37:18.280Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=c9198a14-66f0-4d62-9508-070cdcf54498",
      "title": null,
      "text": "Love this app! The only thing I'd like fixed is that I have been a user for so long with so many likes that I am unable to search keywords (like \"sticker\") to sort through my favorites, both on a desktop and on my phone. I wish it could be made easier so I don't have to sift through endless pages trying to find a specific item I liked. It's been this way for several months now.",
      "replyDate": "2023-12-28T21:07:34.880Z",
      "replyText": "We would like to thank you for using our online shopping platform. If you experience any dissatisfaction, please contact our customer care at https://rb.gy/pucp3f.",
      "version": "6.52.1",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "34937971-9862-4da0-ba99-21420bd2ec89",
      "userName": "Keely Proctor",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXvj4ULkdktP_uF0atMVngAE35FF2ejsQ38oisCaNl8f7w",
      "date": "2023-11-22T10:55:11.457Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=34937971-9862-4da0-ba99-21420bd2ec89",
      "title": null,
      "text": "Updates make it harder to look at a variety of sellers and searches usually only come up with sponsored or resold items. Its way easier to come from a seller's outside source than anything the app actually does. I wouldn't use etsy at all with the fees aimed at their sellers if it wasn't the only place certain artists use. Gets worse each update too.",
      "replyDate": "2023-11-22T20:27:32.378Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "993110b0-f591-4cb6-aea5-5d8a1ca8371f",
      "userName": "Tiffany O'Neill",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUKfI0agqmKKiQuFrKpcyJPQm_9orjLUwY0_gbNPPNnMg3L",
      "date": "2023-12-20T15:46:55.300Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=993110b0-f591-4cb6-aea5-5d8a1ca8371f",
      "title": null,
      "text": "becoming increasingly frustrating to use. once you favorite an item, it is added to a favorite list as well as the list you add it to. instead of clicking the heart to remove the item, you have to remove it from every list its been applied to. you can't list the favorite items from oldest to new which makes it hard to find older items you liked. its just relentless scrolling then it will glitch and start you back at the beginning. I can't access my lists anymore. lots of mass produced junk",
      "replyDate": "2023-12-29T17:37:00.153Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further, rest assured that we'll assist you right away! Thank you and stay safe!",
      "version": "6.51.0",
      "thumbsUp": 43,
      "criterias": [
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        }
      ]
    },
    {
      "id": "2fa6aad3-8ec6-415e-8331-d340c528b4a0",
      "userName": "Taylor Finke",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVAcUMahfaJyN4fdUEgxm2KZtq8z6sL0JcdmgdV0dhZylI",
      "date": "2023-11-01T19:14:28.336Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=2fa6aad3-8ec6-415e-8331-d340c528b4a0",
      "title": null,
      "text": "Much like other reviews, I can't stand the autoplay videos pausing audio. It is not necessary, if have to autoplay videos, then have them muted by default. Another issue is that the search algorithm will throw in completely unrelated content just because I have looked at it in the past. If I am looking up pins from a book I like I do NOT need results for custom DND dice. Edit: the link added in the dev reply has no options for submitting feedback",
      "replyDate": "2023-10-11T19:01:26.360Z",
      "replyText": "Thank you for providing your valuable feedback. Kindly contact our Support team using this link https://help.etsy.com/hc/en-us/requests/new and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thanks again and stay safe!",
      "version": "6.44.0",
      "thumbsUp": 53,
      "criterias": []
    },
    {
      "id": "5fa14910-714c-40ff-a653-977db3263b30",
      "userName": "Ariel Sullivan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWrGPaL9_ktKTcgGZxvxIJOCUKAzH86QcZvmgo84bOeGw",
      "date": "2023-10-29T20:12:05.730Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=5fa14910-714c-40ff-a653-977db3263b30",
      "title": null,
      "text": "The new version of the search function is difficult to use if you're looking for anything specific. I wanted a sewing pattern to make a ghost plushie, so I used the terms \"ghost plush sewing pattern\". I got a page offering me categorized results for ghost stickers, keychains, posters, prints, etc., with an option for \"patterns & blueprints\". I clicked that and got a mix of everything but what I wanted. So sad! 😭",
      "replyDate": "2023-11-16T20:37:18.840Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.44.0",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "b767b2a3-b315-4e2f-816b-fdb0ff2136c4",
      "userName": "Deborah Coblentz",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIz1cyqIc4W_7SFfxGLEchghoJeyvOi_RjII4A1hLPv=mo",
      "date": "2023-11-06T02:51:01.385Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=b767b2a3-b315-4e2f-816b-fdb0ff2136c4",
      "title": null,
      "text": "I shop quite a bit on this site and constantly seeing new innovations of things one never thinks about. The items are endless and something for every budget. The talent seen on this site is outstanding. I am amazed every time I visit and usually end up buying something. The site remembers items you have glanced it and sends suggestions. There are times when I was looking at something and then a pop up asks if want to see familiar items and before I know it I can't remember the 1st item.",
      "replyDate": "2023-11-09T11:26:04.590Z",
      "replyText": "Hi, we are always looking to improve the experience for our users, and really appreciate the feedback. If there is anything specific we can look into, please contact us at https://rb.gy/pucp3f.",
      "version": "6.45.0",
      "thumbsUp": 67,
      "criterias": []
    },
    {
      "id": "f2330f90-4a72-456e-bce2-15f81321d361",
      "userName": "Mary ann Neubert",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXTvKlnQAXMaEgbR_TH28dYPjnQS92d6yG7V9X1ccKqM58",
      "date": "2023-11-01T21:30:32.202Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=f2330f90-4a72-456e-bce2-15f81321d361",
      "title": null,
      "text": "Oh how I wish the shopping cart would work. It used to work flawlessly but for the past month or two it either won't open at all(error message). I try and try multiple times to no avail it never opens. Also, sometimes when I delete items from the cart it doesn't actually delete. Just so many darn bugs now, much like their online cart. Do they want people to be able to shop easily?",
      "replyDate": "2023-11-11T20:45:56.390Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues accessing the cart. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.45.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "655f7778-e768-4743-a464-32ca70e77c4b",
      "userName": "Kat Buffone",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK6Ix_W_YNlB656A_0WMWkWkZpgXlWoR4Xir6kl8J7M=mo",
      "date": "2023-10-22T12:24:50.695Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=655f7778-e768-4743-a464-32ca70e77c4b",
      "title": null,
      "text": "New update is terrible for searching/browsing. Category lists on top that have nothing to do with the search, and no way to just see an actual full search of everything. Items matching old searches mixed in with the current search. If it stays like this, it won't be worth the hassle of digging for what I need and I'll just look elsewhere.",
      "replyDate": "2023-11-27T18:36:19.107Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.43.0",
      "thumbsUp": 13,
      "criterias": []
    },
    {
      "id": "ede2410c-20bc-4066-a5c8-ba1d9083e4a4",
      "userName": "Tudy Thompson (ninjamafia192)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXx9v-dOt5m9ykFldhhqNOWWABPLICpgFiss_aEdd1o",
      "date": "2023-11-20T02:48:19.901Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=ede2410c-20bc-4066-a5c8-ba1d9083e4a4",
      "title": null,
      "text": "Please fix your \"Download File\" button. Your help guide says it's there, but it doesn't exist in the app. I'd have to go to the website to download the files I buy, which is an unnecessary hassle. Also, when I search an item, I don't want to see items I previously looked at in the results when they have nothing to do with what I searched. Furthermore, why is there no option to turn off email notifications or at least limit them? I don't need an email every time a seller sends a reply. Please fix",
      "replyDate": "2023-11-24T20:34:20.365Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 41,
      "criterias": []
    },
    {
      "id": "4e8721f5-866a-4062-8a3b-91665ac8be00",
      "userName": "Stephen NYberg",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVJ10tA9Sj6h0feA6AEnE_In6c5m8NcIDoa796Q_TzrFcU",
      "date": "2023-11-22T21:40:57.276Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=4e8721f5-866a-4062-8a3b-91665ac8be00",
      "title": null,
      "text": "Never using this app again! I ordered something that was gonna be a gift around the end of September.. it's now almost through November and I still haven't received it. I communicated with the seller and they said they would refund my money back at the beginning of November. The sellers will scam you!!! I tried asking Etsy for help and unable to because it's hard to navigate. My item is showing that it's almost here, I DON'T WANT it anymore. I just want my money back! 2 months later!",
      "replyDate": "2023-11-23T20:04:56.204Z",
      "replyText": "Thanks for taking the time to share your feedback. We’re sorry to hear about your experience. To best look into this, can you open a ticket with our support team? They’ll be able to gather more information and pass the relevant information to our designated teams. You can contact us here: https://help.etsy.com/hc/en-us/requests/new",
      "version": "6.47.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "074d8e4b-1c6d-4055-b98b-756238f4d513",
      "userName": "Alex Watkins",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJG1moaaJg2--yy6x7piwOrRYwLZLUCB5SWozgLCPwJ=mo",
      "date": "2024-02-01T17:47:39.116Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=074d8e4b-1c6d-4055-b98b-756238f4d513",
      "title": null,
      "text": "App really needs an overhaul or something. 1. Bad search feature. Ex, if I'm looking for items listed from least to most expensive, I don't want to see expensive items sprinkled in! I don't know if sellers have some option to push their products despite filters or something, but it's so damn annoying. 2. Why tf can't we download our purchased files thru the app or my email receipt? What's the point of the app if I have to sign in on the browser to get my files?",
      "replyDate": "2024-02-01T20:53:45.833Z",
      "replyText": "Thanks for your feedback! We’re sorry to hear about your experience. We would appreciate it if you could contact us using this link: etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you, and stay safe!\n",
      "version": "6.46.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "5c8a9199-30d5-45d1-bb28-481ce29f4a58",
      "userName": "Nathan Valentine",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW5DR11_xD8Nx6Bz0uavCXOlj6_O1CWND-DVTELrtbWGQ0",
      "date": "2023-12-17T13:35:10.828Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=5c8a9199-30d5-45d1-bb28-481ce29f4a58",
      "title": null,
      "text": "For a while, this app - much like the website itself - had a lot of issues with accessing the cart when you had a lot on there. Considering that having items in your cart is the catalyst for a seller to send coupons, this seems counterintuitive. Issues included forcing you into your Saved For Later every single time you updated the quantity of or removed an item entirely from your cart, or not loading the cart at all. I believe this is fixed but cannot confirm without checking release notes.",
      "replyDate": "2023-12-17T17:09:29.744Z",
      "replyText": "Thank you for your kind feedback. We are aware of this problem and are currently working on solving it. Please update your app to the latest version when you see an option.",
      "version": "6.51.0",
      "thumbsUp": 83,
      "criterias": []
    },
    {
      "id": "1eeb1e3c-a5a7-4004-91f8-ed222df61782",
      "userName": "Connie Plum",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIHRwl6aF3Qz86SsYNg1UKE9KNg7mkGIwXLmUrY-Jbg=mo",
      "date": "2023-11-25T16:21:51.193Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=1eeb1e3c-a5a7-4004-91f8-ed222df61782",
      "title": null,
      "text": "The last several times I've bought e-patterns that have to be downloaded, I don't get a link that allows me to download what I paid for. The seller sends me to Etsy to download the pattern, but there's no \"button\" there that allows me to download my purchase. I then have to contact the seller, which is rapidly becoming a PITA. It was fine up to a couple months ago.",
      "replyDate": "2023-11-25T20:26:29.353Z",
      "replyText": "Thank you for reaching out and we're sorry to hear about the inconvenience you had with your order, your experience certainly does not represent the kinds of exchanges we want Etsy buyers to have. Please reach out to our Support team using this link etsy.me/contactsupport and we'll assist you right away! Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "d067c96a-d0bc-42f5-9737-12d689ad7ad4",
      "userName": "Tara Lynn",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX9vxGFRM_TPkv-ecOoyIcntfIvcwxZDEXlYHrx1hpOFmU",
      "date": "2023-10-07T19:10:31.844Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=d067c96a-d0bc-42f5-9737-12d689ad7ad4",
      "title": null,
      "text": "Help for problems with orders is NOT available. The app's \"Help\" button is deactivated. The only option is to try to message the seller. If the seller chooses to ignore you the buyer, there are no other remedies available through the app. I contacted Support, they emailed back that I should just message the seller; the same seller who is not responding to messages.",
      "replyDate": "2023-10-06T19:37:57.219Z",
      "replyText": "Thank you for reaching out and we're sorry to hear about the inconvenience you had with your order, your experience certainly does not represent the kinds of exchanges we want Etsy buyers to have. Please reach out to our Support team using this link etsy.me/contactsupport and we'll assist you right away! Thank you and stay safe!",
      "version": "6.41.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "75c04063-cae7-4137-a6c1-7457a63a3a8a",
      "userName": "Greg Thomas",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI-S3b9thBD6Nqa2KxMAmttNcfk83ojqdywdBVjiIij=mo",
      "date": "2023-10-26T06:38:53.444Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=75c04063-cae7-4137-a6c1-7457a63a3a8a",
      "title": null,
      "text": "Lots of things to see. Lots of over priced items that I can make in no time. But they mailed up due to the fees etsy charges. All my hard work to go to a platform to sell from? Just another person trying to take from another person doing the work. Better than marketplace I guess. Finding cheaper ways to sell so that means better off I am and less work to offset the cost of fees!! Make a sellers market seller friendly. Why only 3 stars. 2 is more fitting but that hurts the people who make the app",
      "replyDate": "2023-11-23T17:04:21.897Z",
      "replyText": "Hi, we are sorry that you faced an issue. Could you please share your contact details with us on https://rb.gy/pucp3f so that we can get in touch with you and resolve the issue.",
      "version": "6.43.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "ba544297-d5f2-440d-b8df-178c7937c5ac",
      "userName": "S M",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJhT8fwvuu1crLdXUMc6UfRv3i90XYkEPTB_8HZ0sY=mo",
      "date": "2023-12-21T23:06:11.406Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=ba544297-d5f2-440d-b8df-178c7937c5ac",
      "title": null,
      "text": "When I purchase files to be downloaded, this can not be done through the app. But when I open the Etsy website in my browser, it pushes me back out to the app. My only option to get the files I paid for is to delete the app, then go to the website and download my files, then reinstall the app. I will not be purchasing files to be downloaded again. Then, when I emailed the support email, listed on the Play Store, I received a message that it was an unmonitored inbox, what's the point?!",
      "replyDate": "2023-12-23T19:37:01.576Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.52.1",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "2e251bbb-35f8-4c43-b64a-2066fb08300d",
      "userName": "Serenity Gaming",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUO5eDcr2LMj_W_aQqsa0pj8wEWpDJmlbWdrtzvS6eJu4k",
      "date": "2023-12-08T12:56:22.551Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=2e251bbb-35f8-4c43-b64a-2066fb08300d",
      "title": null,
      "text": "I loved this app for finding traditional, hand drawn art that real artists put their heart into. Now, the site is just full of overpriced ai art that pollutes all of my recommendations. I can't recommend this app to anyone until this problem is solved. The ai art is destroying traditional artists with this easy \"enter prompt, get art, sell art\" system, there is no soil in it.",
      "replyDate": "2023-12-08T20:41:36.335Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.50.1",
      "thumbsUp": 173,
      "criterias": []
    },
    {
      "id": "d114ec16-fbb1-404a-b2bb-eb010c521195",
      "userName": "Micheal Malaske",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU0D5VptAOe32uan2EQVYMTqN-rPVVXMnFMbWNjgMdrTLjm",
      "date": "2023-11-15T23:11:02.690Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=d114ec16-fbb1-404a-b2bb-eb010c521195",
      "title": null,
      "text": "The favorite icon now defaults to show updates first, updates should stay a separate icon. When I click favorites that is what I expect to be displayed. On top of this bad design choice sometimes the items/shops etc. upper nav does not show or displays an error. I now cannot see what items I favorited. Did anyone do UX testing with this change?",
      "replyDate": "2023-11-16T20:28:31.411Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "5f441bd6-a274-4482-a22e-7652fa89680c",
      "userName": "TIM WILLIAMS",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJf8U_vaI9z0bpw-ge9eteAOR6Y48TnyBDSUB_stFKG=mo",
      "date": "2023-12-17T20:26:03.310Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=5f441bd6-a274-4482-a22e-7652fa89680c",
      "title": null,
      "text": "I've used this app multiple times and no issues. Problem is if you have an issue with a seller there is NO way to get any assistance beyond emailing the seller.What happens if the seller doesn't reply?You can open a ticket but that only takes you to the \"messages\" section to contact the seller! I will not be using this in the future and recommend you don't either.So I received an email from the developers asking me to contact them. It takes me to the exact same page in the app that DOESNT WORK",
      "replyDate": "2023-12-17T14:32:19.427Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.51.0",
      "thumbsUp": 31,
      "criterias": []
    },
    {
      "id": "fdddf0ee-6096-4edc-8ad2-ef716eb911fa",
      "userName": "unkn0wn.cr3atur3",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV-dUrPxhU8sL4bleduANrjjh71SqCYVp_vNyReIpv7X4c",
      "date": "2023-12-08T02:09:03.994Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=fdddf0ee-6096-4edc-8ad2-ef716eb911fa",
      "title": null,
      "text": "I like the app but two issues. One, when I go to see all of the stores in following it only shows the recent five but if I'm on my laptop it shows every shop. Two, when I search for a shop I can't click the search button if I want to find a shop, I'll have to look at the bottom of the screen without pressing search, maybe an option under filters would fix this since I know other people are having trouble finding shops as well.",
      "replyDate": "2023-12-14T16:24:35.537Z",
      "replyText": "Thanks for taking out time to rate us. It really helps us to keep going and delivering the best. If you experience any dissatisfaction, please contact our customer care at https://rb.gy/pucp3f.",
      "version": "6.47.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "1a857bc9-f326-4e6a-ac65-3f961550b906",
      "userName": "Johna R",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXR7JjxuhloIjpVW_2BIRuvREocNlQ9zFUkJjHI4I63Dmgv",
      "date": "2023-11-29T01:53:29.456Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=1a857bc9-f326-4e6a-ac65-3f961550b906",
      "title": null,
      "text": "The updates to this app has literally made it frustrating to try and figure out what I ordered after it's placed. It doesn't show all of my order per seller and I forget so I end up ordering more from another seller🤦🏻‍♀️ plus I no longer see a button for my saved items. Also my order history disappeared so I can't remember which products were good quality from which seller 😑 please fix these by reverting it back to how it was before",
      "replyDate": "2023-11-29T17:46:40.918Z",
      "replyText": "Oh no! We sincerely apologize for the troubles you've had with the app. We'd be happy to take a look into this for you, please contact us at https://rb.gy/pucp3f. Thank you.",
      "version": "6.47.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "733f1678-7a81-4b3b-8f97-044d8639b7ba",
      "userName": "Becca Wolke",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUUax6oY1SID0_Ukoy4TnnFz9TF5PMt_-Lq3WGTsG7mbJvy",
      "date": "2023-11-19T17:49:14.483Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=733f1678-7a81-4b3b-8f97-044d8639b7ba",
      "title": null,
      "text": "Update deleted everything. I just tried to open the app and it said there was an update needed. Went through the update process and now my home screen is blank and \"loading\" and my profile page and favorites are all gone with \"oops something went wrong\" on all tabs. I rarely use this app but when I do I have saves for future events like weddings or baby showers and it's all gone ☹️",
      "replyDate": "2023-11-19T18:45:16.476Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the app. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.47.0",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "25fffe57-a5cc-4c34-9897-defe247dac84",
      "userName": "Jenny",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK8uaj7xYFYiZQ1b0fevlqqVUhn_rG2Cec7mUJJ-dMk=mo",
      "date": "2023-10-13T00:53:36.820Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=25fffe57-a5cc-4c34-9897-defe247dac84",
      "title": null,
      "text": "I will NEVER order anything on Etsy again. I can't understand that sellers have the option to turn off messages send to them, but they can message the customer. It's also not fair that you spend your money, get wrong orders or didn't get it at all. You have to send a message to Etsy first and still don't get through. This is some BS!",
      "replyDate": "2023-10-13T15:01:20.816Z",
      "replyText": "Hi Jenny! Thanks for taking the time to share your feedback. We’re sorry to hear about your experience. To best look into this, can you open a ticket with our support team? They’ll be able to gather more information and pass the relevant information to our designated teams. You can contact us here: https://help.etsy.com/hc/en-us/requests/new",
      "version": "6.42.1",
      "thumbsUp": 13,
      "criterias": []
    },
    {
      "id": "e124c033-d677-4307-bb61-4e119d9f8db0",
      "userName": "Nick Weaver",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX5sYBwpThE243-QVedR6Epo46NZD10HnVg9ONfoxTMdg",
      "date": "2023-12-04T14:07:42.365Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=e124c033-d677-4307-bb61-4e119d9f8db0",
      "title": null,
      "text": "Used this app for year and never had a problem until now. When I search half the time it just shows shops and not even the products. They removed the \"sort by popular\" options so now you can only sort by price which makes no sense, I'm looking for what I want not the cheapest thing I can find this isn't walmart. And lastly whenever I try and use the sort option it just removes all the products. It'll say \"500 items\", then I click sort price low to high and it changes to \"7 items\"...",
      "replyDate": "2023-12-04T17:49:12.403Z",
      "replyText": "Hi, we are always looking to improve the experience for our users, and really appreciate the feedback. If there is anything specific we can look into, please contact us at https://rb.gy/pucp3f.",
      "version": "6.47.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "f8daaaae-f4af-44a2-83c2-4bf1f044d496",
      "userName": "Joshua M",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUew8S4DJBOa-carDzllPIXWjsluoGyEI4A6R_Gq-HMYO5S",
      "date": "2023-11-19T19:57:53.596Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=f8daaaae-f4af-44a2-83c2-4bf1f044d496",
      "title": null,
      "text": "I hate that my favorites get lost. there is a favorites tab but it doesn't show my favorite items. is it so hard to save the items I favorite in a tab by themselves without constant changes happening and shifting around what the seller is adding. I don't care. keep a separate tab in the app solely for the items favorited. why are they getting lost? what's the point of favorites when I gave to go back into the shop and look for them?",
      "replyDate": "2023-11-20T15:13:02.100Z",
      "replyText": "We’re sorry to hear you’ve been experiencing some issues with the favorites tab. You can try to restart your device and also clear the cache for the app. If that doesn’t help, we invite you to contact us here: etsy.me/contactsupport with your account details and relevant screenshots. We’ll work with you to resolve this issue as quickly as possible.",
      "version": "6.47.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "bb61fbf2-af85-4066-b75a-ebbb2d13d6b6",
      "userName": "Z Syed",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXlBdTY80z0-tqesvLKKWI7JzaBctBYHk2Do0XPx5ToDv0",
      "date": "2024-02-09T11:06:35.462Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=bb61fbf2-af85-4066-b75a-ebbb2d13d6b6",
      "title": null,
      "text": "Needs some fixing. Once orders have shipped, etsy does not display what date you actually placed the order, you must check your email for that. Also the search engine results are a mess. It makes the results way too general based on your keywords and doesn't have any way to mark the listings you have already seen, so it takes forever to shop. Overall not as advanced as other apps",
      "replyDate": "2023-09-24T18:25:32.485Z",
      "replyText": "Thank you for your valuable feedback. We appreciate these comments from the Etsy community, as we collect insights for future adjustments. Kindly let us know what updates or changes you would like to see in our app. Stay safe!",
      "version": "6.52.1",
      "thumbsUp": 34,
      "criterias": []
    },
    {
      "id": "7e569ee1-f7d7-4213-b949-843bbd369e68",
      "userName": "susan rowsey",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKxbCVxnxRlgwbtACOIV0pAOtpPNlEg-N9MAjUJjBPe=mo",
      "date": "2023-11-27T21:29:20.878Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=7e569ee1-f7d7-4213-b949-843bbd369e68",
      "title": null,
      "text": "Love the products! App stinks b-c can't see all my purchase details on ONE page to confirm choices before I push Send! Considering these are often Non-refundable, Personalized items, Etsy format stinks. I've not purchased items after spending agonizing time making personalized selections. I hate using the app, so typically head to AMAZON out of frustration. Take a hint, Etsy! AND by the way, I want to know What Country I'm buying from BEFORE I purchase. That's my prerogative. App needs work.",
      "replyDate": "2023-11-28T20:40:19.295Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "3bdbfddd-bc31-4ea0-907d-cd29e91a2e2c",
      "userName": "Sean McDonald",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVntV-5SuxiQd9V63nipdzVRtZAjrsox0DZCQlDZ0m45Q",
      "date": "2023-11-03T13:42:14.498Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=3bdbfddd-bc31-4ea0-907d-cd29e91a2e2c",
      "title": null,
      "text": "Etsy has really lost its mind in the last few years. Shipping prices are generally unreasonable and cause me to change my mind on purchases quite often. The biggest issue is the app itself. I get several notifications AND emails every day, even though I've changed my notifications settings. At this point it's harassment and I'm deleting the app. Leaving this review here because there's no support for this topic in their help center and no way to give feedback. RIP Etsy",
      "replyDate": "2023-11-11T20:39:41.700Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.45.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "a40e525f-8318-42c7-a19e-447dc1f0d9bf",
      "userName": "Justin Acker",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUoX4yllag1WR3I97okeW2nfZFkPFB-lE8np7rPVyovZqdW",
      "date": "2023-11-11T19:05:59.912Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=a40e525f-8318-42c7-a19e-447dc1f0d9bf",
      "title": null,
      "text": "The fact that Etsy supports purchasing digital downloads such as PDFs via a smartphone app, but then those files cannot be downloaded from that same app without using a desktop web browser, is unacceptable. What if I didn't own a computer? I can't even open Etsy via a web browser on my phone and get them that way because all links redirect to open in the app. There is also no notification when purchasing that a second device will be required. Scam behavior.",
      "replyDate": "2023-11-11T20:19:03.445Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.46.0",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "f968f1a6-de05-463e-800a-0367f70f2291",
      "userName": "Erica Hartman",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUoy6IRW2EN_djNoCV-0voTsS9mfJqkxpTSPyjA3Ze7Qg",
      "date": "2023-11-28T06:47:21.369Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=f968f1a6-de05-463e-800a-0367f70f2291",
      "title": null,
      "text": "Used to be able to favorite things instantly from someone's shop by tapping the heart on the top right of a listing but that feature was removed for some reason, now making me click on each listing to see if I've added it to my favorites already. Please put this back. Edit: Alright the newest version is just one of those \"if it ain't broke don't fix it\" cause all these changes are terrible. Why are the updates from your followed shops under the favorites tab? Stop trying to slap deals in my face",
      "replyDate": "2023-11-27T17:11:07.130Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "71338b0c-d7bb-40fb-9f48-5f8181a428db",
      "userName": "Sara Elizabeth",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVQCOW1qGA8Q9JVQ81Mn_paP6X4GBC-0pp-EJPfYcag1JI",
      "date": "2023-11-03T12:08:21.719Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=71338b0c-d7bb-40fb-9f48-5f8181a428db",
      "title": null,
      "text": "I do like the app BUT one thing that I really hate is the notifications. Your only choice is on or off. The pop up ads notifications get old and I'd love to turn them off. But if I turn them off, I don't get notifications about messages and my items being shipped. They make it look like you have the option to turn it off but you don't.",
      "replyDate": "2023-11-27T17:31:41.119Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.45.0",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "f8303598-4379-4653-8417-c72d35c29195",
      "userName": "Kitsu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW5t1f1DfIfeWNidCMwvFuw2AXB6yfCqp-7C-NhxnxPEys",
      "date": "2023-11-13T19:46:41.990Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=f8303598-4379-4653-8417-c72d35c29195",
      "title": null,
      "text": "App is good but it doesn't let me claim PDFs from it (have to go to browser version) and sometimes it resets to the homepage, example: was out of the app for a bit, jumped back to it when I wanted to continue browsing my search but it went back to homepage. It's a minor thing tho, overall very good and I've done purchases with no problem so far.",
      "replyDate": "2023-11-15T19:02:10.942Z",
      "replyText": "Thanks for taking out time to rate us. It really helps us to keep going and delivering the best. If you experience any dissatisfaction, please contact our customer care at https://rb.gy/pucp3f.",
      "version": "6.45.0",
      "thumbsUp": 17,
      "criterias": []
    },
    {
      "id": "78fddb35-0519-4406-b521-5de36c100361",
      "userName": "Keith Runge",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI8PGlqarCrzlxkxpCwVuXVdq-q3I8tC6VRfeWPUP8=mo",
      "date": "2024-01-01T19:19:09.595Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=78fddb35-0519-4406-b521-5de36c100361",
      "title": null,
      "text": "Please stop the app from stealing media focus every time I scroll past a video! I'm sure I'm not the only one listening to music or podcasts while browsing, it's a very frustrating experience to have everything pause. In fact I'd prefer to be able to toggle autoplay off also.",
      "replyDate": "2024-01-02T19:49:57.101Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.52.1",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "91097744-72bf-4e1f-ae6a-7d31e9a06f9f",
      "userName": "Logan",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIjddeZZKOypSMaMt36w1TUv4w9OtMMjQQkQjyv-mFF=mo",
      "date": "2023-10-21T19:52:46.717Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=91097744-72bf-4e1f-ae6a-7d31e9a06f9f",
      "title": null,
      "text": "The prices are all completely misleading, making the price filters worthless. Every listing I go to that has something affordable, it ends up that the lowest price option is actually an overpriced gift bag, and the actual product is $30-$60. It's impossible to find smaller stores and non-luxury items because of people adding bullcrap options to the product like empty giftbags or 'consultations' that masks the real price. I end up having to search social media sites for people's stores instead.",
      "replyDate": "2023-10-21T20:12:22.387Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.43.0",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "082540f2-b4fa-4dc4-9df2-c5b7847a3388",
      "userName": "Teshigi Smith",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWBDqf7GVPYKgP535odzqPjYQabxtu90bAcMmeIzAatlME",
      "date": "2023-12-12T23:57:15.809Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=082540f2-b4fa-4dc4-9df2-c5b7847a3388",
      "title": null,
      "text": "There needs to be a way to filter out unwanted content. I only got the app to purchase a cosplay print book from a cosplayer I follow, and yet my deals section was populated with nude/suggestive figurines. I don't need to see that. Clicking on it to try and find a \"do not recommend\" option just adds it to your history. You have to go to a browser just to delete that history. Plenty of other sites have hide or don't recommend options. Etsy needs that.",
      "replyDate": "2023-12-13T17:10:31.907Z",
      "replyText": "Thanks for taking out time to rate us. It really helps us to keep going and delivering the best. If you experience any dissatisfaction, please contact our customer care at https://rb.gy/pucp3f.\n",
      "version": "6.50.1",
      "thumbsUp": 40,
      "criterias": []
    },
    {
      "id": "126cb84a-4c1d-49b2-97ea-a6f4d2aad13c",
      "userName": "Jessa T (JadedNightwing)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVxLQrnx64u98gmtdW4kPPUV8vydZUWQp2rjdPCQ6gXvJ0",
      "date": "2023-11-15T20:49:58.471Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=126cb84a-4c1d-49b2-97ea-a6f4d2aad13c",
      "title": null,
      "text": "I enjoy the marketplace of Etsy, but the app has a few flaws - my primary complaint is that the order page doesn't list every item in a perchance, leading to duplicate perchances which is a headache for both buyers & sellers. the only way to see a full itemized list is on the website - not even the confirmation emails have the full perchance list",
      "replyDate": "2023-11-15T20:57:46.527Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "0ef7c731-0065-4eca-9d52-62586772b5aa",
      "userName": "Paul Nido",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUo4zYa4qONx_ILiyJU6ZlNO4XN8tcScxyhlrZSmPEcNxo",
      "date": "2023-11-29T01:40:00.323Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=0ef7c731-0065-4eca-9d52-62586772b5aa",
      "title": null,
      "text": "I rarely buy through Etsy, but only a few days after making some purchases, I've begun receiving unsolicited text messages for some website I've never been to (makesy). I don't know if it's Etsy or the vendors, but I'm certain one of them let out my phone number. Besides these purchases, I haven't had any other online transactions recently.",
      "replyDate": "2023-11-29T17:48:13.524Z",
      "replyText": "Hi, we're sorry to hear that and we would love to take a look at the issue. Please reach out to our customer support team at https://rb.gy/pucp3f.",
      "version": "6.47.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "fbd54d64-c6bd-49f9-8414-217db533180c",
      "userName": "j ****",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjULL2g6cityzaiN88F3Y6GLzEXBUK7Wr_JhmUQYOKX2mpuH",
      "date": "2023-10-30T16:23:03.895Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=fbd54d64-c6bd-49f9-8414-217db533180c",
      "title": null,
      "text": "Ordered a gift for a friend. Initially, I had no idea what the item was called, but of all the items on the site, I found the name of a similar one and from there, the item was easy to find - using the visual search capabilities of the site (search tools). In addition, once I placed my order, I was kept apprised of the order's progress and was informed when it was delivered/received. This was a welcome added touch. Finally, being a 1st time buyer I was requested to verify my ID info when . . .",
      "replyDate": "2023-10-06T13:15:40.670Z",
      "replyText": "Thank you for taking the time to write this review. Your kind words encourage us greatly. If you experience any dissatisfaction, please contact our customer care at https://rb.gy/pucp3f. Happy shopping!",
      "version": "6.44.0",
      "thumbsUp": 7,
      "criterias": [
        {
          "criteria": "vaf_phase1_loyalty_program",
          "rating": 3
        },
        {
          "criteria": "vaf_apps_category_food_and_drink_v2",
          "rating": 2
        }
      ]
    },
    {
      "id": "ca8c1f54-c691-4d22-be62-6ea6c7008fb8",
      "userName": "Joan Piwowar",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLXBgwR5ZnuAwVCyHkvpMRk1ZHCqH6B73NNsfpkgg0K=mo",
      "date": "2023-10-26T14:26:56.926Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=ca8c1f54-c691-4d22-be62-6ea6c7008fb8",
      "title": null,
      "text": "Can't see my favorites anymore. I have an android phone. On and off for several months, my favorites will not show up. Either nothing happens or a message of \"oops something went wrong \", appears. The only way I can see them is to delete the app and reinstall it. Oh, and I update the app whenever notified.",
      "replyDate": "2023-11-23T17:04:13.479Z",
      "replyText": "Hi, we are sorry that you faced an issue. Could you please share your contact details with us on https://rb.gy/pucp3f so that we can get in touch with you and resolve the issue.",
      "version": "6.44.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "789eb14c-dc73-4ac4-b021-cd6c125b9134",
      "userName": "Bill Reveile",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW6DkPlcBAqN1jEIf3xf02QDT9ewiKxC4oXj2Qu-NV9wq0",
      "date": "2023-11-24T17:53:49.140Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=789eb14c-dc73-4ac4-b021-cd6c125b9134",
      "title": null,
      "text": "Uninstalling for two reasons and I don't use it much anyway. 1. It won't let me turn off \"suggestion\" notifications without turning off order notifications. 2. I don't want to rate or review my orders or their sellers but the app will not clear my notifications unless I do so. We can't leave feedback for Etsy on the website or in the app. I left a lousy review for some poor vendor because I didn't want to leave a review at all, then I couldn't delete it or edit it after I tried. Who does this?",
      "replyDate": "2023-11-24T20:11:04.282Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "3a159fc8-9039-4b0b-9756-6e3367b18fba",
      "userName": "Monkey Barrel",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKt7_1phbcVfSRYUC_6AwEqDmiS-6ZR3_QpJxn5z_mm=mo",
      "date": "2023-11-05T04:50:06.338Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=3a159fc8-9039-4b0b-9756-6e3367b18fba",
      "title": null,
      "text": "The app works fine, but what a shame that it's still not a good shopping option. I came back to purchase on etsy after I believed they had learned their social lesson. But they STILL aren't a safe shopping option. I put together an order over $120 and tried to purchase. Then I noticed my bank account was going to be charged DOUBLE the amount of my order. I had to contact my bank to report the issue. What a shame that etsy can't be utilized safely. Do better folks.🤷",
      "replyDate": "2023-11-05T19:25:45.746Z",
      "replyText": "Thank you for your valuable feedback. We are always looking to improve the experience for our users. Kindly contact our Support team using this link etsy.me/contactsupport and provide specific issues that we can check on further. Rest assured that we'll assist you right away! Thank you and stay safe!\n",
      "version": "6.45.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "c3ea7a44-de51-4a2a-b4bc-6b6aa764ff76",
      "userName": "Taunya Rodgers",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWdx7MdwjJOS4vOwD8dJpQf0Dur-OODb4xeiQCCwC3ONrZa",
      "date": "2023-12-07T10:43:54.680Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=c3ea7a44-de51-4a2a-b4bc-6b6aa764ff76",
      "title": null,
      "text": "I did like it a lot until they added the auto video play that I can't turn off. It stops my music every time I come across a video. Please either tell me how I can turn this off or you need an update giving us the ability to turn it off. It has become so annoying that I don't even want to shop on Etsy.",
      "replyDate": "2023-12-07T20:22:13.419Z",
      "replyText": "Thanks for your feedback. We’d like to know the details of the problem you mentioned. Please send the details or screenshot to https://rb.gy/pucp3f. We'll pass it along to our development team and see if there is any way we can improve it.",
      "version": "6.47.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "07645d16-5424-47ca-b024-ce70c3aa6534",
      "userName": "Robyn Wironen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXwZiW9CCDWOWnbrZ26Bo0c-F_ZJ6HCxBat_WVewJZJvQ",
      "date": "2023-11-29T17:32:36.770Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.etsy.android&reviewId=07645d16-5424-47ca-b024-ce70c3aa6534",
      "title": null,
      "text": "I am having quite a bit of trouble getting pdf files that I purchase from sellers. I am having to reach out to each one and request that they send the file to my personal email instead of through the app. This is certainly inconvenient to them and myself. Something within the app has changed, and it's not working like it used to.",
      "replyDate": "2023-11-29T19:59:31.806Z",
      "replyText": "Thank you for providing this feedback and we're sorry for the inconvenience that this has caused you. Kindly contact our Support team using this link etsy.me/contactsupport regarding your concern so that we can check on it further. Thank you and stay safe!",
      "version": "6.47.0",
      "thumbsUp": 4,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CmoKaApmMCwxMDAwMDAwLjczMDU2MTE5NjgsMzcwODc0NzQwMTc5LCJodHRwOi8vbWFya2V0LmFuZHJvaWQuY29tL2RldGFpbHM_aWQ9djI6Y29tLmV0c3kuYW5kcm9pZDoxIiwxLGZhbHNl"
}