{
  "data": [
    {
      "id": "8d885702-81e2-47c0-b1ed-50d1b99374ef",
      "userName": "Dixie Ensminger",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIXHnsal0azqaJpEimUuuiKbkdrSuPY05vO065_3IHj=mo",
      "date": "2024-03-17T17:11:58.192Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=8d885702-81e2-47c0-b1ed-50d1b99374ef",
      "title": null,
      "text": "At this point I can't get passed the screen that's green with a white $ in the middle. Can't click anything. All started after updating. They claim its my device which is a newer device and was just fine until yesterday. I try to access online, but I don't get anywhere. I call and they keep saying the same thing. Update I called to close account, and the gentleman I talked to said it wasn't my phone and sent it higher up. Update again they reached out and are working on it.",
      "replyDate": "2024-03-17T19:47:45.895Z",
      "replyText": "We understand how important it is for you to use your Cash App account properly, Dixie. Ensuring our customers receive the support they need is a top priority for us. Our team would be glad to take a look at this with you, just write in here: http://help.cash.app/3128 - we’ll investigate right away.",
      "version": "4.38.0",
      "thumbsUp": 70,
      "criterias": []
    },
    {
      "id": "3d196712-51dc-49d6-bb37-0219d4c6de2c",
      "userName": "Referral Code: 7KG4FLF",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVdsTxRq9XAjmUsmHo_AwZUqtLjrPWialdSDNEB23WVRA",
      "date": "2024-03-13T05:51:05.662Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=3d196712-51dc-49d6-bb37-0219d4c6de2c",
      "title": null,
      "text": "Easy to use app to pay or request money and keep track of everything. Easily displays your accumulated balance, which can be easily transferred to your bank account. If there are no or insufficient funds, you simply withdraw them from your connected bank account. What I don't like is that I don't like to see other people's transactions between your connections, which means others can also see mine, so you need to be careful with your transaction descriptions or change your privacy settings",
      "replyDate": "2024-02-05T19:58:57.735Z",
      "replyText": "Thank you for the review, Dustin. The security of your account is our priority, and we can ensure that your personal data will not be shared. You can learn more by checking out this article: https://cash.app/security. If you need assistance, you can contact us directly with this link: https://help.cash.app/3128.",
      "version": "4.38.0",
      "thumbsUp": 2315,
      "criterias": []
    },
    {
      "id": "67dbe654-8ba4-4f43-bd73-d93ed3429e28",
      "userName": "Iso line",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXQYpVWou4Op1xHjDk_lji7oy8IjPrKXJphNQRwu7Pl0sY",
      "date": "2024-03-15T18:45:36.606Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=67dbe654-8ba4-4f43-bd73-d93ed3429e28",
      "title": null,
      "text": "I'm in the US yet this app continuously says \"cash not available in your region\" extremely inconvenient when it happens randomly without rhyme or reasoning. (Added later) I don't wanna go to support literally every time the app doesn't work right, just make an app that works 100% of the time. Venmo doesn't have this problem. Maybe yall could take some notes from them.",
      "replyDate": "2024-03-15T18:26:18.533Z",
      "replyText": "Hi Iso, thank you for taking the time to make this comment. We certainly understand that this is not the best situation for you. We would like to take a deeper look at what's going on and be able to give you further information, you can easily reach us using this link: https://help.cash.app/3128.",
      "version": "4.38.0",
      "thumbsUp": 116,
      "criterias": []
    },
    {
      "id": "63dedc76-f2c5-491f-9ce9-80095550ef0d",
      "userName": "Stone Frangowlakis",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWZTwUJP0ihaBaZRWpxIfiSrGm6G--HKd4VaOdsJf-Hmrs",
      "date": "2024-03-01T00:47:17.256Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=63dedc76-f2c5-491f-9ce9-80095550ef0d",
      "title": null,
      "text": "Great services, not great customer service. Things I enjoy about the app are the automatic round-up savings, interest-earning savings account, overdraft protection, the \"Borrow\" feature, and ease of sending and receiving money. Unfortunately things I cannot recommend this app for, in particular, is paying for hotels that have security deposits (that are later supposed to come off, but take forever), and the customer service via Chat, which was frankly rude despite my attempts to be courteous.",
      "replyDate": "2024-03-01T02:14:50.444Z",
      "replyText": "We understand the importance of your funds and how inconvenient it can be when you don't receive the support that you were expecting. Feel free to read this article for additional info on temporary authorizations: https://cash.app/help/us/en-us/6483. You can also contact us again if needed: https://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 815,
      "criterias": []
    },
    {
      "id": "f8910725-b8ad-413c-a33d-d36605dbfe28",
      "userName": "Daniel Miller",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJtPDXQ_pYiUUX2AjK1YcxCyNQbP6ET5LarguADskTf=mo",
      "date": "2024-03-10T00:37:56.490Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=f8910725-b8ad-413c-a33d-d36605dbfe28",
      "title": null,
      "text": "Best online money app I've ever used. Even though they take a dollar every time you put money on your card through a store or transfer it from your cash app to your bank it's a small price to pay for the very non-restrictive limitations otherwise in play. I absolutely adore the ability to lock and unlock the account at my own will. That is very \"clutch\" at repelling those extra or repeat charges for subscriptions you don't really want to be a part of but sometimes forget to cancel.",
      "replyDate": "2024-03-11T20:59:22.312Z",
      "replyText": "Hey Daniel, thank you sharing your experience about how you feel with Cash App. We hope you never need it, but always feel comfortable using this link to get in touch with us if you ever require assistance: https://help.cash.app/3128.\n",
      "version": "4.37.0",
      "thumbsUp": 420,
      "criterias": []
    },
    {
      "id": "88a52453-9e1a-4387-aec9-5c8d8b46d9b8",
      "userName": "Chrys Duzan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVkJ43AVSjeAPfpDh-nxfYi7DHFkVkfd5SuI_FoXsWTijo",
      "date": "2024-03-05T06:51:50.172Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=88a52453-9e1a-4387-aec9-5c8d8b46d9b8",
      "title": null,
      "text": "Pretty good app, my credit is shot to the point I generally can't find many banks that will allow me to open an account thanks to a former guardian opening several credit based accounts in my name that I haven't been able to fix just yet. However if I don't update the app, which I have to do manually as I'm never on wifi due to rural living, the app absolutely bugs out. Crashes, lag, and especially transferring to savings. I have no pin set for transferring in, and I still have to use my pin.",
      "replyDate": "2024-03-05T22:16:23.751Z",
      "replyText": "We realize how concerning it may be for your app to not work properly, Chrys. Please be sure you’re using the most up-to-date version of the app as well as the most recent version of your phone’s operating system, you can always access your account from a computer by visiting Cash.me. Please don’t hesitate to write: http://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 338,
      "criterias": [
        {
          "criteria": "vaf_phase1_auto_insurance",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_home_insurance",
          "rating": 2
        },
        {
          "criteria": "vaf_phase1_tracking_stocks",
          "rating": 1
        }
      ]
    },
    {
      "id": "dd996f64-e268-41ce-8870-86d3bc3de166",
      "userName": "Kyle Strickland",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVTYT6D1PcfBxLMMl0qofXv1tDeaFWpDDLsSbBCrAIeSHI",
      "date": "2024-02-27T23:36:10.698Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=dd996f64-e268-41ce-8870-86d3bc3de166",
      "title": null,
      "text": "All and all pretty solid app. It does what its supposed to do, with little to no . For some reason though the app shortcut dissapeared from my screens..meaning i cannot access it with ease of clickjng the icon. My brovada shortcut did the same thing at the same time but those are the only 2 apps that have done that which leads me to believe the issue is connected. I have to open up playstore, search cash app, select cash app and then im good . Extremely inconvenient & annoying",
      "replyDate": "2024-02-28T00:06:23.526Z",
      "replyText": "We know how inconvenient this situation with your app can be, Kyle. There are a few troubleshooting steps we’d recommend trying: delete the app and reinstall it. Also, make sure you’re using the most recent version of your phone’s operating system. If you are still having trouble, contact us here: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 159,
      "criterias": []
    },
    {
      "id": "d04ee3d6-89cc-4f70-9b49-7cf7fc56d0cb",
      "userName": "Sheyla Owens",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUakaYnCPgZBcEd527zMcB5PY_mPayfkWM55XewYbBSQU4",
      "date": "2024-03-17T03:02:15.818Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=d04ee3d6-89cc-4f70-9b49-7cf7fc56d0cb",
      "title": null,
      "text": "I was going to help a family member so I installed. The setup was easy. I will give the app that much. I sent to the family member and somehow, there were about five transactions on my account - not one even though I only did the transfer one time and the transfer was declined so my family member didn't get what they needed. I am now having to keep a very very very close eye on my account because of this. This was very inconvenient. I will uninstall if this issue becomes a big problem.",
      "replyDate": "2024-03-17T19:43:11.640Z",
      "replyText": "Hi Sheyla, this is definitely not the experience we want you to have, and we know how important your funds are. Our team wants to take a deeper look into this and help clarify what happened. Can you please get in touch with the Cash App team right away? http://help.cash.app/3128.",
      "version": "4.38.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "4cd8fc18-5b83-43b8-8e7b-f56f14a1551c",
      "userName": "Stephen DiBenedetto",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL8mATRMmZGxzE9bDqgBuGZjG237hXBY5FSJKYSRu2N=mo",
      "date": "2024-03-07T19:58:30.847Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=4cd8fc18-5b83-43b8-8e7b-f56f14a1551c",
      "title": null,
      "text": "Excellent app for financial payments and transfers. Simple, easy to use and efficient. I give 3 stars and not 5 because I think now that they have done a good job in the checking account industry they should take the next step and offer a card or a system to help build credit. That was one star deduction and the second star deduction is because when there is fraud or someone hacking Into your account, customer service is basically non existent and they need to do more to correct issues with it.",
      "replyDate": "2024-03-07T20:44:29.730Z",
      "replyText": "Thank you for taking the time to share your experience with us, Stephen. We understand you may not have received the assistance you were expecting in the past, but we're happy to help how we can from here. If you ever need assistance or have any feedback, please don't hesitate to contact us, here: https://cash.app/contact\n",
      "version": "4.36.0",
      "thumbsUp": 29,
      "criterias": []
    },
    {
      "id": "34888cea-8bb3-418f-9aa1-973a57b5a82c",
      "userName": "Megan Beaver",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU21wEquCWt-S4i8gaLtaDbONWozCa2vm075QQLEMRhPw",
      "date": "2024-03-04T17:29:26.530Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=34888cea-8bb3-418f-9aa1-973a57b5a82c",
      "title": null,
      "text": "Fairly good money app. Easy to use to add or transfer money however the customer service is absolutely awful. I have never had any major issues with the app till recently. Customer service reps border on the line of being rude and condescending. I have been trying to have my name changed (since I got married) for a month now. Any time I inquire I am told it's being worked on and thats all they can say.",
      "replyDate": "2024-03-04T21:16:46.225Z",
      "replyText": "Hello Megan, we hear that your experience with our customer service was not as desired. We'd like to know more about what exactly you're referring to. Can you please get in touch with the Cash App team right away? You can reach out through the available options here: https://cash.app/contact",
      "version": "4.36.0",
      "thumbsUp": 110,
      "criterias": []
    },
    {
      "id": "3112b511-6386-4fe9-9bbc-0178dcf881f8",
      "userName": "Referral Code- 7KG4FLF",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU70HfPFG0p9X4qnf9h_0t0Gdc4Q2hHM6EIriG8e1mnuw",
      "date": "2024-03-08T06:10:03.523Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=3112b511-6386-4fe9-9bbc-0178dcf881f8",
      "title": null,
      "text": "Cashapp makes all my electronic transfers and transactions simple and easy. It's great for setting aside a personal savings account and it's great that it doesn't rip you off with all the fines, fees and maintenance costs like so many other financial institutions and services. The small but secure exclusive Crypto, E-Coins and Bit Stock trading capability within the app is a great way for someone who has no experience in the entire Crypto Coin Wallet scene. It would be to be able to transfer.",
      "replyDate": "2024-03-08T22:34:04.524Z",
      "replyText": "Thank you so much for taking the time to provide us with this great feedback, Milton. We are happy to see that you are enjoying Cash App! Keep in mind that we're just a message away in case you need our help: https://cash.app/contact.",
      "version": "4.37.0",
      "thumbsUp": 199,
      "criterias": []
    },
    {
      "id": "eb7b5fbb-cf70-4d94-b248-41d44292e753",
      "userName": "TheonlyGodOfDragons",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUjx9JigudlN60Sk3gyHhk6A1LBnXBBPR3ZMQxMskN2MVY",
      "date": "2024-03-03T23:26:48.342Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=eb7b5fbb-cf70-4d94-b248-41d44292e753",
      "title": null,
      "text": "Amazing app everything is great in almost every way however if you do have a problem customer service is not helpful in the slightest most of the time they are automated and don't even know what to say except the script put in front of them however I think they should add more to the savings account like different spots to save for different things and not just saving for one thing at a time.",
      "replyDate": "2024-03-04T00:03:22.963Z",
      "replyText": "Hi there, we appreciate your feedback, and understand you may not have received the assistance you were expecting. We are working hard to improve our customer service. Don't forget that we're here if you ever need our help: https://cash.app/contact - we can assure you that you'll always be provided with genuine human interaction.",
      "version": "4.36.0",
      "thumbsUp": 80,
      "criterias": []
    },
    {
      "id": "e12ca436-c456-4d91-8ed3-cb714a466902",
      "userName": "Brian",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIpKxehZ0FsQOXK7FF-uw1PcI1itwtz67S1TsZD7CTq=mo",
      "date": "2024-03-06T23:33:21.739Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=e12ca436-c456-4d91-8ed3-cb714a466902",
      "title": null,
      "text": "it is a good all around app with new features and really makes it simple to send and recieve money. The only issue I have is when a old account can't be accessed if you have lost all access to the account and you can't get back to it unless you verify with the email that you can't get into because of loss of email access or the phone number that you might not have any longer.. other than that it's a GREAT APP",
      "replyDate": "2024-03-06T23:53:43.409Z",
      "replyText": "Hi Brian! We understand how important it is for you to have a solution about this matter. We noticed that you weren't able to gain access into your account due to this inconvenience. To help you ASAP please reach back to us through this link https://cash.app/contact, and we will be happy to help you.",
      "version": "4.36.0",
      "thumbsUp": 108,
      "criterias": []
    },
    {
      "id": "afe46bae-f7eb-423f-96fd-d4f4ea2cedb4",
      "userName": "Referral Code- 921CWQ4",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUBqspMZO2mtlTSW_ZFbHQNACK6Vr51lpC9soUrtVUADw",
      "date": "2024-01-15T09:35:56.951Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=afe46bae-f7eb-423f-96fd-d4f4ea2cedb4",
      "title": null,
      "text": "This app is so great. I’ve been a member of Cash app for a REALLY long time, and have had nothing but mostly good experiences. However, this latest update is pure rage fuel. Every time I put the app in the background even for a split second, it takes me back to the top of my feed. If I open a reel to watch it, I cant back out of it without it going to the top of my feed and then I lose the rest of the reels, or have to scroll endlessly to get back to them. This \"feature\" has GOT to go.",
      "replyDate": "2024-01-15T23:08:27.122Z",
      "replyText": "Hi Jhariya, thanks for sharing this review. We're glad to hear you're enjoying Cash App, but we'd like to know more details about the feature you mentioned, so we can help you. Feel free to contact us here: https://cash.app/contact.",
      "version": "4.29.0",
      "thumbsUp": 1643,
      "criterias": []
    },
    {
      "id": "6ee318e2-9278-4fe6-a2a4-d4557d9a6c05",
      "userName": "Referral Code- 7KG4FLF",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVuLfLbHpKH4vfVIJedongczFqr56ctyZbQ6mgTMw1_eA",
      "date": "2024-01-28T07:38:26.205Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=6ee318e2-9278-4fe6-a2a4-d4557d9a6c05",
      "title": null,
      "text": "The app could be a little easier to use and has a few glitches from time to time, but otherwise it's a great app to use and it's convenient because it keeps all your cards in one place and you can use them all from one place. It would be better if they offered tap and go service, and if it didn't cost as much to send money to new pickups as cash in a store! But it has some cool features that similar apps don't have, like offering beneficial organization creation and package tracking.",
      "replyDate": "2024-01-28T15:07:27.356Z",
      "replyText": "Thank you so much for sharing your feedback with us, Katty. We're happy to hear that you find Cash App convenient and easy to use. If you have any questions or need any assistance, please don't hesitate to reach out through any of these channels: https://help.cash.app/3128.",
      "version": "4.31.0",
      "thumbsUp": 1514,
      "criterias": []
    },
    {
      "id": "ebe73f9d-0031-48d7-bd7c-919f8ef0a2e1",
      "userName": "Brazen Stackhouse",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLy6WP0X9twp8sszYsdzq1EGMyjo76KyvJN7bK-2aSU=mo",
      "date": "2024-01-17T23:02:57.488Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=ebe73f9d-0031-48d7-bd7c-919f8ef0a2e1",
      "title": null,
      "text": "Love this app, it is so convenient and fast most of the time. My only complaint; for those of us that religiously use this app and it's instant cash feature, it would be better if they offered a 'premium' option, where the instant cash fees would be waived for a few bucks a month. I'd gladly pay that and I'm sure others would too. I know you can get a card and not pay the fee but I don't need anymore cards haha. If this was changed the app would be almost perfect.",
      "replyDate": "2024-01-17T23:07:27.304Z",
      "replyText": "Hi there, we’re always looking to improve our products based on our customers’ feedback and we enjoy hearing from you about how we can make Cash App as useful as it can be. At this time we do not offer the merchant information. If there is something we can improve, and you want to tell us about it. Please contact us: http://help.cash.app/3128.",
      "version": "4.29.0",
      "thumbsUp": 317,
      "criterias": []
    },
    {
      "id": "87aa3aca-de24-4fb2-9001-dd61af4b1ace",
      "userName": "trista",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVJ-PK0LXxDMISgA40tEcUwQTHaLWmhNFTEglLep7nNAf6V",
      "date": "2024-03-18T09:55:57.433Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=87aa3aca-de24-4fb2-9001-dd61af4b1ace",
      "title": null,
      "text": "Does even work sucks! This app used to be okay but all of a sudden about 2 weeks ago just stopped I pressed the the app and it just shows up a black screen with the cash app logo. Can't even get into it and I can't even get a hold of customer service. when the app was actually working customer service never got a hold of me to fix certain issues I can't even get a card with them! Customer service doesn't even know how to get me a card five people said.",
      "replyDate": "2024-03-18T21:19:14.134Z",
      "replyText": "Hello Trista, thank you for taking the time to make this comment, we certainly understand that this is not a desirable situation, we would like to provide you with more assistance, we kindly invite you to reach us using this link: ,https://help.cash.app/3128 so we can continue working by your side.",
      "version": "4.38.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "8b16115f-b879-45e5-9ec2-371f4f5d301e",
      "userName": "stapler 2",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXuUIyMRpEzMrN2c28XsatTrgQTFmygPG8qxeryQpMlvfvn",
      "date": "2024-02-06T21:26:47.517Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=8b16115f-b879-45e5-9ec2-371f4f5d301e",
      "title": null,
      "text": "So I've noticed that any tiny amount left in my card keeps disappearing. For example, I had eight dollars, saved that for a while, went to see, and money is down to 0. I get paid through the cash app from work, so it's pretty unfair. I always pay back when I can, when I barrow, and there's a setting for that I pay manually. I've also checked any subscription, but they all get paid, and I don't owe it. So either cash app thinks I don't know, I have a bit of money left and takes it.",
      "replyDate": "2024-02-06T21:45:06.867Z",
      "replyText": "We understand how troublesome it can be to be missing your money. This is not the experience we want you to have. We want to ensure you get the assistance you need. Please allow us to take a look into this for you. You can find all the different ways to reach out here: https://help.cash.app/contact",
      "version": "4.30.0",
      "thumbsUp": 627,
      "criterias": []
    },
    {
      "id": "0523a677-d4bc-482a-afc9-afdadae1deeb",
      "userName": "Bri'elle Ruskiewicz (Bri Parks)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgcj2-etAhrnWANH80nJDnixqf5OvGAeI2yWqQ4HmP0xI",
      "date": "2024-03-13T16:17:41.979Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=0523a677-d4bc-482a-afc9-afdadae1deeb",
      "title": null,
      "text": "ever since they made an actual customer support team, cash app is everything a person unable to get a bank could hope for as far as paperless, quick convenient wireless transfers, direct deposits, tax refunds (with free tax filling!!) and atm withdrawals, Bitcoin, stocks and investing options& guidance., plus now even offering overdraft and paycheck advances! cashapp surely has grown and evolved since I first had signed up for this company in 2012!! & so far, still easily my goto default",
      "replyDate": "2024-03-13T19:22:53.570Z",
      "replyText": "Thank you for this great rating, Bri'elle. We are happy to see that you are having a great experience with Cash App. If you have questions or need help, you can reach out through our contact options here: https://help.cash.app/3128.",
      "version": "4.37.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "04bd5875-651a-436d-9928-1a1b5ca39499",
      "userName": "Referral Code- 921CWQ4",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVqmnli1u7bOIab9XPfqyQnQJVfObwPbbWxkOdf0gAnvA",
      "date": "2024-01-19T17:39:53.832Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=04bd5875-651a-436d-9928-1a1b5ca39499",
      "title": null,
      "text": "Great! For the past couple months, this app has simply worked. Loading in at any given time will show a black screen with the loading circle, but nothing loads. Either that or it will show the last tweets you looked at and not refresh them or allow you to go into the replies. You can't go in your dms or search or anything else, it will just be frozen on each tab. Refreshing the app does not help and it doesn't load sometimes until 10-30 minutes later. This happens multiple times a day as well.",
      "replyDate": "2024-01-19T21:57:37.918Z",
      "replyText": "Hi Masheera, we suggest you some troubleshooting to follow: use the most up-to-date version of the app also the most recent version of your phone’s operating system - this usually resolves the issue. If you need further assistance with it or anything else, you can contact us through this link: https://help.cash.app/3128.",
      "version": "4.30.0",
      "thumbsUp": 574,
      "criterias": []
    },
    {
      "id": "8e107aab-1344-40bb-9d62-a2811751b37b",
      "userName": "Mark Engelberg",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUal0iqSuIEDtRyc8n5Obn6vyZyEvpNAbkl0DkZ_qvD-A",
      "date": "2024-01-17T19:16:59.183Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=8e107aab-1344-40bb-9d62-a2811751b37b",
      "title": null,
      "text": "Well designed UI, higher than average fees on ATM withdrawal and bitcoin buy/sell orders, responsive customer support. The most significant bug I've encountered is that the app often ignores the security settings, allowing access to the app without a PIN, even when my settings clearly state that access should require a PIN. The most significant missing feature is that it doesn't allow you to link more than one bank.",
      "replyDate": "2024-01-15T19:22:03.510Z",
      "replyText": "Hi Mark, we understand that fees is never welcomed, and we can certainly take a look here. Our current fees are always listed in our Terms of Service: https://squ.re/cashapptos. If you have further concerns, feel free to reach out to us here: https://cash.app/contact.",
      "version": "4.29.0",
      "thumbsUp": 188,
      "criterias": []
    },
    {
      "id": "1fae9fbf-46ea-4db1-ab53-1cec63204fa8",
      "userName": "Jason Michaels",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIcAHaCr2QYAdZdYGeiN6-M2iEo8LLFJ5hmSCoRVAYE=mo",
      "date": "2024-02-05T08:58:27.393Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=1fae9fbf-46ea-4db1-ab53-1cec63204fa8",
      "title": null,
      "text": "Extremely easy to use. Even filled my taxes for the first time ever with this app and got my full return plus $248 I didn't know about! They didn't shut my account down for having a negative balance for 2 months, paid it off no fees at all. Only one issue. I file said taxes on a different device and no longer have that email address. I cannot get to my tax documents. I feel like they would shoot me to keep me from my own paperwork! Great security for sure but sheesh.",
      "replyDate": "2024-02-05T20:13:56.837Z",
      "replyText": "Thanks for taking the time to share your experience with us, Jason. We know how important it is for you to file your taxes. Our team will be willing to give you a better help, please feel free to contact us to solve your issues:http://help.cash.app/3128.",
      "version": "4.32.0",
      "thumbsUp": 369,
      "criterias": []
    },
    {
      "id": "841f5bf2-1b18-4514-bbd4-b2dfe3c2b8a3",
      "userName": "Joseph U",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVBnOBgyxAGKbvJj4oaQdhAqyWNXuVs2okmYGiA_VpLhRM",
      "date": "2024-01-18T15:29:33.100Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=841f5bf2-1b18-4514-bbd4-b2dfe3c2b8a3",
      "title": null,
      "text": "For stocks, the app does not update the UI properly after showing notification that something is bought or sold. To make it worse, there is no way to force a refresh. So while I know a trade went through, I am stuck with a UI showing (invalid) pending orders and the only way to update is to force close the app and reopen it. Edit: Dropping the rating to 1 star because 2 version updates after I reported the issue, the app still crashes when displaying a long list on a particular screen.",
      "replyDate": "2023-11-15T23:34:32.489Z",
      "replyText": "Hi Joseph. We understand how important it is for you to have clarity about this situation with your stocks. We would like to take a closer look at this, and see what's going on. So please, contact us here: https://help.cash.app/3128, and we will be happy to help you.",
      "version": "4.29.0",
      "thumbsUp": 104,
      "criterias": []
    },
    {
      "id": "7e9b6765-d359-4c7d-9a30-45e2783a7176",
      "userName": "Cori Olvera",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWpbsGI4-xj2JALp0QKbyZq1zXgpXS9QTbXcTSntxwYcDk",
      "date": "2024-03-02T16:46:25.989Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=7e9b6765-d359-4c7d-9a30-45e2783a7176",
      "title": null,
      "text": "Beware! This app functions well with small transactions but I recently made a large transaction and the money was deducted and posted to my bank account within minutes. For 4 days now I haven't been able to use my bank account because cash app still has a pending charge hold on my account. I've not been able to pay bills or anything due to the large deficit in my account. Called customer service and was told, 'I've already told you this is not on our end, I'm ending this call\". RUDE!",
      "replyDate": "2024-03-02T19:44:50.691Z",
      "replyText": "We're disappointed to hear you had this experience. We'll do everything we can to get your concerns sorted out for you, Cori. Could you please provide more details about this situation with our team? Feel free to contact us, so can investigate this issue ASAP: https://cash.app/contact.\n",
      "version": "4.36.0",
      "thumbsUp": 85,
      "criterias": []
    },
    {
      "id": "cf95c898-d7c2-43d9-a9b3-e31b4227d7b6",
      "userName": "m3 trik",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW4-iLhGUxeP_ciWHCMzlFcHnZ9x9VqZGvC68bqQ-xALmI",
      "date": "2024-02-28T15:06:18.609Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=cf95c898-d7c2-43d9-a9b3-e31b4227d7b6",
      "title": null,
      "text": "BEWARE; expect bottom of the barrel customer service. First the chatbot responded with nothing more than a single \".\" after having me go through a bunch of preliminary steps, including transferring money to cashapp. Then in the morning, while politely trying to handle the issue over the phone, they gave a response that was difficult to understand (because of the language barrier), and then promptly hung up! Twice!! I've used the other cash transfer apps for years without a single problem.",
      "replyDate": "2024-02-28T12:42:31.918Z",
      "replyText": "Hi there, we understand how important it is for you to receive assistance with your $70. Ensuring our customers receive the support they need is a top priority for us. We'd like to take a deeper look for you. You can get in touch with us here: http://help.cash.app/3128.",
      "version": "4.35.0",
      "thumbsUp": 272,
      "criterias": []
    },
    {
      "id": "2e5d2e6f-b1ea-4dd7-a707-ffc424204b0b",
      "userName": "Dave Hill",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIzAqy1fNpzlK84Ma3xLocyI8cRs1UVN-QUlNJdtYzC=mo",
      "date": "2024-01-26T03:03:58.341Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=2e5d2e6f-b1ea-4dd7-a707-ffc424204b0b",
      "title": null,
      "text": "Love trading with the app. Site/App is simple to use, and it rarely crashes. This is a very cool and perfect app. The most user-friendly cryptocurrency exchange to date. I've tried a few, and they can be challenging to use because of how difficult it is to meet their payment requirements merely to acquire some cryptocurrency. So far, it's great! It can be bothersome that the app is updated frequently and that each update causes it to stop functioning until a new version is downloaded and install",
      "replyDate": "2024-01-27T15:46:20.697Z",
      "replyText": "We're delighted to hear that your experience using Cash App has been a good one, Dave. We are working every day to improve our services. Don't forget we're always here to help if you need us: https://help.cash.app/3128.",
      "version": "4.31.0",
      "thumbsUp": 277,
      "criterias": []
    },
    {
      "id": "31bc2f07-9f14-428a-85ca-de9545d9d2a2",
      "userName": "Mike Shipman",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVy1903ZToKvcFcpNlAzzedP7sB6CvmExBlsVoHnGmFfg",
      "date": "2024-02-06T04:01:22.717Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=31bc2f07-9f14-428a-85ca-de9545d9d2a2",
      "title": null,
      "text": "THE BEST way to monitor your credit status with two of the three credit bureaus. Immediate notification if a credit inquiry is made. FASTER than the paid service I WAS using and more precise in the details. The features also keep track of your auto loans and home loans. Also keep track of your car's value. Special offers from credit card companies and promotional offers. It is updated frequently with email notifications that something has changed in your report. Sometimes even daily changes.",
      "replyDate": null,
      "replyText": null,
      "version": "4.32.0",
      "thumbsUp": 261,
      "criterias": []
    },
    {
      "id": "09af30d7-1dee-4178-a7df-92af769ba125",
      "userName": "Chris “Vectrexer” Romero",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVRNtiNr02-QFYKL8avsUG5aq8zrjxH4GgBUjAwsMMiaWEZ",
      "date": "2024-02-17T01:21:54.970Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=09af30d7-1dee-4178-a7df-92af769ba125",
      "title": null,
      "text": "CashApp is a platform who's mobile interface feels really disjointed. As if they were adding on features as they were going but didn't think about the way they were doing it. Another annoying aspect about the platform is the fact the web interface has some serious limitations. Notably the ability to accept a payment using the web interface. The platform needs improvement. And so does the app!",
      "replyDate": "2024-02-17T20:38:25.556Z",
      "replyText": "Thank you for the feedback on this, Chris. We've made quite a few changes with all of them aiming to improve the overall experience of the Cash app. We'd love to hear more of your opinion around these changes. Can you write in to us? https://cash.app/contact",
      "version": "4.34.0",
      "thumbsUp": 97,
      "criterias": []
    },
    {
      "id": "5f5ae5a9-e93d-4b93-9b58-5e06be506350",
      "userName": "Pritam Raj",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgzCQoFI_1qHizGHujBG_JMEWUW45X33cKKK1Y4siimA",
      "date": "2024-01-19T17:04:41.732Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=5f5ae5a9-e93d-4b93-9b58-5e06be506350",
      "title": null,
      "text": "Fine. I am extremely felt confused. The last update mixed up my ability to open links in the app when sent to me by friends...ie, from fb or reels. I've tried everything under the sun to fix this, and nothing is working. I've always been able to open links sent to me in messages within whatsapp. I've reached out to whatsapp help and no solution or help. You guys created a ticket but no response! I don't want to have to delete the app and reinstall bc I refuse to backup my chats to Google!",
      "replyDate": null,
      "replyText": null,
      "version": "4.30.0",
      "thumbsUp": 48,
      "criterias": []
    },
    {
      "id": "d17b44fe-12bc-4ed0-94af-2e6273a5c473",
      "userName": "Ginger",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKKPcBvTTTZFB-V98BuxAGPF-yaV4ASClFDzPFxSzdd=mo",
      "date": "2024-02-16T22:35:30.723Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=d17b44fe-12bc-4ed0-94af-2e6273a5c473",
      "title": null,
      "text": "A cash deposit was sent to a bank savings account never linked to my cash app account (although the checking acct at that bank had previously linked) instead of the account I selected (for standard deposit, not instant). When I made inquiry about how that could happen, instead of answering the question, they reversed the deposit saying it would go back to my cash app account, but it did not. Customer service is non-existent at this point.",
      "replyDate": "2024-02-16T23:04:26.414Z",
      "replyText": "Hi there. We understand you may not have received the assistance you were expecting. We are working hard to improve our customer service. With that said, we would like to take a closer look at this, so please, contact us here: https://help.cash.app/3128, and we will be happy to help you.",
      "version": "4.34.0",
      "thumbsUp": 119,
      "criterias": []
    },
    {
      "id": "6954f45d-3501-4176-bd1c-a3d9e2cbae2a",
      "userName": "Sandra W",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWYSLVjhqu17xSf8j2iT0_jr3d89IN2y8ffNKNkrlOZCYU",
      "date": "2024-01-28T03:55:03.545Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=6954f45d-3501-4176-bd1c-a3d9e2cbae2a",
      "title": null,
      "text": "I love this app I just wish there were more options to choose from for the recurring deposits such as bi-weekly and every other week and able to choose the day for the automatic deposit. Instead of just having daily, weekly and monthly to choose from. I also see a lot of different store offers on the list. I would also like to see PetCo offer added to the list.",
      "replyDate": "2022-06-09T14:52:38.295Z",
      "replyText": "Hi Sandra. We’re always looking to improve our products based on our customers’ feedback, and appreciate you sharing. We'll be sure to pass this request to the rest of the team. In the meantime, please keep watching your Cash App for new features. If you need help, don't hesitate to contact us: https://cash.app/contact.\n",
      "version": "4.31.0",
      "thumbsUp": 32,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "f7930a0d-fca6-43c6-b12b-cd1e4cf1d521",
      "userName": "Emma Gomez",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXYRzyoGa76QmeqcXQprg_qWro6DKfFDgd5USuQtLv8KkLG",
      "date": "2024-02-21T11:43:31.680Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=f7930a0d-fca6-43c6-b12b-cd1e4cf1d521",
      "title": null,
      "text": "Daily fraudulent attempts with a card that was replaced and reported stolen 2 years ago. And even with all security measures taken, somehow, my account has gone negative even though none of the transactions actually went through. They have all been declined, and cashapp refuses to reimburse me. I've spoken with 2 reps over the phone and 4 reps on the app. None have been able to explain what's going on or fix the issue. Definitely won't be using this app anymore or recommending it to anyone",
      "replyDate": "2024-02-21T20:15:33.193Z",
      "replyText": "Hi Emma, we always welcome customers to provide us with feedback. That way, we can gain a better understanding as to what we can do better and continue to improve. We'd love for an opportunity to change your mind and resolve any issues you may have. Feel free to reach out to us here: https://help.cash.app/3128",
      "version": "4.33.0",
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "44aebc24-fbef-443d-b79d-03dabe4993d1",
      "userName": "Shon J",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLNFo_nL5reTMTnLVrln6sHrKJnuyGvTtdkOzmDsj41gg=mo",
      "date": "2024-02-07T21:06:46.604Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=44aebc24-fbef-443d-b79d-03dabe4993d1",
      "title": null,
      "text": "I've had this app since 2020 and have had intermittent issues throughout that time. Now, no one can find me through the app. I reached out to customer service and was instructed on some measures to take. Needless to say, customer service was unable to help. Not only that, but the last \"advocate\" I chatted with stated this issue was going to be \"escalated,\" referring to a higher level of assistance...only to later state \"I don't have any new info to provide on this issue.\" Let's give Venmo a try.",
      "replyDate": "2024-02-07T21:40:26.890Z",
      "replyText": "Hey Shon, we realize how inconvenient it may be for you not to be found through the app, so we’re disappointed to hear you didn't receive the expected support about it. Our team wants to take a deeper look into this and help clarify what happened, so we can have a second chance to provide you with assistance: https://help.cash.app/3128.\n\n",
      "version": "4.33.0",
      "thumbsUp": 77,
      "criterias": []
    },
    {
      "id": "307653cd-6128-445f-a0b7-de8d4bd1ac49",
      "userName": "Kaitlin Moore",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLRwuHBjsQy9s8w5WR8C0292yq3H1aSVh9bUTlMHS0q=mo",
      "date": "2024-01-23T23:01:54.235Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=307653cd-6128-445f-a0b7-de8d4bd1ac49",
      "title": null,
      "text": "All was going great, until I somehow had a closed banking account linked to my cash app. And even though the account was completely closed, cashapp still allowed the funds to transfer. It's a whole battle now - there are no protections with this company. And instead of helping, they said, \"nope, can't do anything because the funds went through, so good luck.\" I wouldn't recommend this service when there's plenty of others available, like zelle or venmo.",
      "replyDate": "2024-01-23T23:21:17.757Z",
      "replyText": "Hi Kaitlin, we understand the importance of your funds, so we’re disappointed to hear you didn't receive the expected support. Our team would like to take a look at this with you, just write in here: http://help.cash.app/3128 - we’ll investigate right away.\n",
      "version": "4.30.0",
      "thumbsUp": 56,
      "criterias": []
    },
    {
      "id": "b2760234-3b37-464e-9894-1cd0a50f9729",
      "userName": "Jennifer Koch",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVaeeRxS8pZiQQVtKwXDnHSq4aqK5SBRiNwQ-36yHZZwqBy",
      "date": "2024-03-15T20:53:45.912Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=b2760234-3b37-464e-9894-1cd0a50f9729",
      "title": null,
      "text": "Been using CashApp for 5 years now, and I'm typically very satisfied with the app and services provided. However, recently, the service/app is totally useless because I can't add cash to my account. For 2 months, I haven't been able to deposit cash into my account regardless of the amount (within allowable limits) or location. Contacted customer service several times, but they have not helped one bit. It's honestly just really frustrating.",
      "replyDate": "2024-03-15T21:36:20.478Z",
      "replyText": "Hi Jennifer, We understand you may not have received the assistance you were expecting. However, we are working hard to improve our customer service. With that said, we would like to double-check your account and see what's going on with your account, so please, contact us here: https://help.cash.app/3128, and we will be happy to help you.\n",
      "version": "4.26.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "d3c39772-000f-42eb-beb2-346240e79a11",
      "userName": "Enter Referral code in Profile section",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUui7WZHyqVkR0FQQ7pQGX3sT2e0VoG1tr19L2BshJFZSo",
      "date": "2024-01-09T12:23:12.862Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=d3c39772-000f-42eb-beb2-346240e79a11",
      "title": null,
      "text": "Absolutely amazing. All the payments that I could possibly want! (I have the premium plan) Edit: I would love it of there was a bug report button or page IN THE APP ITSELF because lately I've been having some pretty big issues. Here are a few of them. my audio will cut out mid song. All of my music will delete and redownload which uses A LOT of my data. I'm not sure if this is a bug but downloaded playlists will take forever to load in. I would put a few more but I'm running out of characters.",
      "replyDate": "2024-01-09T20:21:52.884Z",
      "replyText": "Hey Sriparna, we are not quite sure if you are having issues with your Cash App account, but we want to help you in case you are. Feel free to reach out to us on Facebook (@SquareCash) or X (@CashSupport) every day from 5 a.m. - 7 p.m. PT. Alternatively, you can write in using this link: https://help.cash.app/3128.",
      "version": "4.26.0",
      "thumbsUp": 841,
      "criterias": []
    },
    {
      "id": "af45eda3-4683-4853-ae6a-1f228b991443",
      "userName": "Enter Referral Code For 5 USD Bonus",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUfvhDk_hwoxaiO2DkKEflS15HUX9PT4BOrVCMpY6fg",
      "date": "2024-01-09T12:15:11.300Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=af45eda3-4683-4853-ae6a-1f228b991443",
      "title": null,
      "text": "Great. I enjoy sending money, chats, and stories with friends, but all the updates continue to suck. As of today, the creepy AI character can no longer be hidden from my chats and is the top \"person\" listed. I wish I could delete the character from my friends list completely. The public stories being suggested are annoying and not something I want to watch. Picking a filter is always an issue because as I scroll through them, it disappears or stops on a random one and won't let me change it.",
      "replyDate": null,
      "replyText": null,
      "version": "4.26.0",
      "thumbsUp": 636,
      "criterias": []
    },
    {
      "id": "eb2afcfa-6c72-43da-838d-7e1a6e7c8216",
      "userName": "Jeremy Moore",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ2etXDjQOibPATBWUOA_GrK6pnIfZuJ161Zw29Enw3=mo",
      "date": "2023-12-23T15:00:31.346Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=eb2afcfa-6c72-43da-838d-7e1a6e7c8216",
      "title": null,
      "text": "The service is great, an amazing convenience. You are able to add money at any time, anywhere, and almost any amount. (Everyone has limits due to liabilities.) The only thing is security could be just a little tighter. As far as like when you have a charge that pops up and it's the first time, there should be a two step verification. They do after a few times. My case they hit 3 times equal to $1200.00 before it was flagged. Overall amazing service.",
      "replyDate": "2023-12-23T15:48:39.869Z",
      "replyText": "Hello Jeremy, the security of your account is our priority, and we can ensure that your personal data will not be shared. You can learn more by checking out this article: https://cash.app/security. If you need assistance, you can contact us directly with this link: https://help.cash.app/3128.",
      "version": "4.26.0",
      "thumbsUp": 1030,
      "criterias": []
    },
    {
      "id": "ae50b17d-0403-4a3f-9c6f-d53f1b3aa474",
      "userName": "CashApp Referral Code- L8CFRGL",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWrP53jWL_aAPVleCdpu8wZO2aYMv0nV1DX2EOzsdd6zA",
      "date": "2024-01-03T12:09:45.762Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=ae50b17d-0403-4a3f-9c6f-d53f1b3aa474",
      "title": null,
      "text": "Awesome app. This is a great app with many offer but you only get 6 skips and hour (I think) which is so annoying. It also removed the heart for liked songs into a plus sign which I don't like, Please change that back if possible. The app also told me once that I can't choose any more songs and will have to come the next day to play songs of my choice. This app irritates me so often. Most of the songs either show \"We don't have lyrics for this one\" or \"Unable to load lyrics\" something like that.",
      "replyDate": null,
      "replyText": null,
      "version": "4.26.0",
      "thumbsUp": 465,
      "criterias": []
    },
    {
      "id": "a5e9c9ab-3eb5-48e3-9dc5-4617b5541a91",
      "userName": "USeeMe Parks",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW6wx7otIPA22D1mVMMjOPx6ray2uVG8FMvMuAd1U2cvik",
      "date": "2024-01-08T21:34:16.590Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=a5e9c9ab-3eb5-48e3-9dc5-4617b5541a91",
      "title": null,
      "text": "Stalling issues!! I was perfectly fine with this app but lately(maybe a month or so) it has been having a difficult time loading. I've uninstalled twice & still can't get into the app. Frustrating to say the least! Re: In response to the developer... I have the app set for automatic updating, that isn't the issue but thank u. Update 1/8....ive gotten use to uninstalling & reinstalling. DON'T WASTE UR TIME, this app is not getting better. Bring back the old, I had not one issue with it.",
      "replyDate": "2023-11-22T13:29:59.883Z",
      "replyText": "We realize how concerning it may be for your app to not work properly. Please be sure you’re using the most up-to-date version of the app as well as the most recent version of your phone’s operating system, if you need more assistance contact us here: https://cash.app/contact and we will be happy to help.",
      "version": "4.26.0",
      "thumbsUp": 315,
      "criterias": []
    },
    {
      "id": "49f6895a-6573-41c1-80f2-cf1a14eefb18",
      "userName": "Dustin Luzan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUxf6kdcU-GD4R5--fUoPKX5a2RkWKqYafxsFUkgp2zUg",
      "date": "2023-12-24T17:44:37.898Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=49f6895a-6573-41c1-80f2-cf1a14eefb18",
      "title": null,
      "text": "Great service for moving money, getting paid, and bridging the gap between crypto and standard currency. I only subtracted 1 star because the lack of function description (only picture icons) means there is a bit of a learning curve to overcome before you are fully comfortable using the app. When it comes to handling money, many people are hesitant to push buttons whose functions are unknown.",
      "replyDate": "2023-12-24T18:51:42.989Z",
      "replyText": "We’re always looking to improve our products based on our customers’ feedback, Dustin, and appreciate your sharing. We'll be sure to pass this request to the rest of the team. If you ever need assistance or have any other comments, please don't hesitate to contact us here: https://help.cash.app/3128.",
      "version": "4.26.0",
      "thumbsUp": 622,
      "criterias": []
    },
    {
      "id": "c14621a0-433c-4ecb-82d1-0f790a78caea",
      "userName": "Leland",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUNEAIi_OxMgruPIb0LvP2omJbkjkagP99Gv7Jo0MY1sGmE",
      "date": "2024-01-10T02:14:02.226Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=c14621a0-433c-4ecb-82d1-0f790a78caea",
      "title": null,
      "text": "Difficult to use. Cannot transfer to multiple accounts. Be careful, they trick you by showing \"instant\" at the bottom with a fee making it look like your transfer is set to instant. If you select it thinking it's an option for the transfer it immediately selects instant and they steal a huge fee. That's they're way of tricking you into using the fee based. Scammers.",
      "replyDate": "2024-01-10T19:06:37.845Z",
      "replyText": "We recommend using the app with the same caution you would with physical cash. We don't like to hear that you didn't receive the assistance expected, our team wants to take a deeper look into this and help clarify what happened. You can reach out here: http://help.cash.app/3128.",
      "version": "4.26.0",
      "thumbsUp": 153,
      "criterias": []
    },
    {
      "id": "44cb53e1-89c4-4384-a8f8-23bf73f4c63e",
      "userName": "Eric Markley",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXOnpAs8i8fTgBBrDnNgYDTib2QOto6w6iLg1P5IJ0IWA",
      "date": "2023-10-10T17:01:19.797Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=44cb53e1-89c4-4384-a8f8-23bf73f4c63e",
      "title": null,
      "text": "CashApp is the best, easiest, most simple card you can get. It's better than any debit card you can get, there's no hidden fees, they don't charge you to add money, they don't charge any monthly fees, it's free, and the App is simple and easy to use and navigate, and there's so many useful features. Savings Account, Regular Account, send and receive money to others with cashapp or send and receive money from other banks too. Plus you can customize your card when you order it. Def. Recommend it!",
      "replyDate": "2023-10-10T17:19:49.131Z",
      "replyText": "We’re so glad to hear you’re enjoying Cash App and appreciate you taking the time to leave this nice review, Eric. If you ever need assistance, we’ll be here to help at: https://help.cash.app/3128. Have a wonderful day!",
      "version": "4.15.0",
      "thumbsUp": 1729,
      "criterias": []
    },
    {
      "id": "5d3c1c77-7abf-477a-86ae-bc080d80a66e",
      "userName": "Jennifer Kuenzig",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVM4NGtG_YcKv1ZHiP0KosqtD7-Vpt2gJkTJjtUGaSP8UY",
      "date": "2023-10-16T16:58:37.603Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=5d3c1c77-7abf-477a-86ae-bc080d80a66e",
      "title": null,
      "text": "very handy and easy to use. one good thing is that you can transfer into cashapp instantly from your debit card without a fee. PayPal charges a fee for instant transfers. the problems are; you can only attach 1 bank account, 1 debit card, and 1 credit card (instead of multiple, like PayPal/ Venmo). Also, there's always a fee to withdraw at atms, unless you get direct deposit (even if they're in-network atms).",
      "replyDate": "2023-10-16T21:06:45.976Z",
      "replyText": "Hi Jennifer, we’re always looking to improve our products based on our customers’ feedback, and appreciate your sharing. We'll be sure to pass this request to the rest of the team. If you'd like to tell us more or address an issue you’re experiencing with your account, please reach out here: https://cash.app/contact.",
      "version": "4.16.0",
      "thumbsUp": 262,
      "criterias": []
    },
    {
      "id": "c05c9360-06de-45cd-969c-5396550a77c7",
      "userName": "MJ O'keeffe",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVZZEk5wqR2m9Gvu2RXclxN-Cn8VzimKOzIXnX5TuQ7uoA",
      "date": "2023-11-26T21:22:00.487Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=c05c9360-06de-45cd-969c-5396550a77c7",
      "title": null,
      "text": "If I could rate 10 stars I would. I can't say enough good things about Cash App! I use it for all my banking needs. I get paid 3 days early, I save money with roundups, my ATM fees are reimbursed and now I have $50 free overdraft protection! Love this app more than PayPal or Venmo. So easy to send and receive $. No waiting for verification or anything. And almost everyone is on cash app. Super easy to look people up whether or not they are on your contact list",
      "replyDate": "2023-06-06T16:46:39.997Z",
      "replyText": "Thank you for this great rating. We are happy to see that you are having a great experience with Cash App. If you have questions or need help, you can reach out through our contact options here: https://help.cash.app/3128.",
      "version": "4.22.0",
      "thumbsUp": 1301,
      "criterias": [
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_phase1_payday_loans",
          "rating": 3
        },
        {
          "criteria": "vaf_phase1_auto_investing",
          "rating": 3
        }
      ]
    },
    {
      "id": "94354cd0-0837-4212-9fa8-2a0290103c9c",
      "userName": "Matthew Calder",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWF1v-nqaQKguMVpjJ0rtItDFOMVTMgiWwV1jfWPMvXZzhT",
      "date": "2024-01-27T21:08:32.692Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=94354cd0-0837-4212-9fa8-2a0290103c9c",
      "title": null,
      "text": "App is one of the worst if these kinds. Someone sends you money, does not let you select which account to send it to. Trying to track down where the money is headed us a pain. Support is limited. Adding accounts has been a bit difficult at times. Basically if you want to send money back and forth with someone, go with a different app, lot better ones out there. Update: Cash app still has not resolved the issue. 1/27/2024. Article provides no help to the issues.",
      "replyDate": "2022-12-20T23:55:28.585Z",
      "replyText": "We hear your concerns Matthew, and we're here to help. There are 2 options to deposit funds: Instant can be made to your linked debit card and Standard go directly to your bank account. Check out this article for more details:http://help.cash.app/1012. We'd be glad to have a look at this with you. Feel free to contact us: https://cash.app/contact.\n",
      "version": "4.17.0",
      "thumbsUp": 137,
      "criterias": []
    },
    {
      "id": "aad5b6f3-c2cb-4b2f-a5ce-642781ceaff0",
      "userName": "Ian Davis (Snakeman)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVsMkupnMUe4pn89IyX4kTZIXa6q36MWie_aOMcX0zpKwMQ",
      "date": "2024-01-11T13:01:42.310Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=aad5b6f3-c2cb-4b2f-a5ce-642781ceaff0",
      "title": null,
      "text": "VERY simple money App. If you think Venmo is confusing, cash app is perfect for your mentally disabled kids to use as it has very few features and options. You can't really screw it up. Unless you try to deposit money into your bank. Then it doesn't tell you which bank it's going to and you have to find the list of attached banks and I guess it takes from the one on top of the list. Weird why they won't tell you which account before you hit send.",
      "replyDate": null,
      "replyText": null,
      "version": "4.26.0",
      "thumbsUp": 118,
      "criterias": []
    },
    {
      "id": "be264c22-7009-470d-88a4-e6a5180de6d9",
      "userName": "Joe Jacob",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ8nPN_cdeTvNw8hKOMOd-mFKUEttff_P6ZJL_I8BVs=mo",
      "date": "2024-01-15T20:31:59.395Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=be264c22-7009-470d-88a4-e6a5180de6d9",
      "title": null,
      "text": "Would be 5 stars because it's very easy to use and rarely have I come across any issues regarding it. However it doesn't allow me to send money to certain people with a pop up saying payment cancelled for my own protection, even when I verified it was whom I was needing to receive my payment. Have been able to in the past until one day I just couldn't anymore. I can send, it'll say pending until they accept and once they do it is cancelled.",
      "replyDate": "2024-01-15T21:01:48.536Z",
      "replyText": "Hi Joe, thank you for sharing this with us! Occasionally a Cash App payment will be returned to the sender as part of our ongoing commitment to keeping the app safe and secure for all our customers. If you've had ongoing trouble then we'd definitely like to take a closer look with you. Just get in touch here: https://help.cash.app/3128",
      "version": "4.23.0",
      "thumbsUp": 99,
      "criterias": []
    },
    {
      "id": "4c8bdae1-b164-47d3-b971-eae9a14b5305",
      "userName": "Carrie Kignak",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLrXCtPs1NebSWiEtrfqpPzZ0GYfCXherFDth6f-sGl=mo",
      "date": "2023-10-20T19:02:15.897Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=4c8bdae1-b164-47d3-b971-eae9a14b5305",
      "title": null,
      "text": "Delays \"instant\" transfers that they charge for, closes accounts without explanation and essentially tells you to quit reaching out with your question;when I persist they say they can't find a reason. It was nice and dandy for the first 2 years with minimal issues but now with a 'new owner' or whatever, it's completely wrong and essentially has false advertising about it being a convenient tool. It'd be easier if they advertised it as a cash trash, lose your money here.",
      "replyDate": "2023-09-29T21:18:01.989Z",
      "replyText": "It’s important to us that we improve to make your experience better, Carrie. We'd like the opportunity to take a closer look at those instant deposits and your account if it has been closed so we can assist you further with this situation. Feel free to contact us here: https://cash.app/contact.",
      "version": "4.16.0",
      "thumbsUp": 318,
      "criterias": []
    },
    {
      "id": "17e831f8-8b75-48de-abc0-0693a010f691",
      "userName": "brian jacoby",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLuWjMWGu-xQCWXrblXmfMEK-dl3aBLiPlLYzQNAYMk=mo",
      "date": "2023-10-26T02:56:23.393Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=17e831f8-8b75-48de-abc0-0693a010f691",
      "title": null,
      "text": "I've been very happy with the app in the past, but some things just do not seem to function correctly. The search transaction bar has been very flaky lately. Sometimes it works other times, it doesn't. There have been multiple days during the last few months where you will have to go 48 hours straight with malfunctioning send cash errors. I hope they get this stuff under control because I believe these bugs are fixable. I think this is a great banking app, otherwise.",
      "replyDate": "2023-10-26T13:16:41.496Z",
      "replyText": "\nHey Brian, certainly this sounds strange, we'd recommend making sure that your device's operating system is up-to-date. If needed, you can always access your account from a web browser at Cash.app/. If you're still having trouble, just message us here: https://help.cash.app/3128\n",
      "version": "4.17.0",
      "thumbsUp": 1545,
      "criterias": []
    },
    {
      "id": "ed81f702-a3c5-4421-af8b-7e9ca914043c",
      "userName": "Akina Shino",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWt7NtGLTjBsSjOVkTIcu2zvBuATzztmnjTVbua35b-Pw",
      "date": "2023-11-03T03:32:53.220Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=ed81f702-a3c5-4421-af8b-7e9ca914043c",
      "title": null,
      "text": "I use this app sparingly, maybe 4-5 time a month if that. However, there's one technical issue I've been having for awhile now. Everytime I attempt to put more money in, red lettering pops up saying there is a \"connectivity issue\". I've used data and Wi-Fi to try and get it to work. I've uninstalled and reinstalled, but that hasn't helped either. I almost can't use it at this point.",
      "replyDate": "2023-11-03T14:23:39.572Z",
      "replyText": "Hi Akina. We understand how important it is to have clarity about this for you. Our team has resolved the connection issues affecting payments. If any payments or actions taken in-app have failed, you can reattempt them at this time. If you have further questions contact us here: https://help.cash.app/3128.",
      "version": "4.18.1",
      "thumbsUp": 1102,
      "criterias": []
    },
    {
      "id": "c3b3a2a7-ff13-40a8-8024-c038e4b64bb7",
      "userName": "Pamela Dixon",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUrPewXNslybTseESxQwd8xayiJcyAbMG08hCakb5de9-g",
      "date": "2023-11-11T07:06:53.645Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=c3b3a2a7-ff13-40a8-8024-c038e4b64bb7",
      "title": null,
      "text": "It's not a perfect app, but it works for me with what I need to do, sending funds back and forth. Cash App is good for transferring small amounts, but if you are cashing out larger sums and you need it instantly, then the instant fees can be a bit pricey. Overall, it's been a very helpful app! No more trying to locate a moneygram or WU anymore!",
      "replyDate": "2023-11-11T14:21:39.377Z",
      "replyText": "Thanks for the kind post, Pamela. If you have questions or need help, you can reach out through our contact options here: https://help.cash.app/3128.",
      "version": "4.18.1",
      "thumbsUp": 465,
      "criterias": []
    },
    {
      "id": "71366b5f-aeaa-40a9-9fac-f5cd2c503aff",
      "userName": "Charles Ramirez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIR-7-_a_5L-FI5xZaGe-l1OItUmOO4iGBHFAOBOgDrMw=mo",
      "date": "2024-01-10T02:00:24.820Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=71366b5f-aeaa-40a9-9fac-f5cd2c503aff",
      "title": null,
      "text": "I like the card customization feature, but it feels like some unfinished demo because it feels like it's missing a few much needed settings. You can draw stuff onto your card, but for some reason in stead of being able to erase mistakes, they only gave a delete last action button. You can't change the color or size of the drawing tool, and there's no option to add various resizable shapes (can't draw perfect shapes by hand). It also really should have the ability to insert custom images as well.",
      "replyDate": "2024-01-10T20:00:27.406Z",
      "replyText": "Hello Charles, it’s good to read your feedback in order to improve the services and processes like the card customization. We always want to reach your satisfaction. Please remember that we are always near to you if you need us, you can contact us through https://help.cash.app/3128.\n",
      "version": "4.26.0",
      "thumbsUp": 74,
      "criterias": []
    },
    {
      "id": "0a8f03e9-11e8-45a5-bf6e-c90ad4f1ddee",
      "userName": "Sir Spanksalot",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWKTXxddE9ZfexfrT33dAE5TGSHNjMgfY4dZl9rCCpZXfwy",
      "date": "2024-01-01T06:53:04.319Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=0a8f03e9-11e8-45a5-bf6e-c90ad4f1ddee",
      "title": null,
      "text": "I bet 90% of you people that have left negative feedback haven't updated your app and have been having problems. The problems I have had in the past were corrected when I updated. The newer people having problems I don't know for sure since I'm not a tech or programmer. The app is not useless you people are just impatient. Update.. I have two accounts I can send money to but I never know which one it will go to. There should be a button for that. I am getting very upset with that issue.",
      "replyDate": "2024-01-01T22:17:07.785Z",
      "replyText": "Thank you for taking the time to share your experience with us. If there is something we can improve, and you want to tell us about it. Don't hesitate to talk to us through this link: http://help.cash.app/3128.",
      "version": "4.26.0",
      "thumbsUp": 163,
      "criterias": [
        {
          "criteria": "vaf_never_display_ease_of_use",
          "rating": null
        },
        {
          "criteria": "vaf_never_display_ads_experience",
          "rating": null
        }
      ]
    },
    {
      "id": "08377c73-4f68-44dd-9219-060014ef51b6",
      "userName": "Miriam Torres",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV0bFES1DFytrMP8unoieayqzhJ0VeiFGZ3ry01XHo3ijU",
      "date": "2024-01-04T11:46:50.216Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=08377c73-4f68-44dd-9219-060014ef51b6",
      "title": null,
      "text": "After over a year of usage of the app, my account was abruptly deactivated. I've already submitted a support ticket and they've taken approximately a month or over a month to address the issue. I did ask for updates about the case and failed to do so on more than one occasion. I haven't changed any usage of my account so it was puzzling to say the least and it's frustrating that their support team can't provide an answer after asking more than one time for an update. This is ridiculous",
      "replyDate": "2024-01-04T18:15:03.899Z",
      "replyText": "Hey Miriam, we understand that your account was closed and know the situation is a frustrating one. If you'd like more information, please review our Terms of Service: http://squ.re/1HSv2Ss. Also for further assistance, please reach out through the available options here: https://cash.app/contact.",
      "version": "4.26.0",
      "thumbsUp": 162,
      "criterias": []
    },
    {
      "id": "fadec5a3-2d4f-4950-bc56-52036b0cb2d0",
      "userName": "Linda Barker",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLcP1xgXTOMoNlOaNrrKTgjm7AkVZ881z1SM4i9dlla=mo",
      "date": "2023-10-17T15:56:32.449Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=fadec5a3-2d4f-4950-bc56-52036b0cb2d0",
      "title": null,
      "text": "Lately, I have uninstalled to install the app in hopes it will work properly. I've cleared the cache, powered off my device & still I receive the notice that \" something went wrong please check your connection\" with the options to \"(close or try again)\". I've tried both options and still the app will not load. Please fix this issue as this is causing a financial burden for me.",
      "replyDate": "2023-10-17T19:53:40.787Z",
      "replyText": "Apologies for the trouble, Linda. Cash App had some connection issues, but our team has sorted everything out. Payments that were pending should have been completed on their own. If you have further questions or are still experiencing this issue, please feel free to contact us here: https://cash.app/contact.",
      "version": "4.16.0",
      "thumbsUp": 208,
      "criterias": []
    },
    {
      "id": "5bd2f665-cf3c-4628-ad70-ba68a3cfb8f1",
      "userName": "Brandon Twidwell",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI9buMsP-9EzIg08i630CNGGUAKQRm4v2L4FaXF9V1g=mo",
      "date": "2023-11-28T02:31:44.324Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=5bd2f665-cf3c-4628-ad70-ba68a3cfb8f1",
      "title": null,
      "text": "I used cash app for years. I've never had a negative experience up until recently. All of my transaction histories and people that I have done transactions with have disappeared from my account. My stock history has vanished. It shows I've made one transaction with the entire account and it saved one favorite. It's an absolute mystery as to why it seems 99% of all my data with this app including the past stock trades have just up and vanished. It's saddening and overall extremely disappointing.",
      "replyDate": "2023-11-28T02:58:25.809Z",
      "replyText": "Thank you for sharing this with us. It's never ideal to have issues with the app, Brandon. We’d like to better understand the issue you’re experiencing, so we can help you. Feel free to reach out to us on Facebook (@SquareCash) or Twitter (@CashSupport). Alternatively, you can write in using this link: https://help.cash.app/3128.",
      "version": "4.22.0",
      "thumbsUp": 714,
      "criterias": []
    },
    {
      "id": "e6eedd55-95f0-420c-ae08-602ba29c9250",
      "userName": "ONIKING",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXjDfNm-WXxnUkI6w9ACghratdeOvB0Q0wN-DYRlAZ-c5R7",
      "date": "2024-01-04T16:15:37.131Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=e6eedd55-95f0-420c-ae08-602ba29c9250",
      "title": null,
      "text": "A bug (I hope?) I keep experiencing is when I transfer money to my savings, the total amount doesn't update. I have no idea where the money went and I'm really concerned about that. for ex: I took out $86 from $370 in savings leaving me with $284. Spent $4 and sent the rest of the money back to my savings but the total in my savings is still reading $284. I tried reinstalling, clearing the cache, logging out and back in and it still hasn't updated.",
      "replyDate": "2024-01-04T19:17:41.631Z",
      "replyText": "We know how important your funds are, and we'd like to do everything we can to help. Please reach out to us, so we can take a closer look into this for you. You can get in contact through the available options here: https://help.cash.app/3128.",
      "version": "4.26.0",
      "thumbsUp": 83,
      "criterias": []
    },
    {
      "id": "a6ed3641-05a6-4a8a-aa6a-400a75c60715",
      "userName": "arandom_ idiot",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWXDzZA7mBm_1C1J3NA9QfzvWhDIKhU0mxlfVQ7hV0UoQ",
      "date": "2023-12-08T00:21:36.724Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=a6ed3641-05a6-4a8a-aa6a-400a75c60715",
      "title": null,
      "text": "Still won't let me send money. I've already done everything I could do to try to verify my identity, I've linked my phone AND email to it, I've even changed the email it was linked to. I've added a debit card to it as well, and it still says it 'failed' whenever I try to even CLICK the button to verify myself. I've tried to fix this with customer service and they just told me and my sponsor that they couldn't do anything, and overall just wasted our time. Big time waster. Fix this please!!!",
      "replyDate": null,
      "replyText": null,
      "version": "4.24.0",
      "thumbsUp": 540,
      "criterias": []
    },
    {
      "id": "306e6786-56fb-4e87-b22b-70f94b99f6b6",
      "userName": "Jon Green",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLnljZX0g1JuR26g_Gw1QEssBotBAtxiQm4-4v_obep=mo",
      "date": "2023-11-26T23:16:10.751Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=306e6786-56fb-4e87-b22b-70f94b99f6b6",
      "title": null,
      "text": "WORST CUSTOMER SERVICE EVER! UNACCEPTABLE! I HOPE THEY GO BANKRUPT! App processes multiple transactions without warning! App sent 2 transactions, although I only set up 1. The app should be fixed, so it doesn't use 1 confirmation for multiple transactions. The non-customer support through the app and email continually asked for more info for 7hrs. Then they claim they can't help and never once tried to pick up the phone! POOR BUSINESS MODEL!",
      "replyDate": "2023-11-26T14:46:50.160Z",
      "replyText": "Hi Jon, this is not the experience we want you to have. We know how important your funds are. We'd like to know more about what happened here. Mind sending our team a message, so we can make sure you are getting taken care of? http://help.cash.app/3128.",
      "version": "4.22.0",
      "thumbsUp": 380,
      "criterias": []
    },
    {
      "id": "1256bf42-78b6-4d99-bc53-60dc4f8128d0",
      "userName": "Matt Lewis",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLTh4LDbinBSP_7GDN7XmYm4C5uhXHcaZ-ofFiwKrqs=mo",
      "date": "2023-11-01T20:03:31.391Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=1256bf42-78b6-4d99-bc53-60dc4f8128d0",
      "title": null,
      "text": "I really enjoy the simplicity and convenience of this app. The new round up feature is brilliant and I've already saved $9 in a couple weeks. I like having a separate savings account and the goal is a nice feature and well. But I am writing this review today to ask for a folder feature of sorts. Basically sub-savings account withing savings account. A feature where I can put X amount in my bills folder, Y amount in car payment folder, Z amount in my vacation folder. Savings with goals",
      "replyDate": "2023-11-01T23:17:36.188Z",
      "replyText": "We’re always looking to improve our products based on our customers’ feedback, and enjoy hearing how we can make Cash App as useful as it can be, Matt. We'll be sure to pass this request to the rest of our team. If you need assistance please reach us out here: http://help.cash.app/3128",
      "version": "4.18.1",
      "thumbsUp": 182,
      "criterias": []
    },
    {
      "id": "5060a7ef-0a05-4168-b349-50a1beac21c0",
      "userName": "Colleen McCourt",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXBeUxwhhI2aOkdMG5tDvb6sFuMo43C1gP1-UjCFcDj-w",
      "date": "2023-10-18T03:54:44.971Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=5060a7ef-0a05-4168-b349-50a1beac21c0",
      "title": null,
      "text": "Giving 2 stars because after having a verified account for a couple years now, they STILL won't allow me the option of adding paper money to my account. Customer service was absolutely no help when I asked about it either. They just simply left it at \"it's not available to you\". Really sucks because everything else about it is simple, easy, and efficient.",
      "replyDate": "2023-10-18T12:27:20.309Z",
      "replyText": "We know how important it can be for you to access the Paper Money Deposit feature, Colleen. This feature is being rolled out in stages to some customers, but it may be available to you when it's fully rolled out. If you have additional questions about this, please reach out to us: https://help.cash.app/contact.",
      "version": "4.16.0",
      "thumbsUp": 164,
      "criterias": []
    },
    {
      "id": "4f3c022f-7c5f-446d-9161-fe89aecad6be",
      "userName": "Laci Skinner",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIWt4ntrrCtXjde6LE4MQpMSIT0EhTtH8-XKAlEKANZ=mo",
      "date": "2023-10-11T23:04:50.877Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=4f3c022f-7c5f-446d-9161-fe89aecad6be",
      "title": null,
      "text": "This app is normally great. I don't know what happened but now the app won't load at all...just the black screen with the green $. It freezes says app isn't responding....I've done all the tricks to try and fix it but nothing has worked. I've uninstalled and reinstalled, turned device off and on, it's up to date, my phone is up to date....",
      "replyDate": "2023-10-11T23:24:53.192Z",
      "replyText": "This is troubling to hear, Laci. We'd like to take a closer look at what's going on with your account. You can get in touch with us here: https://cash.app/contact",
      "version": "4.15.0",
      "thumbsUp": 124,
      "criterias": []
    },
    {
      "id": "cdba3af1-521b-44d6-a857-ff522c4aa099",
      "userName": "Slaya Isawome",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJojJlirfZFA2Rr1aN9PJgW3yQijan6pAH9cP-m85SU=mo",
      "date": "2023-10-24T12:36:39.565Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=cdba3af1-521b-44d6-a857-ff522c4aa099",
      "title": null,
      "text": "Great app, now release a credit card and add some advanced banking benefits. Cashapp is great but with the growing amount of apps that bring the banking power directly to the user, an app that simply lets you cache your cash is no longer enough. High yield savings, credit building features, credit lines, etc is where it's at. Cashapp could easily be the best if it simply had the features. Make it happen.",
      "replyDate": "2023-10-24T14:35:13.770Z",
      "replyText": "Thanks for posting this review, Slaya. We’re always looking to improve our products based on our customers’ feedback, and enjoy hearing how we can make Cash App as useful as it can be. We'll be sure to pass this request to the rest of the team. In the meantime, please reach out to our team here: https://help.cash.app/3128 if you ever need our help.",
      "version": "4.17.0",
      "thumbsUp": 144,
      "criterias": []
    },
    {
      "id": "4593567a-96a2-47b1-af82-c03ae95fd926",
      "userName": "Caitlin Smith",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUq5nP0_vfzi8H3uA8OHqvugzyoii6iywubo8Qf7d-vwn0",
      "date": "2024-03-15T17:14:01.644Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=4593567a-96a2-47b1-af82-c03ae95fd926",
      "title": null,
      "text": "won't let me sign up for an account because i'm in the UK. just comes up with \"sorry, you're not able to sign up at this time.\" no idea why it's available on the UK play store if we can't even use it. sounds like it would be a good app if it actually worked though. edit: before the automated response says anything, yes i have the most up to date version of the app. yes i tried my mobile and email addresses. yes i know i entered them correctly. the app just doesn't let you sign up.",
      "replyDate": "2024-03-15T18:23:04.741Z",
      "replyText": "We know how important it is for you to be able to sign up, Caitlin. We are always working to improve our services. Our team would be glad to take a look at this with you, just write in here: http://help.cash.app/3128 - we’ll investigate right away.",
      "version": "4.38.0",
      "thumbsUp": 34,
      "criterias": []
    },
    {
      "id": "32c07cd9-a203-4fae-b019-6d7f95d1f2e0",
      "userName": "Jeremy Nicholson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocL5e_SJhM75v0oFkF87bFTs7uI-8-2L9uOa7SpyxWLJ=mo",
      "date": "2024-01-20T18:32:39.562Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=32c07cd9-a203-4fae-b019-6d7f95d1f2e0",
      "title": null,
      "text": "App wouldn't let me sign up from the UK. I entered my phone number and the verification code that was sent. It just says I can't sign up, no explanation, no suggestions what to do. I've cleared my cache, uninstalled, reinstalled, rebooted phone. Still nothing. A truly abysmal customer experience. If they can't even get an app to work, I wouldn't trust them with my bank details.",
      "replyDate": "2024-01-20T18:51:32.880Z",
      "replyText": "Hi there, this is not the experience you want to have, and we don't like to hear that you are having issues signing up. Our team wants to take a deeper look into this and help clarify what happened. Can you please get in touch with the Cash App team right away? You can reach out through the available options here:http://help.cash.app/3128.",
      "version": "4.30.0",
      "thumbsUp": 243,
      "criterias": []
    },
    {
      "id": "95e08004-21bb-4d80-8952-9a5e879f047a",
      "userName": "Andre Smith",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKywbcmTv6nKGjZh5YLGEsyG7U2gKIa4NpE4Q1hmiNg=mo",
      "date": "2024-03-14T00:45:24.422Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=95e08004-21bb-4d80-8952-9a5e879f047a",
      "title": null,
      "text": "This is app is ridiculous. They allow you to have the paper deposit option for two years and then just now that option is not available saying that some accounts are eligible. What does that mean? Its a paper deposit.!! Their customer is not helpful either. Will uninstall!!",
      "replyDate": "2024-03-13T22:44:35.205Z",
      "replyText": "Thanks for providing us with your feedback, Andre. To know more about the terms and conditions for this feature, please contact us: https://cash.app/contact. We are always glad to help.",
      "version": "4.38.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "c2326e1d-d71d-4ee8-b26f-35ddbf4f3686",
      "userName": "Walmart Karen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW4UcEpS0j-FMmuhMZYghpkhSfTnu85u7zW1ie3Dwy-bdM",
      "date": "2024-03-17T14:00:19.135Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=c2326e1d-d71d-4ee8-b26f-35ddbf4f3686",
      "title": null,
      "text": "I don't recommend cashapp at all, I have had my card status on \"preparing order arriving soon\" for TWO YEARS. When I tried MULTIPLE TIMES to get support from cashapp they aren't helpful in the slightest and basically tell me there's nothing they can do. Nothing they can do?? Fix your app and send me my card. I can only use cashapp for online purchases but not physically. And when I transfer money through them if i take it out they charge be $1-$4 each time to instantly transfer. Ridiculous.",
      "replyDate": "2024-03-17T19:38:52.435Z",
      "replyText": "Hi there, we hear that you may not have received the assistance you were expecting, and we know important it's for you to be able to order a Cash Card. Our team wants to take a deeper look into this and help clarify what happened. Can you please get in touch with the Cash App team right away? http://help.cash.app/3128.\n",
      "version": "4.38.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "78d5995b-b908-470c-97d1-8999b7bb0fb7",
      "userName": "dennis phillips",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXImhPR7IGeyCvvYmXTd9CM2R5y51CQtoTRyciLBXm_-w",
      "date": "2024-03-02T12:13:09.720Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=78d5995b-b908-470c-97d1-8999b7bb0fb7",
      "title": null,
      "text": "I'm missing so many features with current up to date app that my fiance, who's had cash app years less and lived in the same state and household as me, has. I can't borrow despite being paid twice as much as her monthly. Pay all my bills and never overdraft. And now I can't even add cash to my card because I also don't have add paper cash feature like my fiance does. These are big features. Hell even when depositing a check, it won't give me the option to instantly deposit it. It makes me wait.",
      "replyDate": "2024-03-02T21:20:10.843Z",
      "replyText": "This is troubling to hear, Dennis. Some customers may have access to features that others do not, but you can still use Cash App’s other features to add funds. However, we'd like to take a closer look at your account to give you all the info about the rest of the features you are missing. Feel free to contact us here: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 88,
      "criterias": []
    },
    {
      "id": "30ae256f-43de-463e-917e-ee19e5a937b1",
      "userName": "Loucia Harris",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU-FCmsXoTumQyANw3Hppa0EQyTrlkAYjHq6IVE0AhV",
      "date": "2024-01-23T22:10:56.417Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=30ae256f-43de-463e-917e-ee19e5a937b1",
      "title": null,
      "text": "Doesn't let UK people sign up, send verification code, asks country, and then just says \"you cannot sign up at this time\". Nice one. Edit: The app that is ON THE APP STORE is the most up-to-date version. If you have an issue with your app, fix it instead of giving the same useless \"solution\" to everyone.",
      "replyDate": "2024-01-23T21:47:48.617Z",
      "replyText": "This is not the experience we want you to have, Loucia. We know how important it's for you to be able to sign up. Please be sure you’re using the most up-to-date version of the app as well as the most recent version of your phone’s operating system, if you need more assistance contact us here: http://help.cash.app/3128 so we can take a closer look\n",
      "version": "4.30.0",
      "thumbsUp": 167,
      "criterias": []
    },
    {
      "id": "4cf10096-147f-45d2-a0dc-3286ae9d7685",
      "userName": "Jonathan Pohlman",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIvMVFKB4bcs8sWikv-3lFX2AnVfI1b1Da3qT0E_zQs=mo",
      "date": "2024-03-13T15:02:00.541Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=4cf10096-147f-45d2-a0dc-3286ae9d7685",
      "title": null,
      "text": "They won't let you do cash deposits, when you have somebody send you money they prevent the money to be not sent. The customer service do not care nor they barley help in any situation what so ever. Just really all around I wouldn't recommend this app. Oh and also they let people do a lot of frauds and make fake accounts. They have more privilege then the people that are actually trying to use the app the correct way to make there life easier but instead cash app just makes it a lot difficult.",
      "replyDate": "2024-03-13T19:27:17.890Z",
      "replyText": "Hello Jonathan, thank you very much for taking the time to make this comment. We certainly understand that this situation is not desirable. We kindly invite you to reach us, so we can continue taking a look at your account in order to provide you further help. You can use this link to contact us: https://help.cash.app/3128.",
      "version": "4.37.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "96b8b27c-0bdf-4a70-87aa-aa12488d0599",
      "userName": "AJ",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUiflzvDLe1UrYTs1H3HJpEvJu0E5x_9WviqW5AuUksqMQ",
      "date": "2024-03-05T15:06:12.720Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=96b8b27c-0bdf-4a70-87aa-aa12488d0599",
      "title": null,
      "text": "I am closing my account along with each one of my family members accounts because there is not ONE tool or option to dispute, cancel, reverse or any other way to get your money back once a transaction begins or completes. They will only help merchants. If I make a purchase & the transaction isn't like it's supposed to be whether the amount is too much or I do not receive the goods Cash App won't do anything to help. Sure it seems like there are things you can do but you just run in circles",
      "replyDate": "2024-03-05T21:09:28.920Z",
      "replyText": "Hi there, this is not the experience we want you to have. We know how important your funds are, and we hear that you may not have received the assistance you were expecting. We'd like to know more about what happened here. Mind sending our team a message, so we can make sure you are getting taken care of? http://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 10,
      "criterias": []
    },
    {
      "id": "1df4f545-1fdb-4188-a2fe-4c7b376c2bfb",
      "userName": "Christopher “Chris” Fitch",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU1Fb5qnUAalN9Kxmf7F6zoMJR0FmSpzcrnkfpvy7dJjQD2",
      "date": "2024-03-11T00:01:38.755Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=1df4f545-1fdb-4188-a2fe-4c7b376c2bfb",
      "title": null,
      "text": "Get paid up to 2 days early, buy/transfer/sell BTC, send money to friends and family instantly and many other awesome features. I've been using the Cash App for a few years now and their support has been more helpful when I needed them than the credit union I've been a member at for nearly 40 years is. This service works great for me but ALWAYS do your own research!",
      "replyDate": "2024-03-11T21:48:34.780Z",
      "replyText": "We are happy to see that you are having a great experience with Cash App, Christopher. We love to hear this, and thank you for trusting us. We hope things continue to run smoothly, but if you ever need us, we are just a message away: http://help.cash.app/3128.",
      "version": "4.37.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "faa81eef-e5c6-479b-9088-5c12879e62ef",
      "userName": "Ahyduh eye_duh",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIyHTNDWH_DftjfVqiBeahV6dnUVeRDBU4328nGKtpsXw=mo",
      "date": "2024-03-10T01:13:33.935Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=faa81eef-e5c6-479b-9088-5c12879e62ef",
      "title": null,
      "text": "There was a suspicious activity that occured with my debit card. I connected to cash app chat to report that my card had been unlinked. All of a sudden my card was relinked while was placed on hold. Customer service did a poor job of not providing an explanation... nothing at all. So, I wanted to request a new card but I be damned I have to pay for it, after what happened. I find that suspicious and do not trust their business. I do not recommend cash app due to my own personal experience.",
      "replyDate": "2024-03-11T17:15:14.378Z",
      "replyText": "We know you may not have received the assistance you expected in the past, but we're glad to help. We prioritize your account's safety and take a number of steps to make sure your account is protected. You can learn more here: https://cash.app/security. We'd be glad to take a closer look at this. Make sure to contact us: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "1cb74c03-d6c9-4cf7-9aae-78f978e231b6",
      "userName": "Jacob Miller",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI9XS5ISOONC_rB0bgtDLRMUvS94SpUEWxi-BgAjP8y=mo",
      "date": "2024-03-17T18:30:24.193Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=1cb74c03-d6c9-4cf7-9aae-78f978e231b6",
      "title": null,
      "text": "Ordered a new card which is taking an unnecessarily long time to arrive and wana make some purchases in the meantime but when i look at the digital version in the app, i can't see the full expiration date on the card for some strange reason! a Flaw in the app's design (1 of Many!) So i attempt to obtain the expiration date by contacting customer support & get nothing but a frustration headache! Told em 5Times i need expiration date & they keep telling me how to access the card number!! Buncha BS",
      "replyDate": "2024-03-17T19:36:38.573Z",
      "replyText": "We understand you may not have received the assistance you were expecting in the past, Jacob, but we're happy to help how we can from here. We'd like to better understand the issue you're experiencing with your Cash App Card. Mind contacting us again, so we can make sure you are getting taken care of? https://cash.app/contact.",
      "version": "4.38.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "f0d875ec-acd4-4ada-abf3-d2ad08c16392",
      "userName": "Lori Hisel",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUyjO8HXCydrIoL0kCdJDsH73J9IVk15Cr4b-3e0NgO3A",
      "date": "2024-03-01T16:49:52.442Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=f0d875ec-acd4-4ada-abf3-d2ad08c16392",
      "title": null,
      "text": "THEY SENT MY $$ TO NONEXISTENT ACCOUNT!!!! BEWARE BEWARE BEWARE!!! Declines payments, my bank won't accept \"Cash Out\" from them. It's pretty useless if it won't accept payments and I can't access the funds that do make it into the app. As soon as I AM able to get the cash out from the one payment that actually went through, I'm deleting this app.",
      "replyDate": null,
      "replyText": null,
      "version": "4.36.0",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "3c1728b1-f7fd-4869-98ef-09f204ecab1f",
      "userName": "Kathryn “Socje”",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVU4ALbKyK2M-hAjLAg89BEwaBBeIOWdaqsm60aIknIOA",
      "date": "2024-03-04T18:22:01.670Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=3c1728b1-f7fd-4869-98ef-09f204ecab1f",
      "title": null,
      "text": "Worked fine for two transactions, then completely refused to accept multiple attempts to send money to a friend in need. I checked with my bank. That was not the problem. Contacted CashApp multiple times... No help at all. Their only response to this review is that I should contact them about this problem. They WERE contacted, multiple times. I'm back to using PayPal.",
      "replyDate": "2024-02-22T21:27:46.719Z",
      "replyText": "We understand the importance of sending these funds, Kathryn. As part of our ongoing commitment to keeping the app safe and secure for all our customers, a payment may be canceled by Cash App. Either party, sender or receiver, can affect how a payment is processed. If you have additional questions, reach out to us here: https://cash.app/contact.\n",
      "version": "4.36.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "9d6820e1-b034-48fe-a33b-dbb2dd395cd4",
      "userName": "Zycu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU4FjhJjzHTuBS1hT5GPDjfNtgR72FVQaYBV4TGMjkZivI",
      "date": "2024-03-14T18:39:14.396Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=9d6820e1-b034-48fe-a33b-dbb2dd395cd4",
      "title": null,
      "text": "The app was great until I deployed to Africa. I had to use a VPN to use it there. I transferred money to my disabled mother on a regular basis. My account was disabled without warning or explanation other than terms of service violated. I submitted a request to learn what's wrong, and it's been 7 days with no contact at all. I'll be moving to an alternative app. 1 star~",
      "replyDate": "2024-03-14T20:20:16.855Z",
      "replyText": "Hey Zycu, we understand that your account was closed and know the situation is inconvenient. We don't want you to be excluded, but expanding Cash App. For more information, please review our Terms of Service: https://squ.re/cashapptos. If you'd like to tell us more or need help, please don't hesitate to reach out here: https://help.cash.app/3128.\n",
      "version": "4.37.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "865394ec-d471-4993-87b4-37c48e1e6576",
      "userName": "L Strickfaden",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK-LFvdDuJ17pP-5Vk1C-00LNFSb3GmpO7raHX7pcitptQ=mo",
      "date": "2024-03-04T16:25:37.500Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=865394ec-d471-4993-87b4-37c48e1e6576",
      "title": null,
      "text": "Have had many issues with this app. First, the limits say one thing, the app does another. Go round and round for answers only to receive the same reteric in writing. The tab button for $ purchases doesn't always work unless you use the preset amount. The rolling seven day limits are way off. Blocks you out of adding or purchasing. Seriously, I'm considering getting rid of this all together.",
      "replyDate": "2024-03-04T21:13:50.510Z",
      "replyText": "Hi there, this is not the experience we want you to have. We'd like to know more about what happened here. Mind sending our team a message, so we can make sure you are getting taken care of? http://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "e64115a6-2e6e-4f1f-83e6-92d89e690b96",
      "userName": "Drewsyer GS",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKuuJUQmZ6uh5ASlfIx4l41-dfJbFcRRPpjOwHdPshk=mo",
      "date": "2024-03-07T21:38:25.410Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=e64115a6-2e6e-4f1f-83e6-92d89e690b96",
      "title": null,
      "text": "Pretty nice definitely a lot better than what it used love that you can customize your own debit card then they sent it to you definitely awesome, would definitely recommend getting a debit card it will be way easier to use your cash app card and saves you money from cashing out only thing youd be charged with is withdrawning money from a atm.",
      "replyDate": "2024-03-07T22:23:12.959Z",
      "replyText": "Thank you for being part of the Cash family! It is amazing to see that you are loving Cash App. We hope you never need it, but always feel comfortable using this link to get in touch with us if you ever require assistance: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "c18585b7-5abe-4539-b624-29bdf9d16e49",
      "userName": "TerranceLee",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLIWm8LsPFhAXPVdqrJTj2Jvusw_7gPLYjjy4Ar55_m=mo",
      "date": "2024-03-03T16:36:52.882Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=c18585b7-5abe-4539-b624-29bdf9d16e49",
      "title": null,
      "text": "Great app my top 10 it's number one when it comes to a small eazy to customize and edit for personal or business they help with taxes and you can by and build up bit coin and on top all that you can by small investments that can grow over time. Treat them right and you will forever have a great quick success in financial education. I can't say enough good things about cash app. I think off and on I been using it over 12+ yearS. Thanks cash app. Much love. Terrylee",
      "replyDate": "2024-03-03T18:44:28.417Z",
      "replyText": "We are so happy to hear it, Terrance! Thank you for taking the time to leave us this wonderful feedback. If there is anything we can ever do to keep things running smoothly for you, we are just a message away: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "e3bf9ae6-e6f3-4196-8880-7fd22cb6a914",
      "userName": "Cameron Johnson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXa9DkqoVBj9VdjLOFV637wr66evjnF1rkFG2ARB4RWT8Y",
      "date": "2024-03-02T18:03:22.837Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=e3bf9ae6-e6f3-4196-8880-7fd22cb6a914",
      "title": null,
      "text": "I would definitely say it's a good app it's very convenient when you need to send money to someone fast. I find it weird that you can only use a booster once every seven days, if it was once a day it would be better, I use Uber pretty often so to only be able to use the booster once a week isn't very beneficial",
      "replyDate": "2024-03-02T19:53:52.387Z",
      "replyText": "Thanks for providing us with your feedback, Cameron. We’re always looking to improve our products based on our customers’ feedback. We'd be happy to look further into all available options that best suit your banking needs. If you'd like to tell us more or need our help, please don't hesitate to reach out here: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "102dc98a-ec7c-4de7-96e5-34398d3f0fba",
      "userName": "Lashonda Anderson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIReE7W6zfTgxUCtUdEIyBND4dngDkrtXdiuamRvC9P=mo",
      "date": "2024-03-10T22:06:01.471Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=102dc98a-ec7c-4de7-96e5-34398d3f0fba",
      "title": null,
      "text": "Not to shabby! The ATM service charge is too high, but great app all together. I recommend it as a secondary account. Plus, there are special features that help you save and invest. Totally cool app for teaching your teen how to manage money and business.",
      "replyDate": "2024-03-11T21:33:04.475Z",
      "replyText": "Hi Lashonda, we totally appreciate this positive feedback, and it’s great to know that we reached the desired quality levels. We are always at the forefront to provide you the best experience. If you need us at any moment, you can easily reach us through this link: https://help.cash.app/3128.",
      "version": "4.37.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "16ccdb81-f82b-41a8-a90a-59b9bc13e27d",
      "userName": "g sinclair",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKnNYmBOtJhKkW4kNFYjnZF_SnMhMe8qgokYuEma8tY=mo",
      "date": "2024-03-02T00:47:47.779Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=16ccdb81-f82b-41a8-a90a-59b9bc13e27d",
      "title": null,
      "text": "Repeating notifications. Edit... The problem isn't getting notifications. ( I know how to turn notifications on/off). The problem is I keep getting repeated notifications for the same event. Like every 5 minutes. Please fix.",
      "replyDate": "2024-03-02T00:42:30.325Z",
      "replyText": "Hi there. You can follow these steps to turn on your notifications. 1. Tap the profile icon on your Cash App home screen 2. Tap Notifications 3. Tap any email address or phone number to toggle notifications on or off, as well as select what kind of notifications you want to receive. If needed, please contact us: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "5de35961-2408-4094-9b36-0fac8a797657",
      "userName": "jason Casper",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKxP5a9FrJnnzOBCvNtAn0dMqQjLiHQh6OyYV1MFYwW054=mo",
      "date": "2024-03-05T15:20:50.270Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=5de35961-2408-4094-9b36-0fac8a797657",
      "title": null,
      "text": "The app done very well the first couple of months no problems..I would barrow money and pay it back barrow and pay back this went on until my limit was up to 200$..then when I got my income tax added to it..it automatically said I can't barrow money anymore I didn't understand or like it..so it made me a bit angry thats why they are only getting 2 star rating if that didn't happen I would've gave them 5 stars",
      "replyDate": "2024-03-05T21:44:22.647Z",
      "replyText": "Hey Jason, we understand how important it's for you to have the borrow feature. Please, contact us here: https://cash.app/contact to provide you the most accurate info about it.",
      "version": "4.36.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "ffd5064a-2093-4e71-a847-518f44528f90",
      "userName": "JaNeshia Wilson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVfkjeNhQXLhatr1Ql7zy0o94NEAtaRpr46vCKcKsfNPvOw",
      "date": "2024-03-17T14:39:37.762Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=ffd5064a-2093-4e71-a847-518f44528f90",
      "title": null,
      "text": "Been a loyal customer 5 yrs now. Oddly Cash App took a transaction 3/2, but for some odd reason, I cannot make a payment or send money to anyone. I've uninstalled/reinstalled, deleted bank info/added info. I reached an 'advocate', Viere, who was EVERYTHING BUT! No help at all, refused to escalate my issue. This is bogus. He kept telling me my card was prepaid. NO IT'S NOT. It's the SAME card & bank account I've used since opening a Cash App acct. Piss poor service at It's finest! Horrible!!",
      "replyDate": "2024-03-17T19:42:14.381Z",
      "replyText": "Hello JaNeisha, thank you for the feedback. We certainly understand how inconvenient it can be when you don’t receive the support expected and we would love to continue working with you. We are always trying to improve our services taking into account this information. You can always reach us using the following link: https://help.cash.app/3128.\n",
      "version": "4.38.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "081412d7-69ee-46af-a76d-0069bcb01a64",
      "userName": "Donna Windom",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIr4BC4wing1SJaDBs5DnYf8APiyHlXwwhoR9yzs1q1=mo",
      "date": "2024-03-01T22:09:01.656Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=081412d7-69ee-46af-a76d-0069bcb01a64",
      "title": null,
      "text": "Customer service is horrible. Nothing but automated or scripted responses. Closed case without contacting me or resolving anything. I closed my account and am going to be deleting the app. Edit....I used the support in the app and called and it was the same thing. The fact they just referred me to their contacts page on their website in their response which very much reads as am automated or scripted response just proves my point.",
      "replyDate": "2024-03-01T20:54:33.257Z",
      "replyText": "We understand you may not have received the assistance you were expecting in the past, but we're happy to help from here, Donna. We'd be happy to investigate further if there's something amiss. Please reach out if you're having trouble with your Cash App account. We’re just a message away: https://cash.app/contact.",
      "version": "4.36.0",
      "thumbsUp": 9,
      "criterias": []
    },
    {
      "id": "12305e67-3468-47ac-a532-fc811f48d206",
      "userName": "Reggie Hendrix",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUO3TJ2JqsGde9uGA-bkJwQtiDfo3qwmV4dPeOBhXx1QMgk",
      "date": "2024-03-15T20:59:38.103Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=12305e67-3468-47ac-a532-fc811f48d206",
      "title": null,
      "text": "Closed my account for violating terms, but won't even explain what I did wrong and customer support is trash. I looked at everything from support and still no answers. If you're going to close an account at least be specific as to why and have actual customer support versus automated responses. Again. THIS APP AND SUPPORT ARE TRASH.",
      "replyDate": "2024-03-15T20:13:12.122Z",
      "replyText": "Hey Reggie, we understand that your account was closed and know the situation is a frustrating one. If you'd like more information, please review our Terms of Service: http://squ.re/1HSv2Ss. Also for further assistance, please reach out through the available options here: https://cash.app/contact.",
      "version": "4.38.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "7e8faef4-66d7-4d3a-b9b6-fd5a1a3468ca",
      "userName": "Teri McGregor",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIiq5vloKr_F9lL5Fy_NGSAbmP-LxSqh6mGHZ7sfNaU=mo",
      "date": "2024-03-01T20:27:53.672Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=7e8faef4-66d7-4d3a-b9b6-fd5a1a3468ca",
      "title": null,
      "text": "one time I had accidentally marked 2 separate people to send money to. one I did not know and after money was sent, I tried to get it back from them. I never heard back and lost that money. I chalked it up to being a newbie and not paying attention. so, warning.... make sure this doesn't happen to you. otherwise, I like this app.",
      "replyDate": "2024-03-01T22:04:04.176Z",
      "replyText": "Thanks for sharing this review, Teri. We know how inconvenient it is when you accidentally send funds to an unknown person, and we'd like to take a closer look at this payment, so we can help you further. Feel free to contact us here: https://cash.app/contact.\n",
      "version": "4.36.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "10dd9a2d-9634-40c9-9b3a-c603ef17a571",
      "userName": "Benny Arnold",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWkiTm3izZPc5bGtcI7QameoDW-e7KEUaL8XEd_gJNmfcMX",
      "date": "2024-03-04T21:30:00.867Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=10dd9a2d-9634-40c9-9b3a-c603ef17a571",
      "title": null,
      "text": "As a lot of the reviews have already said before me, it wouldn't let me sign up from the UK and told me I couldn't sign up at this time, with no further explanation. I have the latest version, and my system is at its most recent version too. I don't know whether the app just isn't available in the UK now or what, but it's so frustrating.",
      "replyDate": "2024-03-04T21:58:46.114Z",
      "replyText": "We realize how frustrating it may be for your app to not work properly, Benny. Mind sending our team a message, so we can make sure you are getting taken care of? https://help.cash.app/3128.\n",
      "version": "4.36.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "89fb4ffe-1ae7-4083-ab03-fa3a05545c5e",
      "userName": "Buddy",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocINQRVHs7spj2HUIJhr5pu6gWNk8QAcboDK7bzWwp4Q=mo",
      "date": "2024-03-04T00:02:32.433Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=89fb4ffe-1ae7-4083-ab03-fa3a05545c5e",
      "title": null,
      "text": "I filled out my entire 2023 taxes but didn't submit them so I could add a little more later, but it did not save them when I came back. I contacted customer support & they said it is supposed to save on its own & now they have no record of any of my progress. Use a different tax app for sure unless you want to start all over again.",
      "replyDate": "2024-03-04T12:30:40.605Z",
      "replyText": "Hi there, we understand how important it is for you to make sure that the info that you provided when filing your taxes was saved correctly. We're continuously working to improve our services. If there's anything that you'd like to discuss. Please contact us here: http://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "93acce0e-d83a-4d02-9180-9b28bb0ba1b5",
      "userName": "revs 213",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU5jjlbRNk4BJrJvsHIIEl00GR5hFk4HsPGFTP9IKmNqKk",
      "date": "2024-03-15T16:48:44.947Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=93acce0e-d83a-4d02-9180-9b28bb0ba1b5",
      "title": null,
      "text": "This app is garbage, my mother cannot pay me anything at all because they keep canceling the charge for our \"protection\" even though we both have gone through the steps to verify our identity. Edit: Ended up removing my account because support was trash and refused to help in any capacity and insisted that we pay \"outside of the app.\" Isn't the whole point of the app to avoid using other methods of payment? If you want to send money, use a different app.",
      "replyDate": "2024-03-15T18:30:40.499Z",
      "replyText": "Hello there, thank you for taking the time to make this comment, we certainly understand how inconvenient can be when the payments are declined, the reason for this is that the security of our customer's accounts is our main goal. We kindly invite you to reach us using this link: https://help.cash.app/3128, to provide you with further support.",
      "version": "4.38.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "a0f902de-1e74-4edc-a64f-86e3cbc4c07c",
      "userName": "Jaimie Garcia",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIYUXtK-Kap-HrA7dTHS0rwAeDzPbycoT41ufMwDeWE=mo",
      "date": "2024-03-10T20:11:03.937Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=a0f902de-1e74-4edc-a64f-86e3cbc4c07c",
      "title": null,
      "text": "It was fine up until recently when cashapp refuses to release any holds on hotels till after 31 days even after they told me to send the bill which I did they even told me yes I have all the documentation but still recommend I wait my 31 days and they refused to release the pending transaction. One time before I was charged from a random place and I wanted to dispute and they said they could not find the transaction when I was looking at in the app while we spoke and they didn't do anything.",
      "replyDate": "2024-03-11T19:16:32.629Z",
      "replyText": "Hello Jaimie, thank you for making this review. We certainly understand that this is not an ideal situation, we would like to continue working by your side. We kindly invite you to reach us using this link: https://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "a4c38786-8c9a-48c6-af21-9a4c91e940a2",
      "userName": "Nikki Walker",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX3TiTCAb6W6FAG3qg1395dd1dgMroawnRG2-H6CavGbqU",
      "date": "2024-03-05T12:47:21.940Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=a4c38786-8c9a-48c6-af21-9a4c91e940a2",
      "title": null,
      "text": "I have to uninstall and reinstall this app when I need to use it because when it's installed on my phone, it causes a window to constantly pop up, showing both my internet browser apps, wanting me to select one. When I click on either app, it takes me to the cash app website.... do annoying.",
      "replyDate": "2024-03-05T21:08:28.236Z",
      "replyText": "This may be really annoying, Nikki. We want to clarify that Cash App doesn't make pop-up ads so this situation should be addressed with your phone's manufacturer. If you have further questions or are still experiencing this issue, please do not hesitate to write back in. http://help.cash.app/3128.",
      "version": "4.36.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "675ae9aa-4418-44ce-ba16-948eaade797a",
      "userName": "xYour.xLocal.xDemon",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKA80_WsaJDzrWhPgwRWniy6rcENg5yBBuul3k720H5Eg=mo",
      "date": "2024-03-15T11:53:34.988Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=675ae9aa-4418-44ce-ba16-948eaade797a",
      "title": null,
      "text": "Its been pretty bad so far i joined then i was also trying to get my fiance a account so i did the invite a friend for $10 and it made her go through more verification things than an actual bank does which is hella extra and really annoying let alone you have to pay $5 to even fully get the $10 dollars which we dont care about we just wanted the account but it also gave that option so we was like oo first bit of money on our account HA NOT! I got my acc closed now so not very happy",
      "replyDate": "2024-03-15T18:21:03.256Z",
      "replyText": "Hi there, we understand how important it is for you to be able to have a Cash App account for your fiancée and keep using your own account. Ensuring our customers receive the support they need is a top priority for us. We'd like to take a deeper look for you. You can get in touch with us here: http://help.cash.app/3128.",
      "version": "4.38.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "aa24efc7-f8a3-4f7f-92d6-51d0c905c720",
      "userName": "brittany schuffenecker",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK4th2d4zO7U9uhxHayUTRKCwyPNAl_yMz9MRJcTiTZ=mo",
      "date": "2024-03-17T14:54:22.410Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=aa24efc7-f8a3-4f7f-92d6-51d0c905c720",
      "title": null,
      "text": "I used to love this until you had to add your debit card. I tried to ask customer service about why I had to but they had no answer just I can't help you further. They ended the chat without any answers. I don't like the fact that money can be taken without you putting money in your account that's what happens when you add your debit card. I deleted my card from cash app because of that.",
      "replyDate": "2024-03-17T19:40:58.988Z",
      "replyText": "Hello Brittany, thank you for the feedback. We certainly understand how inconvenient it can be when you don’t receive the support expected, and we would love to continue working with you. We are always trying to improve our services taking into account this information. You can always reach us using the following link: https://help.cash.app/3128.\n",
      "version": "4.38.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "ecec4081-7998-42d5-af80-15d9c09fcca0",
      "userName": "vale villa",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUseRn3uPCvgoY3WuQ7YItsxjfnSQWtZVr8in4Yu0sy-WE",
      "date": "2024-03-11T18:13:19.296Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=ecec4081-7998-42d5-af80-15d9c09fcca0",
      "title": null,
      "text": "Contacted cashapp support but no help they said they had no information on when I would be eligible to deposit paper money again and they couldn't change it, even if I've used it before. That's the reason for the one star everything is verified so that wasn't the issue. I've already contacted cashapp support they couldn't help me",
      "replyDate": "2024-03-11T18:11:20.152Z",
      "replyText": "We hear your frustration with our team, and understand the urgency of being able to add funds at the preferred locations, Vale. You can learn more about the Paper Money feature by checking out this article: https://cash.app/help/us/en-us/6488. We'd be glad to take a closer look at this for accuracy. Make sure to contact us: https://cash.app/contact",
      "version": "4.37.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "cc59fbb5-6f8c-41b3-a946-61841d634464",
      "userName": "Shana Adkins",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWqb86hwP0069lWmHM5XPIcsylkPhTWPLXViuJYqrKv6sCy",
      "date": "2024-03-02T23:41:13.334Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=cc59fbb5-6f8c-41b3-a946-61841d634464",
      "title": null,
      "text": "this app is way too easy for hackers to access. I submitted my bank info and within 20 minutes another unknown account was added to mine. be VERY careful. check your information regularly!! Update, very responsive and helpful. With any financial institution please protect your account. I cannot say it's the fault of this business everyone is a target.",
      "replyDate": "2024-02-06T23:26:09.478Z",
      "replyText": "This is troubling to hear, Shana. We are committed to your security and finding an unknown bank is not ideal. We'll continue to work hard to improve this. Additionally, you can review this information to further protect your account: http://help.cash.app/3127. Feel free to contact us here: https://cash.app/contact if necessary.",
      "version": "4.36.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "514c5df8-4a6c-4a66-ab25-fa7fced2a8b0",
      "userName": "Elizabeth Ludtke",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ1x7irtkrLgGIoAj90fMhmxz-v0fa4aOtoRAPujJiI=mo",
      "date": "2024-02-28T05:40:15.255Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=514c5df8-4a6c-4a66-ab25-fa7fced2a8b0",
      "title": null,
      "text": "Why is cash app opening my web browser every single time I wake up my screen? I already have the app downloaded, every pop up blocker is turned on, no permissions. I've Uninstalled this app, the browser app, restarted my phone. If I could give less than one star for how annoying it is to have 17 tabs opened, I would.",
      "replyDate": "2024-02-28T19:45:34.428Z",
      "replyText": "We hear you, and we fully understand how frustrating these situations can be with these tabs opening in your browse, Elizabeth. Please be sure you’re using the most up-to-date version of your phone’s operating system, if you need more assistance contact us here: https://cash.app/contact and we will be happy to help.",
      "version": "4.36.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "bf2638b3-eacf-45c9-a412-679b49450e56",
      "userName": "Kayla Frazee",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVprfXcLR2YmBvFZ5oS8Tt_FZVVTjAPnifxSlV1BGQx6P0",
      "date": "2024-03-05T16:48:28.770Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.squareup.cash&reviewId=bf2638b3-eacf-45c9-a412-679b49450e56",
      "title": null,
      "text": "They will take money from your account even though the merchant has released the hold. It doesn't matter if you have the final invoice from the merchant cashapp just tells you to contact the merchant when they are the one who steal money from your account. I have been a loyal cashapp customer for almost 7 years until now. They are rude and brush your concerns off like you don't matter. I wish there was an option to Give them 0 stars. I wish I could tell the whole story but there isn't space!",
      "replyDate": "2024-03-05T21:53:19.827Z",
      "replyText": "Hey Kayla, we can assure you that Cash App will never steal from our customers. Keeping accounts secure and the app safe is a top priority to us. We'd like to better understand the issue you're experiencing with your account. Please write in when you have a moment: https://cash.app/contact",
      "version": "4.36.0",
      "thumbsUp": 4,
      "criterias": []
    }
  ],
  "nextPaginationToken": "CmoKaApmMCwxMDAwMDAwLjcyNzE5NTg1OSwxNDU5Njc1ODIyNjgsImh0dHA6Ly9tYXJrZXQuYW5kcm9pZC5jb20vZGV0YWlscz9pZD12Mjpjb20uc3F1YXJldXAuY2FzaDoxIiwxLGZhbHNl"
}